{"top_img": "http://occupydemocrats.com/wp-content/uploads/trumpobama-2.png", "text": "24.8k SHARES SHARE THIS STORY\n\nRepublican nominee Donald Trump’s Ohio chairwoman recently took it upon herself to prove to the world just how delusional the right-wing in America really is when Kathy Miller told reporters that racism in America didn’t exist until President Obama. “I don’t think there was any racism until Obama got elected. We never had problems like this … Now, with the people with the guns, and shooting up neighborhoods, and not being responsible citizens, that’s a big change, and I think that’s the philosophy that Obama has perpetuated on America. Growing up as a kid, there was no racism, believe me. We were just all kids going to school.”\n\nThis perfectly illustrates how the right-wing digs their mental bogs of ignorance – blame Obama for literally everything; absolve self/race/identity group of all responsibility, then construct pleasant fantasy.\n\nSupporting her candidate’s constant efforts to sabotage what little support he has within the African-American community, she then went on to say that black Americans are responsible for the decades of their socioeconomic disenfranchisement by saying that “if you’re black and you haven’t been successful in the last 50 years, it’s your own fault. You’ve had every opportunity, it was given to you. You’ve had the same schools everybody else went to. You had benefits to go to college that white kids didn’t have. You had all the advantages and didn’t take advantage of it. It’s not our fault, certainly.”\n\nTo put a big white cherry on this perverse cake of racism, she then felt the need to add that “the Black Lives Matter movement is a stupid waste of time” and that low voter turnout is probably related to how black Americans “were raised.”\n\nIn one fell swoop, this woman has erased four hundred years of slavery, segregation and the Jim Crow era, the widespread lynchings of black Americans by radical Christian terrorist organizations like the Ku Klux Klan, the ghettoization of the inner cities, mass incarceration and the War On Drugs, and the wholesale slaughter of black Americans by law enforcement from the record. Instead, she is blaming the only black president our nation has ever had, when in reality it was his election that brought all the racism to the surface.\n\nShe is echoing sentiments shared by a large portion of the American population which has been either brainwashed by media narratives or too ignorant know any better, but it shows just how large a divide we face in try to engage with people so entirely divorced from reality. When the daft old woman was informed that this might sound offensive to some people, she replied “I don’t care, it’s the truth.”\n\nThe Trump campaign in a nutshell, ladies and gentlemen.\n\nUPDATE: Kathy Miller has resigned her from her position with the Trump campaign and has issued an apology. It should be noted the Trump campaign has yet to apologize for anything this campaign season.\n\nWatch it here – her remarks begin at 4:40:\n\nAdd your name to millions demanding that Congress take action on the President’s crimes. IMPEACH DONALD TRUMP!", "authors": ["Colin Taylor", "Grant Stern", "Brett Bose", "Natalie Dickinson"], "keywords": [], "meta_data": {"generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "og": {"site_name": "Occupy Democrats", "description": "\"I don't care. It's the truth!\"", "title": "UNHINGED: Trump Campaign Chair Says Racism Didn't Exist Before Obama In Viral Rant", "locale": "en_US", "image": {"width": 559, "identifier": "http://occupydemocrats.com/wp-content/uploads/trumpobama-2.png", "height": 286}, "updated_time": "2016-09-22T16:47:41-04:00", "url": "http://occupydemocrats.com/2016/09/22/unhinged-trump-campaign-chair-says-racism-didnt-exist-obama-viral-rant-2/", "type": "article"}, "twitter": {"image": "http://occupydemocrats.com/wp-content/uploads/trumpobama-2.png", "creator": "@ColsBols", "description": "\"I don't care. It's the truth!\"", "card": "summary", "title": "UNHINGED: Trump Campaign Chair Says Racism Didn't Exist Before Obama In Viral Rant"}, "fb": {"admins": "100010978633754 , 66801782", "app_id": 187891551586426}, "msapplication-TileImage": "http://occupydemocrats.com/wp-content/uploads/odfavicon-2.gif", "article": {"section": "Politics", "tag": "Trump", "published_time": "2016-09-22T16:44:50-04:00", "modified_time": "2016-09-22T16:47:41-04:00", "author": "https://www.facebook.com/ColsBols"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1"}, "canonical_link": "http://occupydemocrats.com/2016/09/22/unhinged-trump-campaign-chair-says-racism-didnt-exist-obama-viral-rant-2/", "images": ["http://occupydemocrats.com/wp-content/uploads/od-political-WEBSITE-SIDEBAR-SMALL.png", "http://occupydemocrats.com/wp-content/uploads/Bye-Bye-Trump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/cher-1-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/jklol-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/trumprally-1-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/occupydemocrats-logo2x.png", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2016-10-22-at-4.07.01-PM.png", "http://occupydemocrats.com/wp-content/uploads/Bakker-340x150.jpg", "http://0.gravatar.com/avatar/94cbb3560cca3d2e5338216af4b13172?s=164&d=mm&r=g", "http://occupydemocrats.com/wp-content/uploads/trumppence-3-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/donald-trump-with-felix-sater-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/sallyyates-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/DrunkTrump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2017-08-29-at-5.35.14-PM-340x150.png", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2017-08-29-at-6.51.03-PM-340x150.png", "http://occupydemocrats.com/wp-content/uploads/trumpobama-2.png"], "title": "Trump Campaign Chair Says Racism Didn't Exist Before Obama In Viral Rant", "url": "http://occupydemocrats.com/2016/09/22/unhinged-trump-campaign-chair-says-racism-didnt-exist-obama-viral-rant-2/", "summary": "", "movies": [], "publish_date": {"$date": 1474502400000}, "source": "http://occupydemocrats.com"}
