{"top_img": "http://static.politico.com/c5/b5/f61c15304140a6613cfd47e22870/untitled-1.jpg", "text": "Ahmad Khan Rahami is pictured in an undated photo provided by the FBI. | AP Photo 28-year-old man sought in Manhattan blast\n\nNEW YORK — Police released a photo of a 28-year-old immigrant wanted for questioning Monday in bombings that rocked a Manhattan neighborhood and a New Jersey shore town, and New York's governor and mayor said the blasts are looking increasingly like an act of terrorism with a foreign connection.\n\nAhmad Khan Rahami, a naturalized U.S. citizen from Afghanistan with an address in Elizabeth, New Jersey, should be considered armed and dangerous, New York City Mayor Bill de Blasio said in one of a series of TV appearances just minutes after the photo was released.\n\nStory Continued Below\n\nIn addition to the blast in Manhattan's Chelsea neighborhood on Saturday, a pipe bomb exploded in a New Jersey shore town before a charity 5K race and an unexploded pressure cooker device was found blocks away from the explosion site in Chelsea. On Sunday, five explosive devices were discovered at an Elizabeth train station.\n\nNew Jersey State Police said Monday, citing the FBI, that the bombings in Chelsea and the New Jersey shore town Seaside Park were connected. No one was injured in the Jersey blast.\n\nNew York Gov. Andrew Cuomo said as investigators gathered information they learned there were \"certain commonalities among the bombs,\" leading authorities to believe \"that there was a common group behind the bombs.\"\n\n\"We want to get this guy in for questioning,\" de Blasio said on CNN. \"We need the facts to be able to piece all this together. ... I think we're going to know a lot more in the course of the day. Things are moving very quickly.\"\n\nEarly Monday, FBI agents swarmed an apartment above a fried chicken restaurant in Elizabeth that's tied to Rahami. The activity came hours after one of five devices found at the nearby Elizabeth train station exploded while a bomb squad robot attempted to disarm it. No one was injured.\n\nSaturday night's blast in the bustling Chelsea neighborhood injured 29 people, and another unexploded device made out of pressure cooker was found several blocks away. In the immediate aftermath of that bombing, de Blasio and Cuomo were careful to say there was no evidence of a link to international terrorism. Both said Monday that appears to be changing.\n\n\"The more we learn with each passing hour, is it looks more like terrorism,\" de Blasio said in a later interview on NY1 News.\n\nCuomo, in a separate interview on MSNBC, said: \"Today's information suggests it may be foreign related but we'll see where it goes. ... My operating premise is anytime, anywhere, seven days a week you could have an incident like this.\"\n\nThe White House said President Barack Obama was briefed throughout the night and early Monday on the investigation into bombs found in New York City and New Jersey. Spokesman Josh Earnest said Obama will comment publicly later Monday.\n\nOn Sunday night, FBI agents in Brooklyn stopped \"a vehicle of interest\" in the investigation of the Manhattan explosion, according to FBI spokeswoman Kelly Langmesser.\n\nShe wouldn't provide further details, but a government official and a law enforcement official who were briefed on the investigation told The Associated Press that five people in the car were being questioned at an FBI building in Manhattan.\n\nThe officials spoke on condition of anonymity because they were not authorized to talk about the ongoing investigation.\n\nNo one has been charged, and the investigation is continuing, Langmesser said.\n\nCuomo, touring the site of Saturday's blast in Chelsea, said the unexploded pressure cooker device appeared \"similar in design\" to the bomb that exploded in Chelsea.\n\nOn Sunday, a federal law enforcement official said the Chelsea bomb contained a residue of Tannerite, an explosive often used for target practice that can be picked up in many sporting goods stores. The discovery of Tannerite may be important as authorities probe whether the two New York City devices and the pipe bomb at the Jersey shore are connected.\n\nCellphones were discovered at the site of both bombings, but no Tannerite residue was identified in the New Jersey bomb remnants, in which a black powder was detected, said the official, who wasn't authorized to comment on an ongoing investigation and spoke to the AP on condition of anonymity.\n\nThe pipe bomb exploded Saturday in Seaside Park, New Jersey, before a charity 5K race to benefit Marines and sailors. The race was canceled and no one was injured.\n\nThe bombings in New York City and New Jersey happened the same day that a man stabbed and injured nine people at a Minnesota mall before an off-duty police officer fatally shot him. The St. Cloud police chief said the man reportedly made at least one reference to Allah and asked a victim if he or she was Muslim before attacking. The Islamic State group has claimed responsibility.\n\n\n\nAuthors:", "authors": ["Jack Shafer", "Associated Press"], "keywords": [], "meta_data": {"description": "&quot;We need to get this guy in right away,&quot; Bill de Blasio says.", "og": {"site_name": "POLITICO", "description": "&quot;We need to get this guy in right away,&quot; Bill de Blasio says.", "title": "28-year-old man sought in Manhattan blast", "url": "http://politi.co/2cYbq79", "image": "http://static.politico.com/c5/b5/f61c15304140a6613cfd47e22870/untitled-1.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/naturalized-afghanistan-citizen-sought-in-manhattan-blast-228351", "images": ["http://static.politico.com/c5/b5/f61c15304140a6613cfd47e22870/untitled-1.jpg", "https://static.politico.com/dims4/default/e21986e/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fc5%2Fb5%2Ff61c15304140a6613cfd47e22870%2Funtitled-1.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "28-year-old man sought in Manhattan blast", "url": "http://politi.co/2cjO7Ux", "summary": "", "movies": [], "publish_date": {"$date": 1474272304000}, "source": "http://politi.co"}
