{"top_img": "http://static.politico.com/68/ed/10eb44924a93b9b63c0aca228961/162209-mike-pence-ap-1160.jpg", "text": "Mike Pence said \"we ought to set aside this talk about institutional racism and institutional bias.\" | AP Photo Pence: There's too much talk of police department 'racism'\n\nCOLORADO SPRINGS, Colo. — Mike Pence said there is too much talk of \"institutional racism and institutional bias\" in the wake of unrest following police shootings in Tulsa, Oklahoma, and Charlotte, North Carolina.\n\n\"Police officers are human beings,\" Pence said at a pastors' roundtable at Radiant Church here. \"And in difficult and life-threatening situations, mistakes are made and people have to be held to strict account, but we both believe that it's important that we have a president who, as the chief law enforcement officer of the United States, stands behind the men and women who serve in law enforcement.\"\n\nStory Continued Below\n\nPence said that police officers are \"the best of us.\"\n\n\"We ought to set aside this talk, this talk about institutional racism and institutional bias,\" he said, calling such assertions \"rhetoric of division.\"\n\nAsked by Bishop John Brannon, who is African-American, what Pence would \"personally do\" to heal divides in the country, Pence brought up the recent shootings.\n\n\"When there's any loss of life, we have to speak with compassion, we have to make it clear that there will be a thorough investigation and that justice will be served and that high standards will be upheld,\" Pence said.\n\nPence sought to strike a tone of unity in his remarks, repeating that \"there will always be more that unites us in this country than could ever divide us.\"\n\nAt a town hall event shortly after the pastors roundtable, Pence used the same line — that there is too much talk of \"institutional racism\" — to take aim at Democratic nominee Hillary Clinton.\n\n\"But in the wake of these tragic events in Tulsa and Charlotte, sadly our opponent once again refers to what she calls the institutional racism in law enforcement,\" Pence said. \"We heard this week again of the 'systemic racism' in law enforcement in this country.\"\n\nPence said people expect a \"thorough, immediate and transparent investigation\" in the wake of police shootings.\n\nPence went on to say that police are \"not a force for racism in America, they are a force for good, they stand for our families, they protect our homes and they deserve our support and respect.\"\n\nHe also said he respected protesters' constitutional right to assemble, but added \"there is no right to engage in violence against our citizens or against our property.\"\n\nTrump expressed his own concern about the Tulsa shooting on Wednesday, suggesting the shooting happened because the officer in question was “choking” under pressure.\n\nAuthors:", "authors": ["John Bresnahan", "Heather Caygle", "Matthew Nussbaum", "Jack Shafer"], "keywords": [], "meta_data": {"description": "He said that police officers are &quot;the best of us.&quot;", "og": {"site_name": "POLITICO", "description": "He said that police officers are &quot;the best of us.&quot;", "title": "Pence: There's too much talk of police department 'racism'", "url": "http://politi.co/2cp6mTK", "image": "http://static.politico.com/68/ed/10eb44924a93b9b63c0aca228961/162209-mike-pence-ap-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/mike-pence-police-shootings-racism-228537", "images": ["https://static.politico.com/dims4/default/f7e9380/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F68%2Fed%2F10eb44924a93b9b63c0aca228961%2F162209-mike-pence-ap-1160.jpg", "http://static.politico.com/68/ed/10eb44924a93b9b63c0aca228961/162209-mike-pence-ap-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Pence: There's too much talk of police department 'racism'", "url": "http://politi.co/2cUFU8G", "summary": "", "movies": [], "publish_date": {"$date": 1474559104000}, "source": "http://politi.co"}
