{"top_img": "http://static.politico.com/88/c3/28f67bde470c91c23f6bfeabb8e0/162209-john-kerry-ap-1160.jpg", "text": "John Kerry says Washington cannot be successful alone. | AP Photo Kerry says Syrian diplomacy at impasse after truce collapses\n\nNEW YORK — The United States and Russia ended any pretenses Thursday of their cease-fire for Syria remaining in force after days of increased violence and the Syrian military's announcement of a new offensive in Aleppo.\n\n\"We can't go out to the world and say we have an agreement when we don't,\" Secretary of State John Kerry said after meeting the top diplomats from Russia and more than a dozen European and Middle Eastern countries.\n\nStory Continued Below\n\nKerry's statement, after three days of private and public diplomacy on the sidelines of the U.N. General Assembly, provided an ominous endnote to a week diplomats had hoped would be a major capstone toward peace. Instead, Kerry and Russian Foreign Minister Sergey Lavrov, who negotiated the truce two weeks ago, went their separate ways as violence in Syria flared anew and the relationship between the two key foreign powers in the conflict appeared to reach a new low.\n\nNo one spoke of being able to quickly resuscitate the cease-fire. While Kerry and Lavrov were set to hold more talks Friday, even confidence-building measures seem beyond their reach at this point.\n\nAs the diplomats huddled in a New York hotel, Syria's military command said it would restart operations in the northern city of Aleppo, scene of some of the most bitter fighting in recent months.\n\nAccording to one official present in the gathering, Kerry was informed of the news when his chief of staff showed him a headline on his BlackBerry. A furious Kerry then told the entire room, Lavrov included, that \"even while we are meeting here, they are doing this,\" said the official, who wasn't authorized to speak publicly on the matter and demanded anonymity.\n\nLavrov told Russian media that consultations would continue to \"guarantee\" the cease-fire.\n\nBut even as Kerry vowed to press on with all efforts to find a peaceful solution to the war between Syrian President Bashar Assad's Russian-backed government and U.S.-backed rebels, he acknowledged the current strategy wasn't working.\n\n\"We can't be the only ones trying to hold this door open,\" Kerry told reporters. \"Russia and the regime must do their part or this will have no chance.\"\n\nHe called for the immediate grounding of planes and helicopters that have launched airstrikes, including a Russian one earlier this week that the U.S. says hit an aid convoy, killing 20 civilians. Russia has denied responsibility, while raising a range of ulterior scenarios for how the caravan might have been struck.\n\n\"Absent a major gesture like this, we don't believe there is a point to making more promises or issuing more plans or announcing something that can't be reached,\" Kerry said, describing a \"moment of truth\" for Syria, Russia and all those trying to halt the bloodshed.\n\nThe meeting came after Assad told the AP in an interview in Damascus that the United States was to blame for the deal's failure. He cited U.S. inability to control \"terrorist\" groups and a weekend attack that killed dozens of Syrian soldiers. The U.S. apologized for what it described as a mistake.\n\nLavrov had sought a three-day pause in fighting to revive the cease-fire.\n\nBut U.S. officials said there was no point returning to a situation in which rebels would be pressed to hold fire, while the Syrian and Russian military's could violate the agreement.\n\nAuthors:", "authors": ["Jack Shafer", "Associated Press"], "keywords": [], "meta_data": {"description": "The secretary of state says the U.S. will continue pushing for a negotiated truce and political transition that can end five years of war.", "og": {"site_name": "POLITICO", "description": "The secretary of state says the U.S. will continue pushing for a negotiated truce and political transition that can end five years of war.", "title": "Kerry says Syrian diplomacy at impasse after truce collapses", "url": "http://politi.co/2cKJxgg", "image": "http://static.politico.com/88/c3/28f67bde470c91c23f6bfeabb8e0/162209-john-kerry-ap-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/syria-john-kerry-truce-end-228551", "images": ["http://static.politico.com/88/c3/28f67bde470c91c23f6bfeabb8e0/162209-john-kerry-ap-1160.jpg", "https://static.politico.com/dims4/default/3255382/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F88%2Fc3%2F28f67bde470c91c23f6bfeabb8e0%2F162209-john-kerry-ap-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Kerry says Syrian diplomacy at impasse after truce collapses", "url": "http://politi.co/2cURhx8", "summary": "", "movies": [], "publish_date": {"$date": 1474568230000}, "source": "http://politi.co"}
