{"top_img": "http://static.politico.com/2f/8c/e44158e84ee8a865e4ecedf0a1b9/160916-strauss-buchanan-loc.jpg", "text": "As my 25th wedding anniversary approached, I tried to be creative in buying gifts for my wife. I had the idea of a silver coin that marked 25 years of something or other. I went to a local coin shop, and as I idled over some of the display cases, I noticed a set of coins from the mid-19th century. Oddly, the coins from the 1840s and 1850s were large—up until 1857, when the coins started becoming, at best, half the size of the others.\n\n“Oh, the Panic of 1857,” the owner said when I asked him about the change of size. “It was really bad. The president didn’t seem to have any solution except to use less gold or silver in the coins.”\n\nStory Continued Below\n\nNow that is inept presidential decision-making. During the current election campaign, there has been a lot of gnashing of teeth over the possibility that—whoever the winner is—he or she will be so terrible as a leader they will bring down the republic as the worst president since independence. And before the current candidates were known, the two most recent White House occupants, Barack Obama and George W. Bush, have been consistently reviled by their detractors as the worst men to lead the country.\n\nBut Obama and Bush can both take heart. And Donald Trump and Hillary Clinton can gain solace, perhaps, from knowing that no matter how badly they do, they almost certainly won’t rank last. By my reckoning, that place belongs to James Buchanan, genial a man though he was. I’ve made quite a study of him. My innocent encounter at the coin shop only reinforced my lifelong determination to take an offbeat look at, let’s say, the lesser presidents. My father was definitely the only one in our suburban neighborhood with a biography of Franklin Pierce. Everywhere we went, he forced me to read historical plaques—stopping the car in a shrieking halt at times to view them. If I were to write a book about a president, it surely wouldn’t be about Washington or Lincoln, or even Silent Cal Coolidge. It would have to be about someone as ineffectual as possible.\n\nBuchanan, the only president from my native state, Pennsylvania, turned out to be my man.\n\nStart with his anemic, minimalist solution to one of America’s great financial downturns.\n\nFor a long time before Buchanan, in effect, precipitated the Panic of 1857, things were going well for the country, at least in an economic sense. There had been a bad downturn 20 years before, with multiple causes, like war in Europe, the dissolution of the Bank of the United States, and overspeculation in, oddly enough, slaves and Western land. The great acquisition of land under President James Knox Polk, from Oregon to California to Texas, reinvigorated the economy, and a boom lasted for the next two decades. Railroads were the big player, since so many people wanted to move West into the new territories and states. Manufacturing boomed domestically, and then with foreign trade as well, since Europe had quelled many of its hostilities and American items were cheaper than those on the Continent.\n\nThen the day before Buchanan took office, Congress passed what he wanted, the Tariff Bill of 1857, which lowered tariffs on a panoply of items from abroad—Buchanan wanted to stimulate foreign trade—but made American manufactured goods of the same sort less competitive.\n\nThree days later came the real fatal blow, though, the Dred Scott Supreme Court decision, which fell on the shoulders of Buchanan. The case had wound through state and federal courts for at least a decade, but Roger Taney, the Supreme Court chief justice, and a fellow alumnus, with Buchanan, of small Dickinson College, wanted it settled.\n\nScott was a slave to a military man who at times was stationed not in his native Missouri, a slave state, but in the Northwest Territories, which were nonslave. After his master died, Scott brought the case that he should be free because he had lived in nonslave territory. Buchanan wanted to be a hero, and thought if the case could be decided broadly, it could settle the question of slavery in the Union for good.\n\nBuchanan knew, too, though, that the court had five Southerners and four Northerners, and if the decision were split that way, it would be ineffective. He and Taney had apparently agreed to have a narrower decision, or remand the case back to the Appeals Court, if it were merely sectional, since they felt the need to have some sort of bipartisanship for the decision to be legitimate.\n\nIgnoring the idea of separation of powers, though, Buchanan browbeat Robert Cooper Grier, another Dickinson alumnus and a justice from Pennsylvania, to go along with the majority opinion, which Taney would write. Eventually, a New York native, Justice Samuel Nelson, wrote a concurring opinion, making the vote even less sectional.\n\nLegend has it that Taney, on the Capitol stairs just before he gave Buchanan the oath of office at the inauguration, told Buchanan that the decision would become public in the next few days. Buchanan apparently changed his speech to indicate that—and that he would be all for whatever the court decided.\n\nTwo days later, the decision came down. Taney castigated Scott, whom he said was not a citizen, being a slave, and thus could not bring any suit. He also wrote that the Constitution gave no state or territory the power to institute or, conversely, prohibit slavery. Thus all the compromises about it, going back to the 1820s, were invalid, and, in fact, the Fugitive Slave Law, requiring anyone who knew about it to return slaves to their owners anywhere in the country, was in force.\n\nHistorically, experts rate Dred Scott as the worst decision in the court’s history, but short of that, it was at the very least transformational for the country—with not just Taney, but surely Buchanan, responsible for it.\n\nAs appalled as most of the country was about the morals of the decision at the time, there was a practical downside, too. Now no one knew whether he or she wanted to go West, to use the railroads, or to start a business that railroads might profit from. Railroad stocks started to decline in value, and then a contagion hit, and it was free fall. By midsummer, no one could take a ride on the Reading, as Uncle Pennybags does in the Monopoly game, since the Reading Railroad had shut down, as did lines now and then famous like the Illinois Central. Several lines, like the Delaware, Lackawanna and Western and the Fond du Lac Railroad in Wisconsin, declared bankruptcy.\n\nThousands were thrown out of work, and banks started foreclosing on loans and property. Senator William Seward, the leader of the new Republican Party, come home from a vacation to find out he had lost most everything he owned—his stock in the Illinois Central, promoted to him by his rival Democrat Stephen Douglas, was virtually worthless.\n\nEvery bank in New York City effectively closed—none would convert coins or gold into bank notes. The oldest grain company in New York, N.H. Wolfe and Co., failed in August, as did the most prominent insurance business in the country, the Ohio Life Insurance and Trust Co.\n\nBuchanan and his administration did nothing to stem the public hysteria. Calm words might have quelled it, but his inaction only made for further runs on banks and, thus, more turmoil in markets.\n\nThe residue that mattered most, though, was the reaction caused by Dred Scott. Instead of promoting unity and opening up the West to more settlement, as Buchanan had thought, Dred Scott thwarted it, and brought an end to years of Northern prosperity.\n\nYet the South did not succumb as badly. Its agrarian culture was self-sustaining, and its cotton still had a market in Europe. There was a surge in arms sales there as well, the economic downturn in the North exacerbating regional tensions. The relative good times in the South caused Northerners of all parties to further blame Buchanan for being a Southern lackey.\n\nBuchanan’s response was underwhelming, almost disdainful. He said the federal government could do nothing. In his Annual Message in December 1857, he said he sympathized with the travails caused by the Panic, but he would do nothing for individual suffering. The government would continue to pay its obligations and would keep going on whatever public works projects it had started, but would begin no new ones. He said too many people had speculated in land and slaves and the like and “deserved the gambler’s fate.” Eventually, he noted, the youth and energy of the rugged American individuals would triumph, though there would clearly be an interim of rough times.\n\nIn a sense, he was right, because it took the rugged young Americans who went to war in 1861 to bring the economy back.\n\nThroughout his term, when a fork appeared in the road, Buchanan managed to take the wrong turn. When hostilities flared in Kansas, over whether that territory would enter as a slave or free state, Buchanan wavered over which of two proposed constitutions would be valid, exacerbating the killings, some done by the wild-eyed anti-slavery radical John Brown. When later Brown seized arms with a small cadre of followers in Harpers Ferry, West Virginia, just 40 miles from Washington along the Potomac, Buchanan again diddled before consulting Robert E. Lee, who had fortuitously been home in Arlington on leave from his post in Texas. Lee quickly went to Harpers Ferry to capture Brown and quell the raid.\n\nIn other ventures, though, Buchanan dashed troops out on strange and unproductive missions. He caused chaos in Utah, quelling what he thought to be a Mormon revolt, causing villages to be burned to the ground and dozens of lives lost over what was merely a jurisdictional dispute. He supported mercenary William Walker’s forays to conquer Nicaragua and Guatemala, and sent troops to try to annex parts of Paraguay, primarily to acquiesce to his Southern base that wanted more slave states to come into the union. Then there was the little known Pig War, started when a settler along the Canadian border on the San Juan straits in the Northwest, shot a pig owned by the Hudson Bay Co. that wandered onto his property. A standoff ensued until Buchanan sent troops otherwise guarding Kansas, where there was a real problem, out to calm the nonfatal—except to one pig—battle. This was at a time when there were about only 12,000 soldiers in the U.S. Army, stretched as thin as could be.\n\nAs the election of 1860 came close, Buchanan refused to support the one Democrat who could win, Stephen Douglas, because he just plain didn’t like him. That caused the party to split into three factions, each nominating a candidate, virtually ensuring Republican Abraham Lincoln the election.\n\nThe Southern states, which had threatened secession, started doing so during the interim between Lincoln’s election and his inauguration in March, thus under Buchanan’s watch. Buchanan took the unusual position that the Constitution did not allow secession, but the president could not do anything to prevent it.\n\nAs the first half-dozen states seceded, Buchanan lost several Cabinet members—he had a lot of Southern allies—and refused entreaties by many, including former President John Tyler, who would himself become a Confederate congressman, to find compromises to bring the wastrel states back into the fold.\n\nMeanwhile, Buchanan allowed the seizure of armaments and forts by the seceding states and suggested the abandonment of the one major fortified island in the South, Fort Sumter.\n\nEnter Lincoln, who has long been rated in serious surveys and schoolmarms’ speeches as the greatest of presidents. Lincoln no doubt was a man with plans and savvy, but I contend that the bar was set so low by his predecessor that maybe if there were no James Buchanan, the “Worst. President. Ever,” there would have been a few notches more on the presidential-rating scale for Abe Lincoln to climb.\n\nToday, George W. Bush is often rated one of the worst presidents in history, thanks to his authorship of the Iraq War and his presiding over the Crash of ’08 and the beginning of the Great Recession. Obama is sometimes seen in the same light, especially by the far right. But as happened with Honest Abe and his predecessor, perhaps that low bar will only make it easier for a President Hillary Clinton or a President Donald Trump to shine.\n\nRobert Strauss is author of the forthcoming Worst. President. Ever.: James Buchanan, the POTUS Rating Game, and the Legacy of the Least of the Lesser Presidents.", "authors": ["Jack Shafer", "Robert Strauss"], "keywords": [], "meta_data": {"description": "People are debating who will be more disastrous for the country, Trump or Clinton. But James Buchanan takes the cake.", "og": {"site_name": "POLITICO Magazine", "description": "People are debating who will be more disastrous for the country, Trump or Clinton. But James Buchanan takes the cake.", "title": "Worst. President. Ever.", "url": "http://politi.co/2cPVfsz", "image": "http://static.politico.com/2f/8c/e44158e84ee8a865e4ecedf0a1b9/160916-strauss-buchanan-loc.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/donald-trump-hillary-clinton-worst-president-james-buchanan-214252", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://static.politico.com/dims4/default/6aa1563/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F2f%2F8c%2Fe44158e84ee8a865e4ecedf0a1b9%2F160916-strauss-buchanan-loc.jpg", "http://static.politico.com/2f/8c/e44158e84ee8a865e4ecedf0a1b9/160916-strauss-buchanan-loc.jpg"], "title": "Worst. President. Ever.", "url": "http://politi.co/2cGdput", "summary": "", "movies": [], "publish_date": {"$date": 1474196700000}, "source": "http://politi.co"}
