{"top_img": "http://static.politico.com/33/4c/4d6ef8344746b686254cecd304f3/160922-edelman-kennedy-ap.jpg", "text": "AP Photo Backtalk Robert Kennedy Would Have Hated Donald Trump The GOP candidate is not the man of peace my former colleague makes him out to be.\n\nWriting as a former legislative assistant to Senator Robert F. Kennedy and an enthusiastic supporter of Hillary Clinton for president, I was disappointed to see in Politico the screed written by my former colleague, Adam Walinsky, excoriating Clinton’s record on foreign policy and national security and going on to conclude that Donald Trump should therefore be elected president. It is one thing to disagree with Secretary Clinton, which Walinsky does heatedly, and quite another to turn to Donald Trump.\n\nWe should be clear that Walinsky’s critique is not confined to Clinton. He lays out (and massively overstates) a dark view not just of Clinton but also of President Obama and almost the entire Democratic Party. The analysis is overwrought, but even one who buys the argument defies all logic in imagining that the solution is Trump.\n\nStory Continued Below\n\nThe question is not whether there is a military-industrial complex in our country. President Eisenhower called us out on that and there is enough responsibility to go around among both parties for it. The 21st century version begins with the Iraq War, which was originated by a Republican President. I am not interested in adjudicating the issue of which party is the war party except to say that Presidents Obama, Clinton and Carter have stood for peace in important and tangible ways. The question here is whether Donald Trump can claim in any way that he is the candidate who stands for a foreign policy of restraint and the answer is that he cannot.\n\nWalinsky finds in Trump a rationality and consistency that do not exist. Any reasonable observer of the presidential campaign has seen that at one moment, Trump will represent himself as an isolationist who wants to end ties with NATO and other allies; at another, he will lash out at any perceived insult to the U.S. or to himself, and pledges that America’s pride needs to be vindicated militarily. “America First,” Trump says regularly, bringing the isolationism of Charles Lindbergh to mind—before excoriating President Obama for not using greater force in any number of venues and then insinuating that he has a secret plan to obliterate the Islamic State.\n\nTo compare John F. Kennedy and Robert F. Kennedy to Donald Trump is—well, I won’t finish the sentence. Yes, Robert Kennedy turned against the Vietnam War, but not because he felt that America should retreat from the world. He opposed the war because it was unjust and was based on a flawed notion of American interests. The result, as we know, was the death of Vietnamese and Americans and others who should not have died. JFK and RFK were internationalists. They understood that World War II left the United States with a responsibility to play an active and constructive role in the world. They understood that America must stand together and dependably with allies who also are committed to pursue a peaceful world. They understood that the use of force was sometimes necessary and that brave men and women would be put at risk. They made those difficult, often excruciating, decisions carefully and as transparently as possible, never rashly, impulsively, or vindictively.\n\nWalinsky quotes Robert Kennedy’s statement that if any member of the ExComm other than John F. Kennedy had been president during the Cuban Missile Crisis, we would have had a nuclear war. Ask yourself what a President Trump might have done in that moment. “Restraint” is not the word that comes to mind.\n\nThis is a man who said he would order the military to kill the families of Muslim terrorists and use interrogation techniques worse than waterboarding and opined that the United States should have seized Iraq’s oil resources as “spoils to the victor.”\n\nYes, we have put too much power in the hands of militarists and profit seekers in both the public and private sectors. But electing Donald Trump is not the answer; it would only compound the problem in new and dangerous ways. The answer is an active citizenry that speaks out against the inappropriate use of force and opposes interference in conflicts that involve neither American security interests nor egregious human rights violations—a topic in which Donald Trump has shown an ostentatious indifference, as his fondness for Vladimir Putin reflects.\n\nAll the evidence, provided again and again by Donald Trump’s own mouth, tells us not that he is a man of peace, but that he is a man of no principle—a man who will say, and possibly do, whatever happens to cross his mind at a given minute. He is like the weather in New England: If you don’t like it, wait a minute. We do not know what he believes because he does not know what he believes. We do not know what he knows because, from all we can see, he does not know much.\n\nEven if Walinsky’s diatribe is correct, which it most certainly is not in its breadth and depth, there is nothing in it that justifies turning to Donald Trump. Of all occasions to break ranks with the Democratic Party, this is the most inappropriate. Of all the ways to misappropriate the memory of John and Robert Kennedy, two of our greatest public servants, this is the most egregious I have ever seen.\n\nTo say that I am disappointed by what Walinsky has done is an understatement. America, in this election, faces an existential question—and history will judge us by our answer. Walinsky has chosen the wrong side of the struggle.\n\nPeter Edelman is the Carmack Waterhouse professor of law and public policy at Georgetown University Law Center.", "authors": ["Jack Shafer", "Peter Edelman", "Adam Walinsky"], "keywords": [], "meta_data": {"description": "The GOP candidate is not the man of peace my former colleague makes him out to be.", "og": {"site_name": "POLITICO Magazine", "description": "The GOP candidate is not the man of peace my former colleague makes him out to be.", "title": "Robert Kennedy Would Have Hated Donald Trump", "url": "http://politi.co/2coEDm7", "image": "http://static.politico.com/33/4c/4d6ef8344746b686254cecd304f3/160922-edelman-kennedy-ap.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/robert-f-kennedy-donald-trump-party-of-war-214274", "images": ["http://static.politico.com/33/4c/4d6ef8344746b686254cecd304f3/160922-edelman-kennedy-ap.jpg", "https://static.politico.com/dims4/default/ca05472/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F33%2F4c%2F4d6ef8344746b686254cecd304f3%2F160922-edelman-kennedy-ap.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Robert Kennedy Would Have Hated Donald Trump", "url": "http://politi.co/2cGb5l5", "summary": "", "movies": [], "publish_date": {"$date": 1474560600000}, "source": "http://politi.co"}
