{"top_img": "http://static.politico.com/fd/73/54eec88c47908855e76a38813f95/ap-16267600524055.jpg", "text": "Charlotte-Mecklenburg Police Chief Kerr Putney said earlier in the week that he did not plan to release his department’s video of the shooting, although he has allowed the victim’s family and attorneys to view it. | AP Photo Clinton demands Charlotte police video release 'without delay'\n\nHillary Clinton called on authorities in Charlotte, North Carolina, on Friday to release the police video showing shooting of Keith Scott \"without delay.\"\n\nThe former of secretary of state, who made reforming the criminal justice system an early centerpiece of her campaign, wrote that \"we must ensure justice & work to bridge divides.\" The post was signed with her initial, H, indicating that the post was written personally by Clinton.\n\nStory Continued Below\n\nCell phone video showing the shooting released Friday by NBC News and The New York Times does not conclusively show whether the victim was armed when police officers shot him.\n\nThe video, recorded by Scott’s wife Rakeyia Scott, does not show him being shot although the sound of gunshots is audible. Keith Scott is not clearly visible in the video until after he has been shot, when officers surround his body lying on the pavement.\n\nCharlotte police said Keith Scott was holding a gun when officers shot him outside of his apartment on Tuesday. In the video, released by the victim’s family, police officers are heard yelling at Keith Scott to “drop the gun” while his wife shouts “he has no weapon” and “he has no gun.”\n\nAttorneys for the family have said that Keith Scott was not holding a gun when he was shot, although police have said they recovered a firearm and photos from the scene appear to show one lying next to the victim’s body.\n\nThe video offers a different perspective from the dashboard camera and body camera footage that also captured the shooting but has not yet been released. Charlotte-Mecklenburg Police Chief Kerr Putney said Thursday that he did not plan to release his department’s video of the shooting, although he has allowed the victim’s family and attorneys to view it.\n\nKeith Scott’s shooting by police, along with that of another black man, Terence Crutcher, in Tulsa, Oklahoma, has prompted demonstrations nationwide. In Charlotte, those protests grew violent Wednesday night into Thursday morning, prompting North Carolina Gov. Pat McCrory to declare a state of emergency. With National Guard troops looking on and a midnight curfew in effect, protests Thursday night were mostly peaceful.\n\nAuthors:", "authors": ["Jack Shafer", "Cristiano Lima", "Louis Nelson"], "keywords": [], "meta_data": {"description": "The video, recorded by Scott’s wife Rakeyia Scott, does not show him being shot although the sound of gunshots is audible.", "og": {"site_name": "POLITICO", "description": "The video, recorded by Scott’s wife Rakeyia Scott, does not show him being shot although the sound of gunshots is audible.", "title": "Clinton demands Charlotte police video release 'without delay'", "url": "http://politi.co/2cN6kIx", "image": "http://static.politico.com/fd/73/54eec88c47908855e76a38813f95/ap-16267600524055.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/politico/"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/keith-scott-shooting-video-228583", "images": ["https://static.politico.com/dims4/default/cf5aef9/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Ffd%2F73%2F54eec88c47908855e76a38813f95%2Fap-16267600524055.jpg", "http://static.politico.com/fd/73/54eec88c47908855e76a38813f95/ap-16267600524055.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Clinton demands Charlotte police video release 'without delay'", "url": "http://politi.co/2d6lgRT", "summary": "", "movies": [], "publish_date": {"$date": 1474637900000}, "source": "http://politi.co"}
