{"top_img": "http://a.abcnews.com/images/Politics/RT_Trump_Town_Hall_cleveland_hb_160921_16x9_992.jpg", "text": "As Donald Trump courted African-American voters in Cleveland on Wednesday at a town hall taped by Fox News to air Thursday evening, he seemed to express support for establishing the stop and frisk policing policy on a national level.\n\nWhen asked by an audience member how he would stop violence in the black community, Trump responded, \"I would do stop and frisk. I think you have to. We did it in New York. It worked incredibly well. And you have to be proactive, and you know, you really help people sort of change their mind automatically.\"\n\nHe added, \"New York City was incredible, the way that worked, so I think that could be one step you could do.\"\n\nThe law enforcement policy — in which police officers stop and question pedestrians regardless of whether they believe a crime has been committed, then search the pedestrians if the officers suspect violations — has been extremely controversial, particularly in communities of color, and has been the subject of several legal challenges alleging racial profiling and discrimination. The policy gained prominence in the 1990s under New York City Police Commissioner Bill Bratton and Mayor Rudy Giuliani, who is now a close confidant of Trump's.\n\nTrump previously expressed his support for the policy, praising Giuliani for its success in New York. Trump has as of late also been an ardent supporter of profiling regarding immigration, believing it is a helpful tactic in stopping terrorism.\n\nHe has drawn the ire of some African-Americans not only for praising stop and frisk but also for painting a grim portrait of black life.\n\nOn Tuesday night, Trump said, \"Our African-American communities are absolutely in the worst shape that they've ever been in before, ever, ever, ever\" — seeming not to take into account slavery, institutional segregation or the often violent reactions in the civil rights movement.\n\nOn Thursday morning, however, in an interview on \"Fox & Friends,\" he sought to amend his position, saying he never meant to suggest that stop and frisk should be implemented nationally.\n\n\"Now Chicago is out of control. I was referring to Chicago with stop and frisk,\" Trump said.\n\nHis initial answer came in response to a question that did not mention Chicago, though Trump cited the city in a previous answer as a place that is \"out of control.\"\n\nOf course, as president, Trump would not be able to unilaterally implement the policy in a single city; he would have to defer to local officials and law enforcement.\n\nDuring a press conference, the members of the Congressional Black Caucus were asked about Trump's stop-and-frisk remarks. \"The notion that stop and frisk had anything to do with the improving public safety numbers in New York is ludicrous, and Donald trump needs to check his facts,\" said Rep. Hakeem Jeffries, D-New York.\n\n\"We would ask Donald Trump to bone up on his knowledge of what is constitutional and what is unconstitutional,\" said Rep. Yvette Clarke, D-New York.", "authors": ["More Candace", "Abc News"], "keywords": [], "meta_data": {"fb_title": "Trump Calls for Nationwide Stop-and-Frisk Policy, Then Rolls It Back", "description": "Trump made the comments in a Fox News town hall.", "copyright": "Copyright (c) 2017 ABC News Internet Ventures", "author": "ABC News", "og": {"site_name": "ABC News", "description": "Trump made the comments in a Fox News town hall.", "title": "Trump Calls for Nationwide Stop-and-Frisk Policy, Then Rolls It Back", "url": "http://abcnews.go.com/Politics/donald-trump-calls-nationwide-stop-frisk-policy/story?id=42261880", "image": "http://a.abcnews.com/images/Politics/RT_Trump_Town_Hall_cleveland_hb_160921_16x9_992.jpg", "type": "article"}, "twitter": {"description": "Trump made the comments in a Fox News town hall.", "title": "Trump Calls for Nationwide Stop-and-Frisk Policy, Then Rolls It Back", "url": "http://abcnews.go.com/Politics/donald-trump-calls-nationwide-stop-frisk-policy/story?id=42261880", "image": "http://a.abcnews.com/images/Politics/RT_Trump_Town_Hall_cleveland_hb_160921_16x9_992.jpg", "creator": "@CandaceSmith_", "site": "@ABC", "app": {"url": {"ipad": "abcnewsipad://link/story,42261880", "iphone": "abcnewsiphone://link/story,42261880", "googleplay": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/donald-trump-calls-nationwide-stop-frisk-policy/story?id=42261880"}, "name": {"ipad": "ABC News", "iphone": "ABC News", "googleplay": "ABC News"}, "id": {"ipad": 306934135, "iphone": 300255638, "googleplay": "com.abc.abcnews"}}, "card": "summary_large_image"}, "robots": "index, follow", "DC.date.issued": "2016-09-22", "al": {"ipad": {"url": "abcnewsipad://link/story,42261880", "app_store_id": 380520716, "app_name": "ABC News for iPad"}, "web": {"url": "http://abcnews.go.com/Politics/donald-trump-calls-nationwide-stop-frisk-policy/story?id=42261880"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/donald-trump-calls-nationwide-stop-frisk-policy/story?id=42261880", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "iphone": {"url": "abcnewsiphone://link/story,42261880", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}}, "Date": "2016-09-22", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "Last-Modified": "2016-09-22 15:31:44", "keywords": "trump, donald trump, fox news, sean hannity, town hall, stop and frisk, politics news, election news, political news, political news articles", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "news_keywords": "trump, donald trump, fox news, sean hannity, town hall, stop and frisk"}, "canonical_link": "http://abcnews.go.com/Politics/donald-trump-calls-nationwide-stop-frisk-policy/story?id=42261880", "images": ["http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "http://a.abcnews.com/images/Politics/RT_Trump_Town_Hall_cleveland_hb_160921_16x9_992.jpg", "http://a.abcnews.com/images/Politics/RT_Trump_Town_Hall_cleveland_hb_160921_12x5_992.jpg"], "title": "Donald Trump Calls for Nationwide Stop-and-Frisk Policy, Then Rolls It Back", "url": "http://abcn.ws/2ddGVux", "summary": "", "movies": [], "publish_date": null, "source": "http://abcn.ws"}
