{"top_img": "http://static.politico.com/0e/b6/f32701ea430d8f0e71ea1eb2390f/160920-early-voting-ap-16159732553066.jpg", "text": "In total, 37 states and the District of Columbia will allow early voting in 2016. | AP Photo When does early voting start in every state? Voting has already started in a scattering of locations, and entire states will be able to vote starting Friday.\n\nElection Day is more than a month away, but voters are already casting ballots to pick their next president.\n\nVoting opened on Monday in Wisconsin Rapids, Wisconsin, making the town's voters among the first in the nation to do so. So far, voting is limited to a smattering of counties and municipalities in states that allow local governments to set their own schedules. On Friday, however, voters statewide in South Dakota and Minnesota will be allowed to cast early ballots. And other states are joining soon: New Jersey starts early voting on Saturday, and Vermont plans to start early voting as soon as the ballots are ready. (State rules say no later than Saturday.)\n\nStory Continued Below\n\nIn total, 37 states and the District of Columbia will allow early voting in 2016. Some of those states allow voters to request mail ballots and send them in, while others open physical polling places weeks or even months before the election. In the 2012 presidential election, approximately 30 percent of the votes cast came via mail or early balloting, meaning many voters will weigh in before the candidates have had a chance to make their closing case.\n\nTypically, Democrats lead in early voting, especially in-person early voting, because their voters are not as likely to go out to the polls as Republicans, said Michael McDonald, an election expert and associate professor at the University of Florida. The GOP, however, tends to make up ground through mail in absentee ballots, McDonald said.\n\nHere’s when early voting begins in each state.\n\n(Note, the below dates represent the earliest date that voters statewide can send for a ballot or vote in person without a special exemption.)\n\nAlabama — There’s no universal early voting in Alabama, as voters need a state-approved excuse to vote absentee.\n\nAlaska — Oct. 24.\n\nArizona — Oct. 12. Local counties are still finalizing the locations where voters can vote in-person, but ballots for mail-in voting begin going out on the 12th.\n\nArkansas — Oct. 24.\n\nCalifornia — Early voting opening dates are set by the county/municipality. Oct. 10 is the first day to vote early in Los Angeles County.\n\nColorado — Oct. 24.\n\nConnecticut — There is no early voting in Connecticut, as voters need a state-approved excuse to vote absentee.\n\nDistrict of Columbia — Oct. 22 at One Judiciary Square, Oct. 29 for all other locations .\n\nDelaware — There is no early voting in Delaware, as voters need a state-approved excuse to vote absentee.\n\nFlorida — All counties are required to allow voting from Oct. 29 to Nov. 5. Some have the option to start earlier.\n\nGeorgia — Oct. 17. Voters can sign up for an absentee ballot starting Sept. 20.\n\nHawaii — Oct. 25.\n\nIdaho — Sept. 23. Counties must send out absentee ballot requests no later than the 23rd, but are allowed to offer early voting. Early voting opening dates are set by the county/municipality.\n\nIllinois — Sept. 29 to Nov. 7. Starting Sept. 29, voters can only cast their ballots at their local election authority or a temporary location, but early voting expands to permanent polling places starting Oct. 24.\n\nIndiana — Oct. 12. Early voting starts at the local county election board office or another designated location, but with an excuse, voters can cast a ballot by mail.\n\nIowa — Sept. 29.\n\nKansas — Oct. 19. Counties are allowed to set earlier extended early voting dates.\n\nKentucky — There is no early voting in Kentucky, unless voters have a state-approved excuse to vote absentee.\n\nLouisiana — Oct. 25 to Nov. 1.\n\nMaine — Oct. 9 is the general opening date, but the state allows you to vote as soon as the ballots are printed, and some people have already cast their ballots.\n\nMaryland — Oct. 27 to Nov. 3.\n\nMassachusetts — Oct. 24 to Nov. 4.\n\nMichigan — There is no early voting in Michigan, as voters require a state-approved excuse to vote absentee.\n\nMinnesota — Sept. 23.\n\nMississippi — There is no early voting in Mississippi, as voters need a state-approved excuse to vote absentee.\n\nMissouri — There is no early voting in Missouri, as voters need a state-approved excuse to vote absentee.\n\nMontana — In-person early voting begins as soon as ballots are ready, which is expected to be around Oct. 11.\n\nNebraska — Oct. 3. The counties mail out requests starting on the 3rd, but the first day to vote early in-person is Oct. 7.\n\nNevada — Oct. 22.\n\nNew Hampshire — There is no early voting in New Hampshire, unless voters have a state-approved excuse to vote absentee.\n\nNew Jersey — Sept. 24. In-person early voting may begin sooner (it starts as soon as ballots are available), but mail-in ballots are sent out beginning on the 24th.\n\nNew Mexico — Oct. 11 to Nov. 5. Voters can apply for an absentee ballot on Oct. 11, but starting on the 22nd they can vote early in person.\n\nNew York — There is no early voting in New York, as voters require a state-approved excuse to vote absentee.\n\nNorth Carolina — Sept. 9, Oct. 20 to Nov. 5. Absentee ballots have already been sent out, but the formal early voting period does not start until October.\n\nNorth Dakota — Sept. 29. Absentee and mail ballots can be sent out by county officials starting on the 29th, but the exact date might vary from one location to the next.\n\nOhio — Oct. 12.\n\nOklahoma — Nov. 3 to Nov. 5.\n\nOregon — Oct. 19.\n\nPennsylvania — There is no early voting in Pennsylvania, as voters need a state-approved excuse to vote absentee.\n\nRhode Island — There is no early voting in Rhode Island, unless voters have a state-approved excuse to vote absentee.\n\nSouth Carolina — There is no early voting in South Carolina, unless voters have a state-approved excuse to vote absentee. The state does, however, give voters more absentee leeway than many.\n\nSouth Dakota — Sept. 23.\n\nTennessee — Oct. 19 to Nov. 3.\n\nTexas — Oct. 24 to Nov. 4.\n\nUtah — Oct. 25 to Nov. 4.\n\nVirginia — There is no early voting in Virginia, unless voters have a state-approved excuse to vote absentee.\n\nVermont — Sept. 23 to Nov. 7. Early voting could start before the 23rd, but it will not begin any later than that date .\n\nWashington — Oct. 21. Some voters may receive their ballot earlier, but this is the latest counties can mail them out.\n\nWest Virginia — Oct. 26 to Nov. 5.\n\nWisconsin — Early voting opening dates are set by the county/municipality. Wisconsin Rapids began voting Sept. 19.\n\nWyoming — Sept. 23 to Nov. 7.\n\nAuthors:", "authors": ["Jack Shafer", "Kyle Cheney", "Alex Isenstadt", "Gabriel Debenedetti", "Brent Griffiths", "Katie Glueck", "Shane Goldmacher"], "keywords": [], "meta_data": {"description": "Voting has already started in a scattering of locations, and entire states will be able to vote starting Friday.", "og": {"site_name": "POLITICO", "description": "Voting has already started in a scattering of locations, and entire states will be able to vote starting Friday.", "title": "When does early voting start in every state?", "url": "http://politi.co/2cPHVB9", "image": "http://static.politico.com/0e/b6/f32701ea430d8f0e71ea1eb2390f/160920-early-voting-ap-16159732553066.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/early-voting-states-228435", "images": ["https://static.politico.com/dims4/default/5a487e2/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F0e%2Fb6%2Ff32701ea430d8f0e71ea1eb2390f%2F160920-early-voting-ap-16159732553066.jpg", "http://static.politico.com/0e/b6/f32701ea430d8f0e71ea1eb2390f/160920-early-voting-ap-16159732553066.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "When does early voting start in every state?", "url": "http://politi.co/2d3R8Jw", "summary": "", "movies": [], "publish_date": {"$date": 1474435110000}, "source": "http://politi.co"}
