{"top_img": "http://a.abcnews.com/images/International/ABC_marinelli_jef_160927_16x9_992.jpg", "text": "Nate Smith, executive director of the Texas Nationalist Movement, looked uncertain as a man identifying himself as an east Ukrainian resistance fighter pledged solidarity to Smith’s struggle for an independent Texas. Standing in a conference room in the Ritz Hotel in central Moscow on Sunday, Smith nodded noncommittally and handed over his business card.\n\nIt wasn’t the only incongruous encounter taking place at the Ritz at what has been dubbed Moscow’s international conference of separatists, an eclectic Kremlin-funded gathering of organizations and sometimes wacky individuals pressing for self-rule for often unlikely territories.\n\nAmidst the heavy glitz of the hotel, Catalonian separatists and dissident Irish republicans listened politely to presentations from east Ukrainian rebels, Azerbaijani minorities and the thoughts of the self-proclaimed \"King of Hawaii,\" who called in via video link.\n\nAnd among the few dozen activists comparing ideas for how to achieve self-determination, were two Americans campaigning for Texan and Californian secession from the United States.\n\nThe conference, now in its second year, is funded largely by the Kremlin and organized by the Anti-Globalization Movement of Russia, a group that closely follows government positions. The movement says it is unconnected to the Kremlin, but the hotel conference was almost entirely paid for by a charitable fund founded by President Vladimir Putin, which provided close to $546,000 for the project, according to public records. The attendees, including the Texan delegate, had been offered free flights and accommodation.\n\nThe conference’s organizers present it as a platform for marginalized groups, but its agenda overlaps with Kremlin efforts to promote Russia as an alternative guardian for global order, at the head of democratic movement opposed to alleged American imperialism.\n\n“Our main goal is to create a multi-polar world,” the conference’s creator, Aleksander V. Ionov, told its participants. “Our president, Vladimir Vladimirovich Putin, is probably the main anti-globalist in the world.”\n\nIonov himself, a relatively little-known businessman, has repeatedly met Syrian President Bashar al-Assad, whom Russia is backing militarily, saying the two discussed humanitarian aid and media activities two weeks ago.\n\nIonov’s conference plays into Moscow’s own long-time policy of backing separatists in its former Soviet neighbors. While jailing and harassing separatist groups at home, Moscow has leveraged them abroad a pretext for military intervention, most recently fomenting the violent secessionist conflict in eastern Ukraine. A sizable presence of pro-Russian rebel supporters was visible on Sunday, while not a single Russian separatist group took part.\n\nAll that and the anti-American flavor sometimes made uncomfortable listening for the groups less used to the atmosphere in the Kremlin’s orbit.\n\n“It’s kind of awkward I guess,” Smith said after one 30-minute denunciation of American inequity.\n\nABC News\n\nSmith’s group, the Texas Nationalist Movement, is campaigning for a referendum on whether Texas should exit the United States. Founded over 10 years ago, the group attracted some attention recently when it came within two votes of forcing the Texas state GOP to bring a debate on a secession referendum to the floor of the Republican convention. Smith said he was grateful for the chance to promote his campaign and was eager to clarify his attendance did not mean he was aligning with the Kremlin.\n\n“We’re here to have a dialogue. We’re not in agreement with all the groups that are here,” Smith said. “We’re here for very specific reasons. We came here to make a statement on behalf of the people of Texas.”\n\nIt was a sentiment echoed by Louis J. Marinelli from the YES California Independence Campaign, there to get his message out about his plan to make the Golden State a nation.\n\n“We want to draw attention to our campaign,” Marinelli said. “We’re not signing an alliance with Russia or anything like that.\"\n\nThe two secessionists’ urge for independence stems largely from a distaste with American foreign policy and a sense the U.S. has become dysfunctional. A gentle-mannered IT consultant married to a Russian, Marinelli is aiming for a secession referendum by 2019.\n\n“The U.S. government is so dysfunctional it can’t be repaired from within anymore, and if we were a separate nation running our own affairs, we could improve the quality of life for Californians,” Marinelli said.\n\nBoth men were hoping for a Donald Trump victory in the U.S. presidential elections, banking on a surge in people looking to detach themselves from America. The U.K.'s recent \"Brexit\" vote to leave the European Union had also heartened many attendees.\n\nBut why exactly the Kremlin had decided to pay to gather them in Moscow, few among the foreign attendees could say. Nor did they appear particularly interested.\n\n“I’m not here to make presumptions about potential reasons for this conference,” Smith said.\n\nHowever, the conference -- and its location in one of Moscow’s expensive hotels, within shouting distance of the Kremlin walls -- slots into a recognizable recent Russian strategy. Russia has been backing far right political parties in the West, in particular, reportedly funding France’s anti-European Union party, the Front National, with a $10 million loan. The practice echoes that of the Soviet Union, which secretly supported radical fringe groups around the world, but now coupled with elaborate disinformation campaigns from state media outlets.\n\n“It’s a school-book case,” said Peter Kreko, a Fulbright visiting professor at Indiana University who has studied Russia’s use of the far right. “The simple reason is that Russia is interested in dividing the Western world. The strategy is not to create new divisions but to take the most from divisions already there.”\n\nKreko said the idea was to back groups hindering European integration and to undermine faith in Western-style liberal democracy.\n\n“The tool-kit is pretty much the same as in the Soviet Union. Any kind of movements that can cause chaos,” Kreko said, adding he thought the conference was also a prop for domestic propaganda that state media would use to paint Russia as a champion of democracy.\n\nFew of the conference attendees were concerned they might become Kremlin pawns, seeing it simply as a way to get their message out.\n\n“Everybody’s using everybody,” Marinelli said. “We’re using this conference for our own purposes. We want the attention so that we can get the word out, they want ...\" he trailed off before finishing. “Everybody’s got their own agenda, right? So, that’s just the way it is.”\n\nFor most of the attendees the main pull appeared to be the guaranteed presence of the media, attracted by the conference’s oddity.\n\n“I’ve talked to seven media [organizations] today. I've got to get my story out,” said Diarmuid Mac Dubhglais, international secretary for Republican Sinn Féin, a tiny Irish republican splinter group that supports the violent removal of British control over Northern Ireland.\n\nIn any case, Mac Dubhglais said, he wouldn’t let “Vladimir himself” impose ideas on him.\n\n“I’m not going to start passing out propaganda when I go home and start marching Soviet-style,\" he said.\n\nBesides, he said, perhaps the Russian motive was altruistic. “Maybe in fairness, they might think the cause is just,” he said then paused, before adding: “I’m hoping that’s what they think.\"", "authors": ["Abc News"], "keywords": [], "meta_data": {"fb_title": "Texas, California Separatists Attend Kremlin-Funded Conference", "description": "Meet the attendees of Moscow's international conference of separatists.", "copyright": "Copyright (c) 2017 ABC News Internet Ventures", "author": "ABC News", "og": {"site_name": "ABC News", "description": "Meet the attendees of Moscow's international conference of separatists.", "title": "Texas, California Separatists Attend Kremlin-Funded Conference", "url": "http://abcnews.go.com/International/texas-california-separatists-attend-pro-kremlin-conference/story?id=42395066", "image": "http://a.abcnews.com/images/International/ABC_marinelli_jef_160927_16x9_992.jpg", "type": "article"}, "twitter": {"description": "Meet the attendees of Moscow's international conference of separatists.", "title": "Texas, California Separatists Attend Kremlin-Funded Conference", "url": "http://abcnews.go.com/International/texas-california-separatists-attend-pro-kremlin-conference/story?id=42395066", "image": "http://a.abcnews.com/images/International/ABC_marinelli_jef_160927_16x9_992.jpg", "site": "@ABC", "app": {"url": {"ipad": "abcnewsipad://link/story,42395066", "iphone": "abcnewsiphone://link/story,42395066", "googleplay": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/International/texas-california-separatists-attend-pro-kremlin-conference/story?id=42395066"}, "name": {"ipad": "ABC News", "iphone": "ABC News", "googleplay": "ABC News"}, "id": {"ipad": 306934135, "iphone": 300255638, "googleplay": "com.abc.abcnews"}}, "card": "summary_large_image"}, "robots": "index, follow", "DC.date.issued": "2016-09-27", "al": {"ipad": {"url": "abcnewsipad://link/story,42395066", "app_store_id": 380520716, "app_name": "ABC News for iPad"}, "web": {"url": "http://abcnews.go.com/International/texas-california-separatists-attend-pro-kremlin-conference/story?id=42395066"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/International/texas-california-separatists-attend-pro-kremlin-conference/story?id=42395066", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "iphone": {"url": "abcnewsiphone://link/story,42395066", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}}, "Date": "2016-09-27", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "Last-Modified": "2016-09-27 17:34:13", "keywords": "Moscow, separatist, Russia, Moscow, Texas, California, conference, Ukraine, international news, world news, foreign news", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "news_keywords": "Moscow, separatist, Russia, Moscow, Texas, California, conference, Ukraine"}, "canonical_link": "http://abcnews.go.com/International/texas-california-separatists-attend-pro-kremlin-conference/story?id=42395066", "images": ["http://a.abcnews.com/images/International/ABC_marinelli_jef_160927_12x5_992.jpg", "http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "http://a.abcnews.com/images/International/ABC_donetsk_peoples_republic_jef_160927_4x3_992.jpg", "http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "http://a.abcnews.com/images/International/ABC_marinelli_jef_160927_16x9_992.jpg"], "title": "Texas, California Separatists Attend Kremlin-Funded Conference", "url": "http://abcn.ws/2d7uFbf", "summary": "", "movies": [], "publish_date": null, "source": "http://abcn.ws"}
