{"top_img": "http://occupydemocrats.com/wp-content/uploads/trump-cuban.png", "text": "72k SHARES SHARE THIS STORY\n\nThe first debate showdown of Republican nominee Donald Trump and Democratic nominee Hillary Clinton was expected to be a brutal altercation between the two candidates.\n\nInstead, the viewing audience was treated to a one-sided destruction with Clinton appearing cool and presidential, while Trump gave the worst debate performance in presidential history. Each candidate had the ability to invite guests for moral support, and Clinton invited billionaire Mark Cuban who has been one of the loudest voices against Trump in the media.\n\nThere is no love lost between the two businessmen, and Cuban even said of Trump there was “no bigger jagoff in the world.”\n\nThe indebted businessman happily admitted on stage in front of Cuban to being in debt at least $600 million. The shameless Trump, who became more unhinged as the night progressed, freely gave away one of his biggest secrets — that he does not and has not paid any federal taxes in years.\n\nClinton speculated about this, and like a predictable rube under the hot lights Trump cracked under the pressure. Rather than offer an explanation or deflection to Clinton’s hypothesis Trump agreed he paid no taxes and said, “That makes me smart.” Trump’s cheap explanation sounded like something a third grader on the playground would offer rather than a presidential candidate.\n\nAn hour after the debate Trump immediately began walking back his statement, and denied he had ever said it. This type of shamelessness is difficult to combat. When asked , “It sounds like you admitted you haven’t paid federal taxes and that was smart. Is that what you meant to say?” Trump replied, “No, I didn’t say that at all.”\n\nTrump insulted every American who pays their fair share of taxes and Cuban was not amused nor impressed. After the debate Cuban said:\n\nI get audited every year my taxes are — it takes me 45 minutes just to sign all the different taxes that I have to spend. And I tell my tax lawyers and everybody, you know, take advantage of — do what the law recommends. But I’m not against paying taxes. And I’ll give you a perfect example. When the Dallas Mavericks were building a new practice facility which was just opening I had the opportunity to go to Dallas and and play different cities against each other to get different rebates and everything. I didn’t do it. A couple years ago we had some issues in Dallas, I just wrote a check to the general treasury. This year we had, after the shootings in Orlando, I had concerns about the LGBT community in Dallas. I just wrote a million dollar check to the city of Dallas to support a bunch of different programs. I’m, I’m the luckiest guy in the world. There’s nobody who’s been as blessed as me and my family, so far, knock on wood, is healthy, and at some point you have to realize you have to give back. And you have to realize that this is a country that’s been great to us. And you can’t just take, take, take, take, take, take.\n\n.@mcuban on Trump saying not paying taxes makes him smart #debatenight pic.twitter.com/uPNunatukV — Stefan Becket (@becket) September 27, 2016\n\nThe contrast between Cuban and Trump could not be more stark. Cuban believes in paying his fair share to society to help those who are less fortunate than him, while admitting he owes his success to society. Trump is content and even proud that he bleeds society for as much money as possible, while offering to pay back nothing. Did Trump say he was interested in paying higher taxes? No. Did Trump say he would like to reform the tax code so that he would be forced to pay higher taxes? No.\n\nTrump has no interest in paying his taxes to help fund schools so that children will grow to be more intelligent, because if they did they would certainly not support him. Trump has no interest in paying taxes to help pay for the roads which are used to deliver the cheaply made Chinese goods to which his name is affixed. In Trump’s world there is a two-tiered system. One for him, and one for everyone else.\n\nAdd your name to millions demanding that Congress take action on the President’s crimes. IMPEACH DONALD TRUMP!", "authors": ["Lou Colagiovanni", "Grant Stern", "Brett Bose", "Natalie Dickinson"], "keywords": [], "meta_data": {"generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "og": {"site_name": "Occupy Democrats", "description": "One of these men is an honest businessman.", "title": "Trump Said Not Paying Taxes Makes Him \"Smart.\" Mark Cuban's Response Is Powerful", "locale": "en_US", "image": {"width": 600, "identifier": "http://occupydemocrats.com/wp-content/uploads/trump-cuban.png", "height": 400}, "updated_time": "2016-09-28T02:05:27-04:00", "url": "http://occupydemocrats.com/2016/09/28/trump-said-not-paying-taxes-makes-smart-mark-cubans-response-powerful/", "type": "article"}, "twitter": {"image": "http://occupydemocrats.com/wp-content/uploads/trump-cuban.png", "description": "One of these men is an honest businessman.", "card": "summary", "title": "Trump Said Not Paying Taxes Makes Him \"Smart.\" Mark Cuban's Response Is Powerful"}, "fb": {"admins": "100010978633754 , 66801782", "app_id": 187891551586426}, "msapplication-TileImage": "http://occupydemocrats.com/wp-content/uploads/odfavicon-2.gif", "article": {"section": "Politics", "tag": "Trump", "published_time": "2016-09-28T00:37:34-04:00", "modified_time": "2016-09-28T02:05:27-04:00", "author": "https://www.facebook.com/lou.colagiovanni.5"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1"}, "canonical_link": "http://occupydemocrats.com/2016/09/28/trump-said-not-paying-taxes-makes-smart-mark-cubans-response-powerful/", "images": ["http://occupydemocrats.com/wp-content/uploads/od-political-WEBSITE-SIDEBAR-SMALL.png", "http://occupydemocrats.com/wp-content/uploads/Bye-Bye-Trump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/cher-1-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/jklol-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/trumprally-1-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/occupydemocrats-logo2x.png", "http://0.gravatar.com/avatar/984ebae9f3cd67d33e8b273d994dbd4c?s=164&d=mm&r=g", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2016-10-22-at-4.07.01-PM.png", "http://occupydemocrats.com/wp-content/uploads/Bakker-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/trumppence-3-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/donald-trump-with-felix-sater-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/sallyyates-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/DrunkTrump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2017-08-29-at-5.35.14-PM-340x150.png", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2017-08-29-at-6.51.03-PM-340x150.png", "http://occupydemocrats.com/wp-content/uploads/trump-cuban.png"], "title": "Trump Said Not Paying Taxes Makes Him \"Smart.\" Mark Cuban's Response Is Powerful", "url": "http://occupydemocrats.com/2016/09/28/trump-said-not-paying-taxes-makes-smart-mark-cubans-response-powerful/", "summary": "", "movies": [], "publish_date": {"$date": 1475020800000}, "source": "http://occupydemocrats.com"}
