{"top_img": "http://static.politico.com/7e/a8/1194bbca4e39bd2edb3bed41956c/162009-donald-trump-getty-1160.jpg", "text": "Talks of hiring Rex Elsass come as Donald Trump is getting walloped on the airwaves. | Getty Trump team talking to veteran GOP ad man Elsass\n\nDonald Trump’s campaign, hoping to counter Hillary Clinton’s air assault, is in talks with veteran GOP ad maker Rex Elsass, according to three sources familiar with the discussions.\n\nElsass, according to one of the sources, met with Trump officials in New York City last week.\n\nStory Continued Below\n\nElsass has deep connections to the Trump campaign. He previously served as a top strategist to vice presidential nominee Mike Pence, and in 2012 he worked with Trump campaign manager Kellyanne Conway for Missouri Senate candidate Todd Akin, who came under widespread criticism after making controversial remarks about rape. Elsass is a partner at Strategy Group for Media, a firm that has also counted Jim Murphy, Trump’s national political director, as an employee.\n\nTrump’s advertising campaign has been led by Jamestown, a prominent political consulting firm with an anti-establishment edge. Two Jamestown employees, Jason Miller and Larry Weitzner, have taken senior roles in the campaign. Also helping to lead the Trump ad effort is Rick Reed, a veteran GOP strategist who assisted the Swift Boat Veterans for Truth campaign against John Kerry in 2004.\n\nDiscussions about bringing aboard Elsass come as Trump is getting walloped on the airwaves. On Sept. 12, Smart Media Group, a media buying firm that works with the Republican National Committee, detailed in an email to Trump campaign officials how Clinton was outspending the Republican nominee on TV by an astonishing seven-to-one margin. With polling in many battlegrounds suggesting the race is tight, many Republican strategists are concerned that Trump’s lack of commercial spending could pose problems as the contest enters its final seven weeks.\n\nThe Ohio-based GOP operative has a long history in Republican politics, having worked for a number of presidential candidates over the years. During this year’s primary season, Elsass advised Rand Paul and, following Paul’s departure from the race, John Kasich. In 2012, he worked for Michele Bachmann and Newt Gingrich.\n\nNeither Elsass nor a Trump spokesperson responded to requests for comment.\n\nAuthors:", "authors": ["Jack Shafer", "Alex Isenstadt"], "keywords": [], "meta_data": {"description": "He previously served as a top strategist to vice presidential nominee Mike Pence.", "og": {"site_name": "POLITICO", "description": "He previously served as a top strategist to vice presidential nominee Mike Pence.", "title": "Trump team talking to veteran GOP ad man Elsass", "url": "http://politi.co/2d8TxD9", "image": "http://static.politico.com/7e/a8/1194bbca4e39bd2edb3bed41956c/162009-donald-trump-getty-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/trump-ads-rex-elsass-228423", "images": ["http://static.politico.com/7e/a8/1194bbca4e39bd2edb3bed41956c/162009-donald-trump-getty-1160.jpg", "https://static.politico.com/dims4/default/0e4441b/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F7e%2Fa8%2F1194bbca4e39bd2edb3bed41956c%2F162009-donald-trump-getty-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Trump team talking to veteran GOP ad man Elsass", "url": "http://politi.co/2d2BkGM", "summary": "", "movies": [], "publish_date": {"$date": 1474384396000}, "source": "http://politi.co"}
