{"top_img": "http://s13.postimg.org/4hyknud13/article8.png", "text": "An Ohio judge ordered an attorney jailed for five days after she refused to remove a Black Lives Matter pin she wore to court. The lawyer is appealing the case.\n\nAttorney Andrea Burton of Youngstown, Ohio, was charged with contempt of court and given a five-day jail sentence on July 22 after she refused to take off the pin at Judge Robert Milich's request, the New York Daily News reported.\n\nThe judge reportedly called Burton, who was representing a client at the time, into his chambers and spoke privately to her about the matter. When the lawyer continued to wear the pin, he adjourned the proceedings and ordered her to be held on a contempt charge.\n\nMilich told WKBN he made his ruling based on Supreme Court precedent that allows judges to prohibit political expression in courtrooms.\n\nPopular Video This young teenage singer was shocked when Keith Urban invited her on stage at his concert. A few moments later, he made her wildest dreams come true.\n\n“There’s a difference between a flag, a pin from your church or the Eagles and having a pin that’s on a political issue,” Milich said.\n\nThe judge claimed his decision was not influenced by his own personal views.\n\n\"A judge doesn't support either side,\" he told WKBN. \"A judge is objective and tries to make sure everyone has an opportunity to have a fair hearing, and it was a situation where it was just in violation of the law.\"\n\nBurton has been released pending an appeal on the condition that she refrain from wearing any items that make a political statement in court. If she loses the appeal, she will have to serve five days in jail.\n\nPopular Video This young teenage singer was shocked when Keith Urban invited her on stage at his concert. A few moments later, he made her wildest dreams come true:\n\nThe attorney told New York Daily News that her constitutional right to free speech superseded Supreme Court case law and the judge's discretion.\n\n“It's an act of civil disobedience, I understand that,\" Burton told NY Daily News. \"I’m not anti-police, I work with law enforcement and I hold them in the highest regard, and just to say for the record I do believe all lives matter. But at this point they don’t all matter equally, and that’s the problem in the justice system.\"\n\nMike Brickner, the senior policy director of the American Civil Liberties Union of Ohio, said that judges are generally given a wide latitude in what they allow or don't allow in the courtroom, although their decisions must be reasonable and fairly applied.\n\n\"There have been cases in the past when people have been given contempt of court for refusing to comply with a judge's order to remove an article of clothing that may have a message on it,\" Brickner wrote in a July 22 email to WKBN. \"Many times this has been done to retain the defendant’s right to a fair trial.\"", "authors": [], "keywords": [], "meta_data": {"msapplication-TileColor": "#0e0e0e", "description": "An Ohio judge ordered...", "title": "Judge Takes One Look At Attorney's Pin, Sentences Her To Five Days In Prison (Photo)", "modernizr-version": "2.8.3", "foundation-version": "5.4.7", "jquery-version": "2.1.1", "og": {"site_name": "Opposing Views", "description": "An Ohio judge ordered...", "title": "Judge Takes One Look At Attorney's Pin, Sentences Her To Five Days In Prison (Photo)", "url": "http://www.opposingviews.com/i/society/judge-took-one-look-what-lawyer-had-pinned-her-shirt-and-told-her-without-hesitation-youre", "image": "http://s13.postimg.org/4hyknud13/article8.png", "type": "article"}, "DC.date.issued": "2016-07-25T11:57:01+00:00", "theme-version": "1.2.4", "publish_date": "2016-07-25T11:57:01+00:00", "msapplication-TileImage": "/sites/all/themes/ov_2017/img/favicons/ms-icon-144x144.png", "theme-color": "#0e0e0e", "keywords": "Andrea Burton,Youngstown,Ohio,Contempt of Court,Black Lives Matter pin", "ov": {"id": 879139}, "viewport": "width=device-width, maximum-scale = 1.0", "news_keywords": "Andrea Burton,Youngstown,Ohio,Contempt of Court,Black Lives Matter pin"}, "canonical_link": "http://www.opposingviews.com/i/society/judge-took-one-look-what-lawyer-had-pinned-her-shirt-and-told-her-without-hesitation-youre", "images": ["http://www.opposingviews.com/sites/all/themes/ov_2017/img/OpposingViews.png", "http://pixel.quantserve.com/pixel/p-15e4OSeaAUAF6.gif", "https://www.facebook.com/tr?id=1522439921378351&ev=PageView&noscript=1", "http://s13.postimg.org/4hyknud13/article8.png", "http://b.scorecardresearch.com/p?c1=2&c2=8097945&cv=2.0&cj=1", "http://www.opposingviews.com/sites/all/themes/ov_2017/img/render-logo.png", "https://www.facebook.com/tr?id=745291502309008&ev=PageView&noscript=1", "http://img.opposingviews.com/sites/default/files/styles/782x440/public/admin/OVDefault.jpg?itok=k4bdyP05"], "title": "Lawyer Jailed For Wearing Black Lives Matter Pin In Court", "url": "http://www.opposingviews.com/i/society/judge-took-one-look-what-lawyer-had-pinned-her-shirt-and-told-her-without-hesitation-youre?fb=rwn", "summary": "", "movies": [], "publish_date": null, "source": "http://www.opposingviews.com"}
