{"top_img": "http://static.politico.com/4f/d1/2a153a1445ca8f52a3ea80a5d94c/08-donald-trump-45-gty-1160.jpg", "text": "Donald Trump mocked Hillary Clinton's planes and needled her for \"taking the day off.\" | Getty Trump needles Clinton: ‘Sleep well Hillary — see you at the debate!’\n\nHillary Clinton is a copycat who’s probably sleeping because she needs to rest, Donald Trump suggested Tuesday.\n\nIn a pair of tweets bookended by a post announcing “two big rallies” in North Carolina, Trump accused the Democratic presidential nominee of “copying my airplane” and continued his assault over her stamina, or alleged lack thereof.\n\nStory Continued Below\n\n“Do people notice Hillary is copying my airplane rallies — she puts the plane behind her like I have been doing from the beginning,” Trump mused in a tweet Tuesday morning.\n\n“Hillary Clinton is taking the day off again, she needs the rest,” he added minutes later. “Sleep well Hillary — see you at the debate!”\n\nTrump’s critical comments come shortly after Clinton warned voters during a radio interview with Steve Harvey, “The next 50 days will determine the next 50 years.”\n\nClinton also previewed what she expects from Trump in Monday's presidential debate in New York, telling Harvey she will do her “very best to communicate as clearly and fearlessly as I can in the face of the insults and the attacks and the bullying and bigotry that we’ve seen coming from my opponent.”\n\n“You know, I can take it, Steve. I can take that kind of stuff,” she added. “I’ve been at this and, you know, I understand it’s a contact sport.”\n\nTrump also attacked Clinton earlier Tuesday, questioning her effectiveness against the Islamic State as head of the State Department.\n\n“Crooked Hillary has been fighting ISIS, or whatever she has been doing, for years,” he said. “Now she has new ideas. It is time for change.”\n\nClinton has no public events planned for Tuesday and has opted to stay at home in Chappaqua, New York, as she prepares for the debate with Trump.\n\nShe had a full campaign schedule on Monday — between holding a news conference in White Plains, New York, a campaign speech and a fundraiser in Philadelphia, and three meetings with foreign leaders in New York City. She is scheduled to return to Florida for a campaign rally and fundraiser on Wednesday.\n\nGabriel Debenedetti contributed to this report.\n\nAuthors:", "authors": ["Jack Shafer", "Nolan D"], "keywords": [], "meta_data": {"description": "“Hillary Clinton is taking the day off again, she needs the rest,” he added minutes later. “Sleep well Hillary - see you at the debate!”", "og": {"site_name": "POLITICO", "description": "“Hillary Clinton is taking the day off again, she needs the rest,” he added minutes later. “Sleep well Hillary - see you at the debate!”", "title": "Trump needles Clinton: ‘Sleep well Hillary — see you at the debate!’", "url": "http://politi.co/2d8huL2", "image": "http://static.politico.com/4f/d1/2a153a1445ca8f52a3ea80a5d94c/08-donald-trump-45-gty-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/NolanDMcCaskill"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/trump-clinton-debate-sleep-228407", "images": ["https://static.politico.com/dims4/default/d5525fc/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F4f%2Fd1%2F2a153a1445ca8f52a3ea80a5d94c%2F08-donald-trump-45-gty-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "http://static.politico.com/4f/d1/2a153a1445ca8f52a3ea80a5d94c/08-donald-trump-45-gty-1160.jpg"], "title": "Trump needles Clinton: ‘Sleep well Hillary — see you at the debate!’", "url": "http://politi.co/2cGp6EH", "summary": "", "movies": [], "publish_date": {"$date": 1474368432000}, "source": "http://politi.co"}
