{"top_img": "http://static.politico.com/c6/cd/2a88f055435fa17a7cfc846fcc62/christie-camden-residents.png", "text": "Gov. Chris Christie greets residents at a gathering in Camden, N.J. | AP Photo/Mel Evans Christie among the most unpopular governors in the country, poll finds\n\nGov. Chris Christie has the third-worst approval ratings of any governor in the country, according to a poll released Tuesday.\n\nAccording to Morning Consult, New Jersey voters give Christie a 29 percent approval rating and 68 percent disapproval rating. That's down from a 36 percent approval rating in the spring, and not far behind the two worst ranked governors.\n\nStory Continued Below\n\nRepublican Sam Brownback of Kansas fares the worst, with a 23 percent approval rating and 71 percent disapproval rating. Democrat Dan Malloy of Connecticut has a 26 percent approval rating and a 70 percent disapproval rating.\n\nThe numbers in the Morning Consult poll are actually slightly better for Christie than a Rutgers-Eagleton poll released Monday, which showed 26 percent of voters approving of his job performance and 69 percent disapproving, while just 23 percent said they had a favorable opinion of the governor.\n\nBoth surveys were conducted before the Bridgegate trial got underway on Monday — a spectacle that has already proven embarrassing for Christie amid the prosecution's claims that he knew of the George Washington Bridge access lane closings as they happened.\n\nThere is a potential consolation for Christie in the Morning Consult poll. Two Republicans he helped elect in blue states against long odds as chairman of the Republican Governors Association are among the most popular in the country. Massachusetts Gov. Charlie Baker and Maryland Gov. Larry Hogan both have 70 percent approval ratings and disapproval ratings of 18 percent and 17 percent, respectively. Only Republican South Dakota Gov. Dennis Daugaard is more popular, with a 74 percent approval rating.\n\nThe margin of error for the New Jersey poll results is plus or minus 2 percentage points.\n\n\n\nAuthors:", "authors": ["Matt Friedman"], "keywords": [], "meta_data": {"description": "<p>Gov. Chris Christie has the third worst approval ratings of any governor in the country, according to a poll released Tuesday.</p>", "og": {"site_name": "Politico PRO", "description": "<p>Gov. Chris Christie has the third worst approval ratings of any governor in the country, according to a poll released Tuesday.</p>", "title": "Christie among the most unpopular governors in the country, poll finds", "url": "http://politi.co/2d8ikY2", "image": "http://static.politico.com/c6/cd/2a88f055435fa17a7cfc846fcc62/christie-camden-residents.png", "type": "article"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/states/new-jersey/story/2016/09/christie-is-the-third-most-unpopular-governor-in-the-country-poll-finds-105623", "images": ["https://static.politico.com/dims4/default/d09c92c/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fc6%2Fcd%2F2a88f055435fa17a7cfc846fcc62%2Fchristie-camden-residents.png", "http://static.politico.com/c6/cd/2a88f055435fa17a7cfc846fcc62/christie-camden-residents.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Christie among the most unpopular governors in the country, poll finds", "url": "http://politi.co/2cZxICx", "summary": "", "movies": [], "publish_date": {"$date": 1474369091000}, "source": "http://politi.co"}
