{"top_img": "http://i2.cdn.turner.com/money/dam/assets/160927085616-trump-clinton-debate-interjection-00002018-780x439.jpg", "text": "Monday night was the most-watched debate in American history.\n\nWell over 80 million people tuned in to see Hillary Clinton and Donald Trump face off, setting a new record in the sixty year history of televised presidential debates.\n\nAccording to Nielsen, the debate averaged a total of 84 million viewers across 13 of the TV channels that carried it live.\n\nMany millions also watched the debate via live streams on the web.\n\nNielsen's 84 million total counts people who watched via traditional TV channels at home. People who watched the debate at parties, bars, restaurants, and offices were not counted. Neither were C-SPAN viewers.\n\nThis means the actual total audience is even higher.\n\nOn the TV side, CNN and other cable news channels saw big increases over past election years. So did the broadcast networks.\n\nNBC had the biggest audience overall, partly because \"NBC Nightly News\" anchor Lester Holt was the moderator of the debate. Upwards of 18 million people watched the debate on NBC.\n\nABC drew 13.5 million viewers, CBS drew 12.1 million, Fox News drew 11.4 million, CNN drew 9.9 million, the Fox broadcast network drew 5.5 million, and MSNBC drew 4.9 million.\n\nThe debate was also a hit on Spanish language television, attracting 2.5 million viewers on Univision and 1.8 million on Telemundo.\n\nTrump may have been the ratings magnet, but Clinton may have been the beneficiary of the ratings bump. By Tuesday there was a media consensus that Clinton had prevailed in the debate.\n\nThe debate viewership number to beat was 80.6 million, set back in 1980, when Jimmy Carter and Ronald Reagan debated just once before the election.\n\nMore recently, the first Obama-Romney debate in 2012 averaged 67 million viewers.\n\nDetailed Nielsen data confirms that viewership stayed high the entire time. Contrary to some speculation, there was not a big drop-off after the first 30 minutes of the 98-minute debate.\n\nThe vast majority of viewers kept watching until the very end, a fact that the Clinton campaign celebrated on Tuesday.\n\nEarlier story: Ratings expectations for first Trump-Clinton debate are sky high\n\nAnticipation for the Clinton-Trump meeting had been mounting for months. Television industry executives were anticipating a total audience somewhere between 80 and 100 million.\n\nThere will be two more debates between the candidates in October.\n\nOn Monday night Twitter said the first face-off was the \"most tweeted debate ever.\"\n\nGiven the rapid growth of streaming options, it was almost certainly the most streamed debate ever, as well.\n\nVarious live streams on YouTube together registered more than 2.5 million simultaneous viewers. Live streams on other sites also reached millions of people.\n\nOn both Twitter and Facebook, Trump was a livelier subject than Clinton. Twitter said the \"final share of conversation around the candidates on stage\" was 62% for Trump and 38% for Clinton.\n\nOn Facebook, the results were even more lopsided, with Trump earning 79% share of conversation and Clinton having the remaining 21%.\n\nBeing talked about isn't necessarily a good thing for a candidate. Most commentators gave Clinton the edge over Trump after the debate.\n\nStill, the post-debate coverage on TV focused on Trump, partly because of surprising and confounding comments he made on stage.\n\nCNN's reality check team investigated 26 claims made by Clinton and Trump and found that Trump made a greater number of misleading statements.", "authors": ["Brian Stelter"], "keywords": [], "meta_data": {"news_keywords": "Donald Trump, Hillary Clinton, presidential debate, debate, first presidential debate, first debate", "title": "Debate breaks record as most-watched in U.S. history", "og": {"site_name": "CNNMoney", "description": "The first presidential debate between Donald Trump and Hillary Clinton was far higher rated than the first debates in 2008 and 2012, preliminary data shows.", "title": "Debate breaks record as most-watched in U.S. history", "url": "http://money.cnn.com/2016/09/27/media/debate-ratings-record-viewership/index.html", "image": "http://i2.cdn.turner.com/money/dam/assets/160927085616-trump-clinton-debate-interjection-00002018-780x439.jpg", "type": "article"}, "section": "media", "author": "Brian Stelter", "vr": {"category": "media", "type": "Article"}, "DC.date.issued": "2016-09-27T10:26:50", "keywords": "Donald Trump, Hillary Clinton, presidential debate, debate, first presidential debate, first debate", "fb": {"app_id": 521848191196480}, "date": "2016-09-27 10:26:50", "twitter": {"description": "The first presidential debate between Donald Trump and Hillary Clinton was far higher rated than the first debates in 2008 and 2012, preliminary data shows.", "title": "Debate breaks record as most-watched in U.S. history", "url": "http://money.cnn.com/2016/09/27/media/debate-ratings-record-viewership/index.html", "image": "http://i2.cdn.turner.com/money/dam/assets/160927085616-trump-clinton-debate-interjection-00002018-540x304.jpg", "site": "@CNNMoney", "card": "summary_large_image"}, "viewport": "width=1140", "description": "The first presidential debate between Donald Trump and Hillary Clinton was far higher rated than the first debates in 2008 and 2012, preliminary data shows."}, "canonical_link": "http://money.cnn.com/2016/09/27/media/debate-ratings-record-viewership/index.html", "images": ["http://i2.cdn.turner.com/money/dam/assets/150529102155-anheuser-busch-drinking-water-124x70.jpg", "http://i.cdn.turner.com/money/.element/img/8.0/authors/byline-icon/brian-stelter.png", "http://i2.cdn.turner.com/money/.element/img/9.0/sections/media/cnnmedia_color.svg", "http://i2.cdn.turner.com/money/dam/assets/170828124254-hurricane-harvey-damage-124x70.jpg", "http://i.cdn.turner.com/money/images/1.gif", "http://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif", "https://www.facebook.com/tr?id=731697573629176&ev=PageView&noscript=1", "http://i.cdn.turner.com/money/.element/img/8.0/logos/cnn-logo.png", "http://i2.cdn.turner.com/money/dam/assets/160927020119-clinton-trump-debate-00001528-1024x576.jpg", "http://i2.cdn.turner.com/money/dam/assets/170828120549-whole-foods-price-drop-bananas-124x70.jpg", "http://i.cdn.turner.com/money/.element/img/8.0/sections/media/reliable-sources-cnnmoney.png", "http://i.cdn.turner.com/money/.element/img/8.0/logos/money-logo.png", "http://i.cdn.turner.com/money/video/bvp/images/1.gif", "http://i2.cdn.turner.com/money/dam/assets/160927085616-trump-clinton-debate-interjection-00002018-780x439.jpg"], "title": "Debate breaks record as most-watched in U.S. history", "url": "http://cnn.it/2dwwCh9", "summary": "", "movies": [], "publish_date": null, "source": "http://cnn.it"}
