{"top_img": "http://static.politico.com/31/ac/8f4776244f9a99c4c687af350af9/west-virginia-jim-justice-gubernatorial-2016.jpg", "text": "A billionaire who built up a corporate empire from his father’s inheritance now is running his first major political campaign with a promise to shake up the establishment and restore prosperity after a long period of stagnation. But in this case it’s not Donald Trump. It’s Jim Justice, the Democratic candidate for governor in West Virginia and a coal baron to boot.\n\nLike Trump, Justice has been accused of not paying his bills and being out mainly for himself. And like Trump, Justice is running a nontraditional campaign that exists well outside the partisan pattern, eschewing Hillary Clinton and Barack Obama in favor of a cult of personality based around his exploits in business. As West Virginia’s only billionaire, he can self-fund, pumping $2.2 million into his campaign through mid-June. Justice faces stiff crosswinds, however, running as a down-ballot Democrat in one of Trump’s strongest states.\n\nStory Continued Below\n\nWest Virginia polling is scarce and often inaccurate, but a MetroNews West Virginia poll released earlier this month showed Trump with a 49–31 advantage over Hillary Clinton, who won only 36 percent to Bernie Sanders’ 51 percent in the state’s May 10 primary. In an era of declining split-ticket voting, Justice must outperform Clinton by double digits to win.\n\nThat’s led to a dynamic in which West Virginia’s GOP candidate for governor, state Senate President Bill Cole, is embracing Trump while Justice is distancing himself from Clinton. It’s very nearly the opposite of what’s happening in other states with close races.\n\n“Across the nation, Democrats are trying to nationalize their races because they think they can use Trump as a weapon. In this race, it’s pretty clear Democrats are trying to localize, because Trump is not a drag but an asset for Cole,” says Kyle Kondik, managing editor of Larry Sabato’s Crystal Ball at the University of Virginia’s Center for Politics. “This is one of the few places in the country where Republicans are more concerned with nationalizing a race than Democrats are.”\n\nIn this race, Trump isn’t a drag on Republicans; he’s an asset.\n\nThe reason is simple: coal. Republicans have dominated Appalachia the past three cycles by bludgeoning Democrats with “war on coal” rhetoric blaming Obama for the industry's decline. It’s hard to make that charge stick against a coal baron. And Justice definitely qualifies: He inherited an array of coal interests from his father, then enlarged them to become one of the biggest private coal mine owners in the East. That growth included the 2009 sale of his Bluestone Coal Corp. to Russia’s OAO Mechel for $568 million. Then the coal slump hit, and last year Justice bought Bluestone back for $5 million, less than 1 percent of his selling price.\n\nCole, the Republican candidate, has more elective experience than Justice, but he’s no establishment insider. Owner of Bill Cole Automall and other businesses, Cole is finishing only his first term in the West Virginia Senate, having previously served a few months in the House of Delegates when he was appointed to fill a vacant seat. However, Cole spent much of 2016 wrapped up in a state budget crisis and has focused his general election campaign on tried-and-true conservative policy proposals such as cutting spending and taxes, banning late-term abortions and opening charter schools.\n\nIn a year in which voters largely have embraced personality over policy, that may not be enough, even in a Republican-tilting state with a wildly popular candidate at the top of the ticket.\n\n“If you think about the primary races here, we saw a giant Trump win and a giant Sanders win,” says Scott Crichlow, associate professor of political science at West Virginia University. “If you look at Trump, look at Sanders, look at Justice, they certainly have policies that are known—the wall, universal health care, the coal industry—but so much of what’s driving the appeal for them is personality and image, not just a list of policy prescriptions.”\n\nJustice is running as a conservative Democrat, not unlike former governor and current U.S. Sen. Joe Manchin, with whom he shares a number of campaign staff. He’s flip-flopped between the two major parties, giving money to both and changing his registration, most recently in February 2015, when he became a Democrat. However, he says he won’t vote for Clinton and dismissed Cole’s claim that he supports Obama as “complete dog snot.”\n\nAnd while Justice spokesman Grant Herring says his candidate “isn’t focused on the national political circus,” the language he uses to describe his appeal sounds awfully familiar. “Jim is no politician,” says Herring. “He is the outsider in this race who has the skills and experience to transform the state.”\n\nAt the moment, it looks like that approach is working: A MetroNews West Virginia poll released September 3 showed Justice running away with the race at 46 percent, Cole with 32 percent, Mountain Party candidate Charlotte Pritt with 8 percent, and Libertarian David Moran with 5 percent.\n\nMany doubt the veracity of the MetroNews poll, which has varied wildly when measured against election results in recent years, but most, including Cole spokesman Kent Gates, agree that Justice is winning. “Do I think Justice has a lead? Yes,” says Gates. “Do I think it’s double digits? No.”\n\nSome of that is because Justice’s industry ties largely make him resistant to the GOP’s otherwise effective “war on coal” messaging, which has proven to be Democrat kryptonite around Appalachia, even in districts beyond the coalfields.\n\n“If you’re going to win in West Virginia, you better be running against Hillary Clinton,” says Dave “Mudcat” Saunders, a western Virginia political consultant known for his so-called Bubba Strategy, designed to help Democrats appeal to white working-class voters. Saunders, who has said he’s voting for Trump, says voters don’t trust Clinton or care about her support for funding going to help coalfield economies transition to something else. “She said she’s going to put coal out of business. West Virginia coal miners don’t want a handout. They want their dignity. They want their jobs.”\n\nIf you’re going to win in West Virginia, you better be running against Hillary Clinton,” says one Democratic strategist.\n\nBut Saunders doesn’t have kind words for Justice either: “He’s screwed every coal operator in West Virginia at one time or another.”\n\nCole sees that reputation as his big opening. His spokesman, Gates, says the Republican campaign will open up attacks on Justice’s business record over the next several weeks. “Jim Justice is a coal operator, but he’s not a coal operator acting in the best interest of West Virginia,” Gates says. “His legacy of unpaid bills is documented across the land.”\n\nThat record extends from unpaid federal fines to unpaid vendors to unpaid state and local taxes in multiple states. In a 2014 series on delinquent mines, NPR reported that Justice “stands out” among mining operators, owing nearly $2 million in unpaid fines at the time. That same year, a federal agency issued 39 cessation orders against three Justice companies for reclamation violations at Tennessee mines, including hiring a contractor who planted trees upside down.\n\nThe problems have persisted. This year in Kentucky, Justice’s mines missed reclamation deadlines and owed nearly $2 million in delinquent property taxes. That’s an improvement from last year, when he owed $3.5 million in unpaid Kentucky taxes. In southwest Virginia, Tazewell County officials seized machinery, tools and other equipment from a Justice-owned mine this spring to make up for $850,000 in unpaid property taxes. When 2015 West Virginia property taxes became delinquent in April, Justice owed more than $3.9 million.\n\nThe pattern apparently extends to Justice’s other businesses, as well: Two companies sued the Greenbrier for unpaid work on its golf courses for the PGA tournament, eventually settling out of court.\n\nJustice’s mining record, which includes extensive use of mountaintop removal mining, as well as his issues with mine reclamation, has made him the target of many an Appalachian environmental activist. The Cole campaign going negative on Justice might not push those green voters to vote Republican, but it might tip them toward Pritt, who is running for governor as the candidate of the Mountain Party, the West Virginia affiliate of the Green Party. Pritt served eight years in the state Legislature and is making her third run for governor. The last time she ran, in 1996, she defeated Manchin in a primary on the way to a loss in the general election.\n\nBoth Cole and Justice have promised to bring back coal jobs, but whoever wins in November faces the monumental task of a state economy that’s suffered mightily with the collapse of the coal industry.\n\nAccording to the U.S. Census, West Virginia’s 2014 median household income was $41,576, compared with $53,657 nationally. Its poverty rate was 18.3 percent, versus 14.8 nationally. Mining jobs have plummeted, falling 19 percent in the past calendar year, 26 percent from a decade ago, and 39 percent from 2011, when the market for metallurgical, or steel-making, coal spiked on the strength of a then-strong Asian economy.\n\nMines sit idle as a string of industry giants— Alpha Natural Resources, Arch Coal, Patriot Coal, Peabody Energy and Walter Energy—filed for bankruptcy due to a convergence of factors including a slumping Asian economy, competition from cheap natural gas, and federal clean-air regulations that resulted in a wave of older power plants closing or converting to natural gas. While the market for metallurgical, or steel-making coal may eventually return, it’s unlikely the same will be true for steam, or power-producing, coal.\n\nThe coal industry’s struggles haven’t just hurt West Virginia’s employment rate, but also its state budget. The reduction in coal and natural gas severance tax collection contributed to its budget crisis, along with an economy that generally has failed to transition from its fossil fuel roots. In this gubernatorial campaign, neither candidate seems eager to push that process forward.\n\nJustice, however, has experience operating in economic sectors such as farming and tourism that may be part of the recipe for recovery. He previously owned Wintergreen Resort in Virginia before selling it last year, and in 2009 he bought the famed Greenbrier Resort out of bankruptcy. Since then, he’s brought an annual PGA tournament and the New Orleans Saints’ training camp to the Greenbrier.\n\nIn late June, a month and a half after Justice won the Democratic nomination and two weeks before the Greenbrier Classic PGA tournament was scheduled to start, tragedy inadvertently threw a spotlight on the Greenbrier and the communities around it when West Virginia was slammed by historic rains and flooding that qualified as a 1,000-year event in parts of the state. Twenty-three people were killed, including 15 in Greenbrier County, and hundreds of homes were destroyed.\n\nJustice canceled the PGA event and closed the Greenbrier Resort, though it opened its doors, free of charge, to house about 200 people who had been displaced from their homes. He shut down his campaign for roughly 10 days following the flooding, appearing only at a brief press conference to announce the Greenbrier’s reopening date. Should he win in November, however, his response to the flooding and actions at the Greenbrier will be remembered as a defining moment.\n\nWhether Justice will win, however, remains an open question, double-digit poll lead notwithstanding. Sabato’s Crystal Ball recently moved the West Virginia governor’s race from “Leans Republican” to “Toss-up.” “We’re being cautious because of the fact that Justice will need to run so far ahead of Clinton,” Kondik says.\n\nTrump will easily win West Virginia, but the winner of the governor’s race will be determined by how willing voters are to split their tickets, and whether Democrats remain loyal to their party or break for Pritt. That’s why Cole’s campaign is attacking Justice on his record as a coal businessman, even as they decry the federal “war on coal.” Whether those voters go to Cole or to Pritt ultimately doesn’t matter, so long as they’re not voting for Justice.\n\nIn his attacks on Justice, Cole spokesman Gates repeated one line a couple of times: “At the end of the day, Jim Justice is going to do what’s best for Jim Justice.”\n\nThat line has been used about Donald Trump, too. The question for West Virginia voters on Election Day will be whether what’s in Justice and Trump’s best interests is in theirs, too.\n\nMason Adams writes from southwest Virginia. He's on Twitter at @MasonAtoms.", "authors": ["Jack Shafer", "Mason Adams"], "keywords": [], "meta_data": {"description": "How a billionaire Democrat could win in one of Donald Trump’s strongest states.", "og": {"site_name": "POLITICO Magazine", "description": "How a billionaire Democrat could win in one of Donald Trump’s strongest states.", "title": "Is West Virginia Holding America’s Weirdest Election?", "url": "http://politi.co/2d2tVHA", "image": "http://static.politico.com/31/ac/8f4776244f9a99c4c687af350af9/west-virginia-jim-justice-gubernatorial-2016.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/west-virginia-2016-governor-coal-cole-justice-214268", "images": ["https://static.politico.com/dims4/default/edd4a3b/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F31%2Fac%2F8f4776244f9a99c4c687af350af9%2Fwest-virginia-jim-justice-gubernatorial-2016.jpg", "http://static.politico.com/31/ac/8f4776244f9a99c4c687af350af9/west-virginia-jim-justice-gubernatorial-2016.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Is West Virginia Holding America’s Weirdest Election?", "url": "http://politi.co/2d2EDuM", "summary": "", "movies": [], "publish_date": {"$date": 1474454580000}, "source": "http://politi.co"}
