{"top_img": "http://occupydemocrats.com/wp-content/uploads/sikhguy-1.jpg", "text": "55.6k SHARES SHARE THIS STORY\n\nOnce again, Donald Trump and the Republican Party’s fear-mongering about immigrants is proven false. Ever since an improvised explosive device injured 29 in Chelsea, New York City, Trump and his goons have revived one of their favorite talking points – vilifying Syrian refugees. “These attacks and many others were made possible because of our extremely open immigration system, which fails to properly vet and screen the individuals or families coming into our country” yelled Trump at one of his notorious hate-rallies on September 19th.\n\nHe later went on FOX News and in one broad stroke, painted all immigrants with outrageous hyperbole: “Think of it, Hillary Clinton wants to allow hundreds of thousands of these same people that are, you know, they have such hatred and sickness in their heart. It’s sickness, and it’s hatred, and she wants to allow hundreds of thousands more to come in.”\n\nIn fact, Mr. Trump, the truth is the bombing was committed by a naturalized American citizen – and authorities caught the suspect thanks to a Sikh immigrant, Harinder Bains. He is the owner of the bar in whose doorway Ahmad Rahami decided to take a nap in. When Bains saw the man’s face on CNN, he did what any responsible citizen would do.\n\nHe called the cops.\n\n“I did what I think every American would have done. My neighbor would have done the same thing. Any Jewish, Christian, Sikh, Muslim. Anybody would have done the same thing…I’m from Sikh faith. I’ve been taught always stand up against the atrocities, any kind of persecution” said Bains to CNN’s Chris Cuomo.\n\nHe’s absolutely right – because our nation is a nation of immigrants. All of our forefathers are immigrants who colonized this land and committed genocide against the native peoples. Nobody has any more or less of a right to be here than everyone else, and picking on Syrian refugees because they’re Muslims fleeing chlorine gas and barrel bombs is the lowest of the low. Our nation has accepted ten thousand refugees from Syria, a paltry number of the 4.6 milion Syrians that have been displaced by the horrifying violence of the Syrian Civil War. None of them have been connected to any domestic terrorist attacks in the United States.\n\nThe chance of being killed by a refugee in a terrorist attack is 1 in 3.6 billion; you are at much more danger from your own countrymen and their firearms. Mr. Bains’ actions reaffirm the notion that unity and welcome are our greatest assets. When immigrants feel accepted by a community, it becomes their community and they will work just as hard to defend it as anyone would.\n\nFor instance, the Orlando shooter was reported to the FBI by an immigrant at his local mosque after he discovered evidence of Mateen’s radicalization; racist Trump supporters repaid him by burning his house of worship to the ground. Mr. Trump and his campaign’s racist rhetoric only serves to drive us apart and puts us in more danger. He is the real threat to America – not refugee or immigrants.\n\nAdd your name to millions demanding that Congress take action on the President’s crimes. IMPEACH DONALD TRUMP!", "authors": ["Colin Taylor", "Grant Stern", "Brett Bose", "Natalie Dickinson"], "keywords": [], "meta_data": {"generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "og": {"site_name": "Occupy Democrats", "description": "“I did what I think every American would have done.\"", "title": "Trump Silent As Police Credit A Sikh Immigrant With Capturing NYC Bomber", "locale": "en_US", "image": {"width": 520, "identifier": "http://occupydemocrats.com/wp-content/uploads/sikhguy-1.jpg", "height": 271}, "updated_time": "2016-09-20T21:39:32-04:00", "url": "http://occupydemocrats.com/2016/09/20/trump-silent-police-credit-sikh-immigrant-capturing-nyc-bomber/", "type": "article"}, "twitter": {"image": "http://occupydemocrats.com/wp-content/uploads/sikhguy-1.jpg", "creator": "@ColsBols", "description": "“I did what I think every American would have done.\"", "card": "summary", "title": "Trump Silent As Police Credit A Sikh Immigrant With Capturing NYC Bomber"}, "fb": {"admins": "100010978633754 , 66801782", "app_id": 187891551586426}, "msapplication-TileImage": "http://occupydemocrats.com/wp-content/uploads/odfavicon-2.gif", "article": {"section": "Politics", "tag": "Trump", "published_time": "2016-09-20T21:34:28-04:00", "modified_time": "2016-09-20T21:39:32-04:00", "author": "https://www.facebook.com/ColsBols"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1"}, "canonical_link": "http://occupydemocrats.com/2016/09/20/trump-silent-police-credit-sikh-immigrant-capturing-nyc-bomber/", "images": ["http://occupydemocrats.com/wp-content/uploads/sikhguy-1.jpg", "http://occupydemocrats.com/wp-content/uploads/od-political-WEBSITE-SIDEBAR-SMALL.png", "http://occupydemocrats.com/wp-content/uploads/Bye-Bye-Trump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/nytimes-2-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/cher-1-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/Trump-Niinisto-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/occupydemocrats-logo2x.png", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2016-10-22-at-4.07.01-PM.png", "http://occupydemocrats.com/wp-content/uploads/Bakker-340x150.jpg", "http://0.gravatar.com/avatar/94cbb3560cca3d2e5338216af4b13172?s=164&d=mm&r=g", "http://occupydemocrats.com/wp-content/uploads/trumppence-3-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/donald-trump-with-felix-sater-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/sallyyates-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/DrunkTrump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2017-08-29-at-3.42.57-PM-340x150.png", "http://occupydemocrats.com/wp-content/uploads/DonnieJunior-340x150.jpg"], "title": "Trump Silent As Police Credit A Sikh Immigrant With Capturing NYC Bomber", "url": "http://occupydemocrats.com/2016/09/20/trump-silent-police-credit-sikh-immigrant-capturing-nyc-bomber/", "summary": "", "movies": [], "publish_date": {"$date": 1474329600000}, "source": "http://occupydemocrats.com"}
