{"top_img": "http://v.politico.com/images/1155968404/201609/1981/1155968404_5137187348001_5137175069001-vs.jpg?pubId=1155968404", "text": "Trump hints Obama to blame for Charlotte unrest But he also presented himself as someone who could heal America's racial divide.\n\nDonald Trump on Thursday pinned the blame for the turmoil in Charlotte, North Carolina, on President Barack Obama, suggesting that the violent protests there show a “wounded country” that “looks bad to the world.”\n\nPausing for roughly 10 minutes during an energy speech in Pittsburgh to address the Charlotte unrest, Trump also presented himself as the man to heal America’s racial divide.\n\nStory Continued Below\n\n“Before going any further today, I want to address the turmoil unfolding right now in our country, and it seems to be a never-ending problem,” Trump said. “America desperately needs unity, and it needs the spirit of togetherness that has not really only got us through our toughest times, and we’ve had some tough times, but which has lifted us up in the past to our greatest achievements as a nation.”\n\nHe called for a swift end to violence against citizens and law enforcement, insisting that such actions hurt law-abiding African-American families most, and proposed a national anti-crime agenda to address what he characterized as a “national crisis.”\n\nHe also vowed to make American cities safer by appointing “the best prosecutors, investigators and federal law enforcement officers” and sympathized with police officers, who carry an “immense responsibility” but must be trained properly, respect the public and be held accountable for any wrongdoing. And he took a shot at Obama’s leadership, or lack thereof.\n\n“We all have to walk a mile in someone else’s shoes, see things through their eyes and then get to work fixing our very wounded country. I mean, it’s — we have some real problems, and we do have a wounded country,” Trump said. “Many Americans are watching the unrest in Charlotte unfolding right before their eyes on the TV screens. Others are witnessing the chaos and the violence firsthand. Our country looks bad to the world, especially when we are supposed to be the world’s leader. How can we lead when we can’t even control our own cities?”\n\nTrump, who emphasized that it will be the 45th president’s responsibility “to address this crisis and save African-American lives,” has made an attempt to gain support from African-Americans in recent weeks, albeit through a narrative of poorly educated, impoverished black people who live in crime-ridden inner cities and who, after years of Democratic policies he says has failed them, have nothing to lose by supporting his campaign.\n\nTrump's overtures to black voters — often made in front of overwhelmingly white audiences — have done little to dent Hillary Clinton's 80-point advantage among African- Americans. And his sometimes ham-fisted appeals have come along with statements that have done himself further damage: Only hours earlier, he recommended a controversial stop-and-frisk policy, a policing tactic that has been found to disproportionately targets minorities, to curb violence in Chicago, Obama's hometown, and made the unsubstantiated claim that “drugs are a very, very big factor” in what's happening in Charlotte.\n\nStill, Trump has tried to cast himself as a unifying figure. Earlier Thursday, during a phone interview with “Fox and Friends,” the Republican presidential nominee said there “just seems that there’s a lack of spirit between the white and the black.”\n\n“I mean, it’s a terrible thing that we’re witnessing,” he continued. “You’re seeing it. I'm seeing it, and you look at what went on last night in Charlotte — a great place — and you just see it.”\n\nProtests over the killing of Keith Lamont Scott, a black man who was fatally shot by police on Tuesday, turned violent on Wednesday night, leading North Carolina Gov. Pat McCrory to declare a state of emergency in Charlotte.\n\nBy Thursday, Charlotte officials and Scott's family were arguing over whether he had been carrying a gun when he was shot.\n\nCharlotte-Mecklenburg Police Chief Kerr Putney told reporters that police believe Scott was armed, though he acknowledged that a video of his encounter does not prove that conclusively. Putney said the video would be shown to Scott's family but did not commit to releasing it to the public.\n\nAt a press conference Thursday afternoon, attorneys for Scott’s family refused to commit to calling for the video to be made public or to addressing the media after viewing it. Charles Monnett, one of the family’s lawyers, said the family's decision would depend on whether the video \"can somehow help us reach that truth.\"\n\nJustin Bamberg, another of the family’s attorney’s, said he had not seen any evidence that a gun was present at the scene where Scott was shot. Bamberg dismissed photos showing a gun at the scene by remarking that “pictures pop up online all the time. They come from different sources.” He said that as far as he was aware, Scott did not own a gun. Bamberg also confirmed that Scott’s wife was present when he was shot.\n\n“At the end of the day, my priority is the greater good of this family first. That has to be understood,” Bamberg said when asked why the family’s legal team would not commit to calling for the video to be made public. “Yes, we want transparency. We don't create the facts. We live with the facts. But you can't take the burden that is placed on law enforcement as sworn officers and public servants and put that on a deceased person for their family who is in mourning.”\n\nThe Obama administration, meanwhile, urged calm -- but the president himself had not made a statement as of 5:00 p.m. ET on Thursday.\n\nAttorney General Loretta Lynch addressed the “difficulties” her home state faces but warned against any violent reactions. “I know that these are difficult times, and I know that the events of recent days are painfully unclear and they call out for answers,” she said. “But I also know that the answer will not be found in the violence of recent days. Let us seek all peaceful way forward.”\n\nWhite House press secretary Josh Earnest said that the vast majority of people had demonstrated peacefully.\n\n“Unfortunately, we've seen situations in which a small number of people take advantage of that peaceful public protest to engage in criminal activity and, in some cases, violence,” he said. “We've often heard from the families of those who were killed urging people with concerns to express those concerns peacefully and to not perpetuate the cycle of violence. Those have often been quite powerful calls and those are calls that the president has strongly supported.”\n\nWednesday's violence erupted as residents, outraged over Scott's death and that of an unarmed black man in Tulsa, Oklahoma, last week, looted and vandalized cars and businesses in downtown Charlotte. According to reports, police in riot gear used tear gas to try to calm protesters, several of whom were injured, including one who was shot by another protester, police said.\n\n“I see it even going out. There’s such a lack of — there’s a lack of spirit,” Trump said. “There’s a lack of something. Something’s going on that’s bad, and what’s going on between police and others is getting worse.”\n\nThe real estate mogul renewed his call for law and order, pitching it as the solution to the unrest in Charlotte and outrage nationwide over police-involved shootings of black men, who in many cases have been unarmed when they were fatally shot.\n\n“Well, it’s wow, here we go again,” Trump said. “It’s very sad. When you look at what’s going on, it’s very sad. It’s very divided, our country, and it’s getting worse. I’m not overly surprised to see it, but it’s happening.”\n\nTrump argued that a dialogue between police and the communities they serve won’t solve this problem, pointing to the ambush in Dallas this summer, when a black man killed five officers and injured a dozen more.\n\n“If you look at Dallas, there was a dialogue. They prided themselves on dialogue,” Trump said. “And they were constantly talking and meeting and having community groups and, you know, that was — that was a pretty rough situation, to put it mildly. A terrible, terrible situation. That sounds good. It sounds right, but there’s something deeper than that.”\n\nWhat’s necessary, Trump maintained, is a combination of law and order and leadership that can unify a divided nation, leadership he intimated is lacking from America’s current leader.\n\n“Well, it really has to be — you have to have law and order at the time, you have to have, you know, you have to have a certain spirit, a certain unity, and there’s no unity,” Trump said. “You look at the level of hatred, the, you know, the rocks being thrown and everything happening. It’s so sad to see. You know, this is the United States of America. I mean, it’s so sad to see. But there’s just no unity. There has to be a unity message that has to get out, and it starts with leadership.”\n\nBut what Trump didn’t say explicitly, his surrogates did. Former House Speaker Newt Gingrich and former New York Mayor Rudy Giuliani appeared in separate Fox News segments in which they both slammed Obama’s lack of leadership.\n\n“First of all, it’s a tragedy that eight years after our first African-American president took office, eight years after we’ve had two African-American attorney generals, the gap and the hostility, if anything, is worse, and I think that’s a tragic failure of leadership,” Gingrich said.\n\n“But my guess is he was afraid it’d make him a black president in a narrowing sense,” he added. “He could have launched a program to try to rebuild and reopen and re-engineer hope in these communities. And instead, he became the person who talked about, you know, the Cambridge policeman was wrong, and, you know, Ferguson was wrong and why Florida was wrong.”\n\nGiuliani said Obama should have lectured Americans on constitutional law Wednesday. Referring to last Friday’s shooting death of Terence Crutcher, who was unarmed with his hands raised when he was fatally shot by a white police officer, the former New York mayor acknowledged that that incident was “a more difficult situation” than what transpired in Charlotte that belongs in the “ambiguous, troubling category.”\n\n“But even there, you gotta say to people, ‘Wait, let the investigation play out.’ The president of the United States should have said that yesterday,” Giuliani said. “The president of the United States should have given people a teeny bit of a lecture on constitutional law, that we presume people innocent, and that same presumption exists for police officers as everyone else.”\n\nAuthors:", "authors": ["Jack Shafer", "Nolan D", "Heather Caygle", "Rachael Bade", "Eli Stokols", "Louis Nelson", "Josh Gerstein"], "keywords": [], "meta_data": {"description": "&quot;It’s a terrible thing that we’re witnessing,” Trump says.", "og": {"site_name": "POLITICO", "description": "&quot;It’s a terrible thing that we’re witnessing,” Trump says.", "title": "Trump hints Obama to blame for Charlotte unrest", "url": "http://politi.co/2d6AMQy", "image": "http://v.politico.com/images/1155968404/201609/1981/1155968404_5137187348001_5137175069001-vs.jpg?pubId=1155968404", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/politico/"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/trump-on-charlotte-protests-228512", "images": ["http://v.politico.com/images/1155968404/201609/1981/1155968404_5137187348001_5137175069001-vs.jpg?pubId=1155968404", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Trump hints Obama to blame for Charlotte unrest", "url": "http://politi.co/2cJlAWU", "summary": "", "movies": [], "publish_date": {"$date": 1474532948000}, "source": "http://politi.co"}
