{"top_img": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160910204806-north-korea-nuclear-test-explainer-ripley-orig-00020128-super-tease.jpg", "text": "(CNN) North Korea went on the offensive Friday, blasting the US for \"aggression\" in Asia, blaming Washington for its pursuit of nuclear weapons and threatening the US with \"tremendous consequences beyond imagination.\"\n\nThe Democratic People's Republic of Korea \"had no other choice but to go nuclear,\" Foreign Minister Ri Yong Ho told the UN General Assembly, to defend itself \"from the constant nuclear threats from the United States.\"\n\nRi's comments came as the US and Asian nations gathered in New York Friday with a fresh reminder of what they consider the gravest threat facing the region: North Korea's announcement this week that it had successfully tested its most powerful rocket engine yet.\n\nThe test Tuesday was followed by a US show of force, as the Pentagon on Wednesday flew two B-1B bombers alongside the demilitarized zone separating North and South Korea, setting the the stage for US-South Korea joint military exercises in October that will include a simulated nuclear facility strike.\n\nThe heightened tensions, North Korea's steady drumbeat of tests and its nuclear ambitions have put the region on edge and the Pentagon on notice.\n\n\"North Korea's unpredictable behavior and capability development also continues to threaten allies and potentially the homeland,\" Gen. Joseph Dunford, chairman of the Joint Chiefs of Staff, said Wednesday in Maryland. \"It's consumed an awful lot of time -- I think it's fair to say -- of senior leadership's time over the past few weeks.\"\n\nThe North Korean minister offered a through-the-looking glass version of the same events. \"Only a couple of days ago, the United States has again threatened the DPRK by flying the strategic bombers 'B-1B' over the military demarcation line on the Korean peninsula and landing in South Korea,\" Ri said. \"We will never remain onlookers at it and the United States will have to face tremendous consequences beyond imagination.\"\n\nMeanwhile, Secretary of State John Kerry met Friday on the sidelines of the UN General Assembly with foreign ministers from the Association of Southeast Asian Nations, a 10-member bloc dedicated to economic, political and security cooperation.\n\n\"The United States will do whatever is necessary to defend our own citizens and to honor our security commitments to our allies,\" Kerry told the ASEAN meeting.\n\nHe called on allies to \"vigorously\" enforce sanctions against the isolated regime and urged ASEAN members to \"ensure that the DPRK pays a price for its dangerous actions.\"\n\nJapanese Prime Minister Shinzo Abe made a blunt call for international action at the UN Wednesday. \"Right before our eyes, North Korea is carrying out a plan about which there can be no doubt,\" Abe said. \"There is no alternative but to say that the threat has now reached a dimension altogether different from what has transpired until now.\"\n\nThe perceived threat is changing regional dynamics, bringing old rivals Japan and South Korea closer together. It's putting China on the spot as Washington pushes Beijing to do more to rein its ally in, even as tensions over the South China Sea complicate cooperation. And it will likely prompt a new international push for tougher sanctions, the likes of which were used to force Iran to the negotiating table.\n\nThat's still unlikely to stop North Korea, formally known as the Democratic People's Republic of Korea, experts said. Indeed, US officials and scientific experts expect another nuclear test as soon as early October.\n\n\"From North Korea's perspective, it only makes sense to continue these tests and continue to develop these weapons until there's a substantial shift in dialogue with the US,\" said Alison Evans, a country risk senior analyst at the global consulting firm IHS.\n\n\"For North Korea, it's the recognition that's the important thing. It needs its status as a nuclear power to be recognized,\" Evans said, adding that, \"The leadership sees developing a nuclear deterrent as a guarantor of survival.\"\n\nUS officials say the Pentagon is watching carefully for another nuclear test. Meanwhile, the Union of Concerned Scientists said there is some speculation that Pyongyang may try another satellite launch around October 10, the anniversary of the founding of its Worker's Party of Korea.\n\nNorth Korea conducted its fourth nuclear test in January. In the ensuing months, it has followed that detonation with a total of 21 ballistic missile tests, including land- and submarine-based launches.\n\nIn May, North Korea's 32-year-old leader Kim Jong-un made the country's ambitions official, announcing that Pyongyang was on a dual track of developing nuclear weapons and the economy.\n\nJUST WATCHED US B-1 bombers fly over South Korea Replay More Videos ... MUST WATCH US B-1 bombers fly over South Korea 02:52\n\nPyongyang then staged its largest nuclear test yet on September 9, the anniversary of the DPRK's founding in 1948.\n\nAnd Tuesday's rocket launch was \"substantially larger and more powerful than anything North Korea has tested before,\" according to 38 North, a program devoted to analyzing North Korea at Johns Hopkins University's School of Advanced International Studies.\n\nAll this testing is unlikely to win it the US recognition it craves, though.\n\nAfter the more recent nuclear test, President Barack Obama made clear that \"the United States does not, and never will, accept North Korea as a nuclear state.\"\n\nObama said that the US would work with Asian allies, the UN Security Council and international partners to implement existing measures and \"take additional significant steps, including new sanctions to demonstrate to North Korea that there are consequences to its unlawful and dangerous actions.\"\n\nHowever, the rhetoric from the presidential campaign trail is a constant reminder that Obama administration will soon no longer calling the American shots on the issue.\n\nRepublican presidential nominee Donald Trump has held out the possibility of meeting with Kim in a dramatic break with US political conventions. He earned criticism for the remark, as well as for suggesting that South Korea and Japan should consider developing their own nuclear weapons.\n\n\"At some point we have to say, you know what, we're better off if Japan protects itself against this maniac in North Korea,\" Trump told Anderson Cooper at a CNN town hall in Milwaukee in March. \"We're better off, frankly, if South Korea is going to start to protect itself.\"\n\nThe statements have rattled Tokyo and Seoul, and while Trump has said that China must play a stronger role in checking their neighbor and ally, his promise to play tough with Beijing on trade could also roil that effort.\n\nThe Republican candidate's tough talk has only heightened the uncertainty surrounding American policy in the region and is likely to be something that US officials are asked to address in their consultations Friday.\n\nPhotos: South Korea, U.S. hold 'largest ever' drills South Korean and U.S. troops staged an amphibious assault Saturday, March 12 as U.S. and South Korean military units embarked on eight weeks of annual joint military exercises. Hide Caption 1 of 9 Photos: South Korea, U.S. hold 'largest ever' drills Clouds of camouflage smoke obscure amphibious assault vehicles coming into shore as part of military exercises on March 12. South Korea's defense ministry spokesman is calling the maneuvers \"the largest scale ever,\" involving 300,000 South Korean soldiers and at least 17,000 from the U.S. Hide Caption 2 of 9 Photos: South Korea, U.S. hold 'largest ever' drills A South Korean Marine looks through a viewfinder on a sniper rifle on March 12. Marines and sailors stormed a beach aboard assault vehicles in a mock amphibious assault. Hide Caption 3 of 9 Photos: South Korea, U.S. hold 'largest ever' drills A South Korean Marine looks through his rifle's view finder on March 12 with an amphibious assault vehicle in the background. Hide Caption 4 of 9 Photos: South Korea, U.S. hold 'largest ever' drills A South Korea marine holds an assault rifle in the March 12 exercises. Hide Caption 5 of 9 Photos: South Korea, U.S. hold 'largest ever' drills Small detachments of forces from Australia and New Zealand also participated in Saturday's maneuvers. Hide Caption 6 of 9 Photos: South Korea, U.S. hold 'largest ever' drills South Korean Marines group crouch between two amphibious assault vehicles during the March 12th drill. Hide Caption 7 of 9 Photos: South Korea, U.S. hold 'largest ever' drills South Korean Marines points their weapons during the joint military exercises held on March 12. Hide Caption 8 of 9 Photos: South Korea, U.S. hold 'largest ever' drills Protesters call for a more peaceful atmosphere on the Korean peninsula as South Korea and U.S. troops hold joint military exercises on March 12. Hide Caption 9 of 9\n\nHillary Clinton has also articulated a strong stance on China, but is less likely to take the protectionist steps that could spark a trade war with the Asian power. On North Korea, specifically, she has emphasized ratcheting up US sanctions.\n\nInternational sanctions levied in March after the January nuclear test were the first on North Korea to do more than target weapons development or luxury goods for the elite. They ban all weapons trade and require inspections of all cargo to and from the country, among other steps.\n\nThe international community could squeeze North Korea further by targeting the export of its resources, said Bruce Klingner, a senior research fellow at the Heritage Foundation, echoing the way UN sanctions targeted Iran by banning the export of its oil.\n\n\"That is a big step,\" Klingner said, \"it will impact the people of North Korea.\"\n\nJUST WATCHED General: US held 'nuclear hostage' by North Korea Replay More Videos ... MUST WATCH General: US held 'nuclear hostage' by North Korea 02:16\n\nChina signed on for the March sanctions, but its officials have repeatedly said they believe sanctions are counterproductive and experts say China historically hasn't thoroughly enforced them against North Korea. US tensions with China over the South China Sea could make it harder to cooperate.\n\nDunford said Wednesday that \"China seeks to limit our ability to project power and to undermine the credibility of our alliances in the Pacific.\"\n\nThe US can take additional unilateral steps to get tougher on Pyongyang, Klingner said, by sanctioning non-North Korean entities that act as an agent for the country -- most likely Chinese entities and financial institutions.\n\nIn the meantime, US military officials are planning.\n\nFrom October 3 to 21, the US and South Korea will carry out the joint exercise \"Red Flag\" in Alaska, which will include an aerial exercise \"simulating attacks on nuclear facilities and scenarios of sudden missile attack,\" a ministry spokesperson with the South Korean Defense Department told CNN.\n\nNorth Korea derided South Korea as a \"puppet warmongers\" in a statement about the Red Flag exercises.", "authors": ["Nicole Gaouette"], "keywords": [], "meta_data": {"description": "The US and Asian nations gather in New York Friday with a fresh reminder of perhaps the gravest threat facing the region -- North Korea.", "pubdate": "2016-09-23T02:00:39Z", "author": "Nicole Gaouette, CNN", "og": {"site_name": "CNN", "description": "The US and Asian nations gather in New York Friday with a fresh reminder of perhaps the gravest threat facing the region -- North Korea.", "pubdate": "2016-09-23T02:00:39Z", "title": "North Korea at UN: US faces 'tremendous consequences'", "url": "http://www.cnn.com/2016/09/22/politics/north-korea-un-asean/index.html", "image": {"width": 1100, "identifier": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160910204806-north-korea-nuclear-test-explainer-ripley-orig-00020128-super-tease.jpg", "height": 619}, "type": "article"}, "section": "politics", "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "thumbnail": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160910204806-north-korea-nuclear-test-explainer-ripley-orig-00020128-super-tease.jpg", "template-top": "politics,art-vid-vls-col,col-north-korea-tensions", "vr": {"canonical": "http://www.cnn.com/2016/09/22/politics/north-korea-un-asean/index.html"}, "keywords": "North Korea, US, China, Kerry, Asia, ASEAN, UN, politics, North Korea at UN: US faces 'tremendous consequences' - CNNPolitics", "lastmod": "2016-09-23T23:45:00Z", "twitter": {"image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160910204806-north-korea-nuclear-test-explainer-ripley-orig-00020128-super-tease.jpg", "description": "The US and Asian nations gather in New York Friday with a fresh reminder of perhaps the gravest threat facing the region -- North Korea.", "card": "summary_large_image", "title": "North Korea at UN: US faces 'tremendous consequences'"}, "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "canonical_link": "http://www.cnn.com/2016/09/22/politics/north-korea-un-asean/index.html", "images": ["http://i2.cdn.cnn.com/cnnnext/dam/assets/170613154614-north-korea-flag-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170829104201-korea-missile-launch-tv-t1-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130418091942-north-korea-missile-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160916060059-north-korea-snl-satire-will-ripley-pkg-00003007-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170405150356-kim-thumb-1-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160209172454-02-north-korea-rocket-debris-0902-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140150-south-korea-military-drills-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312145046-south-korea-military-exercises-protests-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140354-south-korea-military-drills-3-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130418091942-north-korea-missile-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130131013828-north-korea-nuclear-test-site-topics.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140732-south-korea-military-drills-6-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130518052242-north-korea-missiles-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/150508215003-north-korea-submarine-missile-test-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/151008191917-kim-jong-un-north-korea-leader-life-00000406-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312141634-south-korea-military-drills-8-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160424111037-north-korea-slbm-test-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312141803-south-korea-military-drills-9-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140354-south-korea-military-drills-3-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160309114256-north-korea-warhead-1-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170829143348-02-south-korea-bombing-drill-large-169.jpeg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/150208202029-north-korea-missiles-test-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312141432-south-korea-military-drills-7-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140732-south-korea-military-drills-6-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160106064856-03-nk-hydrogen-bomb-0106-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170212231837-02-north-korea-missile-launch-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/150508215003-north-korea-submarine-missile-test-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170530100225-01-north-korea-missile-test-0530-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130124073025-nkorea-missile-dec2012-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170822225414-01-kim-jong-un-chemical-material-institute-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170809151013-madeleine-bordallo-guam-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160106064856-03-nk-hydrogen-bomb-0106-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170819230610-south-korea-surveillance-north-korea-intelligence-field-pkg-00000000-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312141634-south-korea-military-drills-8-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170808135427-nk-8-8-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130124073025-nkorea-missile-dec2012-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160610123626-kim-jong-un-smoking-orig-00001908-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170822220309-01-trump-phoenix-0822-screengrab-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160910204806-north-korea-nuclear-test-explainer-ripley-orig-00020128-super-tease.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140611-south-korea-military-drills-5-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170809210024-trump-nk-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160913095552-b-1-bomber-us-south-korea-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170810145614-01-trump-presser-0810-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170809123230-guam-north-korea-missile-what-to-know-lon-orig-00000000-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130131013828-north-korea-nuclear-test-site-horizontal-large-gallery.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170212231837-02-north-korea-missile-launch-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160424111037-north-korea-slbm-test-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/150208202029-north-korea-missiles-test-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312141432-south-korea-military-drills-7-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140508-south-korea-military-drills-4-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160922150521-global-headaches-north-korea-thumbnail-exlarge-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170810164421-trump-pool-spray-3-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140150-south-korea-military-drills-super-169.jpg", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312145046-south-korea-military-exercises-protests-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160922150521-global-headaches-north-korea-thumbnail-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160309114256-north-korea-warhead-1-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/130518052242-north-korea-missiles-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312141803-south-korea-military-drills-9-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140508-south-korea-military-drills-4-small-11.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/170829012353-japan-pm-abe-furious-over-nk-missile-stevens-lkl-00005328-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160312140611-south-korea-military-drills-5-super-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160209172454-02-north-korea-rocket-debris-0902-super-169.jpg"], "title": "North Korea at UN: US faces 'tremendous consequences'", "url": "http://cnn.it/2cVh9ZP", "summary": "", "movies": [], "publish_date": null, "source": "http://cnn.it"}
