{"top_img": "http://static.politico.com/bd/ef/782b3bea43b69f0bc5789acf8920/162209-trump-secret-service-getty-1160.jpg", "text": "Donald Trump's campaign isn't alone in patronizing his own businesses: taxpayers are indirectly doing so, too.\n\nFederal Election Commission records show that the U.S. Secret Service has paid the Trump campaign about $1.6 million to cover the cost of flying its agents with the candidate on a plane owned and operated by one of his companies.\n\nStory Continued Below\n\nIt’s standard practice for the agency — which is tasked with protecting presidential candidates as well as presidents and other federal officials — to reimburse presidential campaigns for the cost of traveling with the candidates.\n\nIn fact, the Secret Service has reimbursed the Clinton campaign, too: $2.6 million so far this cycle.\n\nThe difference with Trump is that one of his companies, TAG Air, Inc., owns the plane, so the government is effectively paying him.\n\nThe Clinton campaign, by contrast, mostly has been chartering planes from a private company called Executive Fliteways in which the Clintons do not have any ownership interest.\n\n“The taxpayers are actually reimbursing Trump for the travel of the Secret Service agents,\" said Brett Kappel, a campaign finance lawyer at the law firm Akerman LLP. \"It's just another example of how the Trump campaign has taken an unprecedentedly large amount of its money and spent it at Trump-owned facilities.\"\n\nTrump campaign spokeswoman Hope Hicks responded to questions about the Secret Service payments by saying “everything was done in accordance with FEC guidelines and regulations. Please direct further questions to USSS.”\n\nSecret Service spokeswoman Nicole Mainor said the FEC “specifically requires security personnel such as the Secret Service to reimburse campaigns for seats” on charter aircraft.\n\nA POLITICO analysis of FEC records found that, through the end of August, Trump’s campaign has spent at least $8.2 million at Trump's own businesses, including to hold events at his hotels, buy food from his restaurants and rent office space for its headquarters in his Manhattan office tower.\n\nBut the biggest chunk of the expenses, almost $6 million, were to TAG Air, Inc.\n\nTrump, who once said “I could be the first presidential candidate to run and make money on it,” has attracted criticism for mixing business and politics to an unprecedented degree. He has made a point of highlighting his properties on the campaign trail, leading opponents to accuse him of using his presidential bid to promote his brand and line his pockets.\n\nThe campaign in a statement on Thursday rejected that criticism as “misleading and flat out wrong,” pointing out that the amount the campaign spent at Trump's businesses is far less than the $54 million of his own money that Trump has pumped into the campaign.\n\nThe statement explained the campaign’s payments to TAG Air and other Trump-owned companies by saying “the campaign has used known quantities as far as event space, air travel and accommodations, and has fulfilled all FEC requirements throughout the campaign.”\n\nThe government's practice of reimbursing campaigns for costs incurred by their Secret Service details dates from an era when campaigns were lower-budget affairs, the logic being candidates shouldn't have to use their own resources on required security, according to Craig Engle, a political lawyer at Arent Fox who helped draft the provision as a staffer at the Federal Election Commission.\n\n\"It's basically just calling it even,\" Engle said. \"It's either Trump making a contribution to the U.S. government, or the U.S. government reimburses the Trump campaign for its expenses.\"\n\nThe same rationale applies to journalists who travel with the presidential candidates. The journalists or their employers reimburse the campaigns for travel costs. So it’s conceivable that media outlets might end up paying the Trump campaign for the cost of staying in a Trump-owned hotel or flying on a Trump-owned plane.\n\nThe Secret Service could also end up paying Trump's hotels to put up his agents when the candidate stays there. But those expenses don't appear in FEC reports because the government pays them directly.\n\nThe agency paid the Trump campaign an additional $724,000 for air travel that was refunded, according to the FEC reports, which do not offer an explanation for the refund.\n\nOf course, Trump also travels on the campaign trail with his own robust private security detail. In August, Trump’s campaign spent $232,800 on security-related costs, including payments to private companies such as Xmark LLC, Black Tie Protection Services and KS Global Group, as well as local police in places he visited.\n\n\n\nAuthors:", "authors": ["Kenneth P", "Jack Shafer", "Isaac Arnsdorf", "Vogel Isaac Arnsdorf"], "keywords": [], "meta_data": {"description": "The agency pays to travel with all presidential nominees, but in Trump’s case, that money went to one of his companies.", "og": {"site_name": "POLITICO", "description": "The agency pays to travel with all presidential nominees, but in Trump’s case, that money went to one of his companies.", "title": "Trump received $1.6 million from Secret Service", "url": "http://politi.co/2d86IUo", "image": "http://static.politico.com/bd/ef/782b3bea43b69f0bc5789acf8920/162209-trump-secret-service-getty-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/donald-trump-secret-service-campaign-travel-payments-228553", "images": ["http://static.politico.com/bd/ef/782b3bea43b69f0bc5789acf8920/162209-trump-secret-service-getty-1160.jpg", "https://static.politico.com/dims4/default/b46e68e/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fbd%2Fef%2F782b3bea43b69f0bc5789acf8920%2F162209-trump-secret-service-getty-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Trump received $1.6 million from Secret Service", "url": "http://politi.co/2cQ4Ssc", "summary": "", "movies": [], "publish_date": {"$date": 1474571470000}, "source": "http://politi.co"}
