{"top_img": "http://static.politico.com/d2/ca/ba3a9b9f4ced82ae0fcdcbaf31a5/160904-gary-johnson-ap-91701597059.jpg", "text": "\"I'm not going to lose one minute of sleep ruining this two party monopoly that is going on,\" Gary Johnson said. | AP Photo Libertarian candidates: We will alter course of the election\n\nDespite not making it to the first debate stage, both parts of the Libertarian ticket agree they are \"going to alter the course of this election whether or not we're in the debates.\"\n\nLast week, it was determined that Libertarian candidate Gary Johnson and Green Party candidate Jill Stein did not make the cut for the first presidential debate, which will be held Sept. 26. Despite that, on Sunday in an interview that aired on \"60 Minutes,\" Johnson and running mate William Weld agreed with interviewer Steve Kroft that their ticket still has the ability to make an impact.\n\nStory Continued Below\n\nJohnson said 70 percent of America do not know either him or Weld. At the end of the day, the former New Mexico governor said the Libertarian ticket is taking votes from both Democratic nominee Hillary Clinton and Republican nominee Donald Trump.\n\n\"This is both sides, man, this is both barrels,\" Johnson said on the CBS news program. \"I'm not going to lose one minute of sleep ruining this two party monopoly that is going on. I think they are dinosaurs and I think we're the comet in this whole equation. I'm glad for it.\"\n\nFor his part, Weld said he thought their ticket would hurt Trump more. \"I think at the end of the day, it would be most likely Trump than Clinton,\" the former Massachusetts's governor said.\n\nJohnson also acknowledged his recent gaffe, where he could not identify what the Syrian city of Aleppo was. He said there is no quicker way to fix mistakes than acknowledging them in the first place.\n\n\"I am human, I have a filter, it starts with honesty, it starts with the truth. When I was asked the question, the first thing that came to my mind is this is an acronym,\" Johnson said. \"You know so many people have said 90 percent of American doesn't know Aleppo, well 90 percent of America is not running for president of the United States. No excuse, no excuse.\"\n\nAuthors:", "authors": ["Rebecca Morin", "Hadas Gold", "Daniel Strauss", "Jack Shafer"], "keywords": [], "meta_data": {"description": "Despite not qualifying for the first debate, Gary Johnson and Bill Weld are pressing on.", "og": {"site_name": "POLITICO", "description": "Despite not qualifying for the first debate, Gary Johnson and Bill Weld are pressing on.", "title": "Libertarian candidates: We will alter course of the election", "url": "http://politi.co/2d4GiU4", "image": "http://static.politico.com/d2/ca/ba3a9b9f4ced82ae0fcdcbaf31a5/160904-gary-johnson-ap-91701597059.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/johnson-weld-libertarian-debate-228340", "images": ["http://static.politico.com/d2/ca/ba3a9b9f4ced82ae0fcdcbaf31a5/160904-gary-johnson-ap-91701597059.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://static.politico.com/dims4/default/706447f/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fd2%2Fca%2Fba3a9b9f4ced82ae0fcdcbaf31a5%2F160904-gary-johnson-ap-91701597059.jpg"], "title": "Libertarian candidates: We will alter course of the election", "url": "http://politi.co/2cj6KrE", "summary": "", "movies": [], "publish_date": {"$date": 1474232307000}, "source": "http://politi.co"}
