{"top_img": "http://static.politico.com/01/fa/317fc52347e8bc3ea017a94fd523/160922-charlotte-unrest-getty-1160.jpg", "text": "Police and protesters carry a seriously wounded protester into the parking area of the the Omni Hotel during a march to protest the death of Keith Scott September 21. | Getty McCrory calls state of emergency in Charlotte after unrest\n\nNorth Carolina Gov. Pat McCrory called for a state of emergency in Charlotte Wednesday night after violence escalated as residents continued to protest the fatal shooting of an African-American man by a police officer a day prior.\n\n\"I have declared a State of Emergency & initiated efforts to deploy the Nat'l Guard & Highway Patrol to assist local law enforcement in CLT,\" McCrory tweeted late Wednesday night.\n\nStory Continued Below\n\nCivil unrest surged Tuesday as reports of the fatal shooting of Keith Lamont Scott spread, prompting mass protests that went into the night. A dozen officers were injured during the unrest, according to a tweet from the local police department early Wednesday morning.\n\nAs protests continued Wednesday, reports emerged of a shooting that left a protester critically wounded, according to the Associated Press. Charlotte officials at first announced the man was dead but later amended the statement to say he was on life support. The police department has said the shooting was not committed by an officer.\n\n\"These police officers are showing a tremendous amount of courage and there's obviously a few hundred people who have come to our town center in Charlotte, North Carolina, which is a great city in and their major goal seems to be destruction and harm and that's wrong and it's unacceptable,\" McCrory said Wednesday night on CNN shortly after making the announcement.\n\n\"We cannot tolerate violence or tolerate the destruction of property and will not tolerate the attacks towards our police officers occurring right now and I feel very strongly about that right now,\" McCrory added. \"That is not the American way.\"\n\nThe North Carolina governor added that though the state of emergency did not include a curfew, the possibility of one remained \"a very strong option.\"\n\nAccording to local reports, police officers saw Scott getting out of his car while holding a gun. The Charlotte-Mecklenburg Police Department said Scott posed an imminent danger to officers, and an officer shot the man.\n\nAuthors:", "authors": ["Nick Gass", "Jack Shafer", "Cristiano Lima"], "keywords": [], "meta_data": {"description": "Protests continued Wednesday over the fatal shooting of an African-American man.", "og": {"site_name": "POLITICO", "description": "Protests continued Wednesday over the fatal shooting of an African-American man.", "title": "McCrory calls state of emergency in Charlotte after unrest", "url": "http://politi.co/2cnvPwX", "image": "http://static.politico.com/01/fa/317fc52347e8bc3ea017a94fd523/160922-charlotte-unrest-getty-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/mccrory-calls-state-of-emergency-in-north-carolina-deploys-national-guard-228506", "images": ["https://static.politico.com/dims4/default/78c6ef0/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F01%2Ffa%2F317fc52347e8bc3ea017a94fd523%2F160922-charlotte-unrest-getty-1160.jpg", "http://static.politico.com/01/fa/317fc52347e8bc3ea017a94fd523/160922-charlotte-unrest-getty-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "McCrory calls state of emergency in Charlotte after unrest", "url": "http://politi.co/2d5L43j", "summary": "", "movies": [], "publish_date": {"$date": 1474503757000}, "source": "http://politi.co"}
