{"top_img": "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/Untitled-1-Recovered-Recovered-Recovered-Recovered-4.jpg", "text": "Donald Trump is, well, deplorable. He’s suggested building a wall to keep invading hordes of brown-skinned “rapists” and “drug dealers” from charging into the country, gotten on board with creating a national registry for Muslims like Hitler did with the Jews, forcing said Muslims to wear special identification badges, and even rounding them up into modern-day concentration camps as a “temporary measure.” He’s even suggested outright murdering the families of terrorists abroad:\n\n“The other thing with the terrorists is you have to take out their families, when you get these terrorists, you have to take out their families. They care about their lives, don’t kid yourself. When they say they don’t care about their lives, you have to take out their families.”\n\nBut he’s not satisfied with slaughtering innocents to get to terrorists overseas, He also wants to bring that idea home. In a statement on the bombings in New York and New Jersey over the weekend, The Donald’s Senior Communications Advisor explained that Trump is not fighting terrorism — he’s fighting the “narratives” of Barack Obama and Hillary Clinton. And Trump’s “narrative” is “kill them all”:\n\nLast weekend’s attacks, which are just the latest to be carried out on U.S. soil on President Obama’s watch, should be a wakeup call for every American. It is highly disturbing and entirely unacceptable that 858 immigrants from dangerous countries have slipped into our country and been granted full U.S. citizenship because of the failed policies supported by President Obama and Hillary Clinton. Even worse, Clinton must explain her reckless support for a 550% increase in Syrian refugees and her push for an all-out open border policy, which will put even more Americans at risk. The threat from radical Islamic terrorism has only grown under Obama and Clinton, and ISIS has greatly expanded the number of countries where it is fully operational. Our enemies neither fear nor respect Hillary Clinton, and as a nation, that is dangerous, and it is disgraceful. Mr. Trump will bring an end to these attacks, because unlike Obama and Clinton, he believes we’re in more than a fight about ‘narratives’ – these terrorists pose an existential threat to our country and our values and they must be destroyed before they can harm any more of our citizens.\n\nPay attention to that last bit: “They must be destroyed before they can harm any more of our citizens.”\n\nNow, we already know that the problem according to the GOP presidential nominee is “radical Islamic terrorism,” and that Trump has (numerous times) blamed Muslims in general for any attacks he could. Exactly how selective do you think he will be in eliminating “terrorists?”\n\n“They’re protecting each other, but they’re really doing very bad damage — they have to open up to society and report the bad ones,” Trump said in March. “When they see trouble, they have to report it. They are absolutely not reporting it, and that’s a big problem.”\n\nIf Muslims are “protecting” terrorists, are they not terrorists in Trump’s eyes? How many days in his presidency would pass before anyone who follows Islam was rounded up? Would there be mass exterminations? Trump has already suggested slaughtering terrorists’ families. How would he define terrorism?\n\nThese are all questions it is unlikely that Mr. Trump will answer for himself — but remember he is exactly the sort of person who, with a wink and a nod, suggests disarming his political opponents’ security to “see what happens” to them (shortly after suggesting that “Second Amendment People” could deal with them. We’re dealing with an unstable, constantly suspicious person whose first instinct in conflict is to push the ‘little red button’ that launches our nuclear arsenal.\n\nIt’s also important to remember that the attacks in New York and New Jersey were committed by an American citizen — one with Constitutional rights, no matter how much someone wants to call for blood. This, of course, matters not to The Donald.\n\nNormally, suggesting that a candidate will bring back concentration camps and murder civilians is hyperbole. But not with Trump. He’s said it himself. Many times.\n\nIf we allow this alleged human, this Oompa Loompa who has escaped from the chocolate factory to wreak havoc on our nation — to assume office, it will not end well. Be sure to vote in November if it’s the last thing you do. If Trump wins, it may be.\n\nFeatured image via Getty Images/Joe Raedle", "authors": ["John Prager"], "keywords": [], "meta_data": {"publisher": "Addicting Info | The Knowledge You Crave", "description": "If Trump becomes President, this will not end well.", "generator": "WPZOOM Framework 1.5.0", "author": "John Prager", "og": {"site_name": "AddictingInfo", "description": "If Trump becomes President, this will not end well.", "title": "Trump’s Latest Campaign Promise May Be His Most Horrible One Yet", "url": "http://addictinginfo.com/2016/09/19/trumps-latest-campaign-promise-may-be-his-most-horrible-one-yet/", "image": "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/Untitled-1-Recovered-Recovered-Recovered-Recovered-4.jpg", "locale": "en_US", "type": "article"}, "twitter": {"description": "If Trump becomes President, this will not end well.", "creator": "@EvilLiberalPig", "url": "http://addictinginfo.com/2016/09/19/trumps-latest-campaign-promise-may-be-his-most-horrible-one-yet/", "image": "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/Untitled-1-Recovered-Recovered-Recovered-Recovered-4.jpg", "title": "Trump's Latest Campaign Promise May Be His Most Horrible One Yet", "site": "@AddInfoOrg", "card": "summary_large_image"}, "fb": {"app_id": 529217710562597, "pages": 146422995398181}, "article": {"publisher": "https://www.facebook.com/politicsbyjustin/", "author": "http://www.facebook.com/iamyourknight"}, "keywords": "Adolf Hitler, Barack Obama, concentration camps, Donald Trump, Hillary Clinton, Trump, trump 2016", "google-site-verification": "jVoeEwkTNH-nlRuMnNJ8bZ2zUtHf0dCo_GKDu1InEl4", "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://addictinginfo.com/2016/09/19/trumps-latest-campaign-promise-may-be-his-most-horrible-one-yet/", "images": ["http://i.imgur.com/JeqZLhj.png", "http://2.gravatar.com/avatar/896e3249030ff74276709a1914c25ea3?s=70&d=identicon&r=g", "https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=Ckvzg1awO700y8", "http://i.imgur.com/rUJFIsF.png", "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/Untitled-1-Recovered-Recovered-Recovered-Recovered-4.jpg", "http://addictinginfo.com/wp-content/uploads/2013/05/masthead.jpg", "http://pixel.quantserve.com/pixel/p-CR_FUckkEtQQm.gif", "http://b.scorecardresearch.com/p?c1=2&c2=17503306&cv=2.0&cj=1", "http://i.imgur.com/50AezNi.png"], "title": "Trump’s Latest Campaign Promise May Be His Most Horrible One Yet", "url": "http://www.addictinginfo.org/2016/09/19/trumps-latest-campaign-promise-may-be-his-most-horrible-one-yet/", "summary": "", "movies": [], "publish_date": {"$date": 1474243200000}, "source": "http://www.addictinginfo.org"}
