{"title": "Surgeon General warns: Drinking every time Trump lies during debate could result in acute alcohol poisoning", "text": "Many individuals tuned into the 90-minute commercial-free debate on CNN and many of them turned the event into a drinking game, as Americans often do. However, the US Surgeon General warns that playing a game involving drinking each time Donald Trump tells a lie could result in alcohol poisoning.\r\n\r\nLast year, during the GOP debates, the Surgeon General, Vivek Murthy, warned to Americans that engaging in drinking games could be hazardous, \"especially with the field the republicans are giving us this year.\" Murthy acknowledged that Americans play drinking games during debates and that they needed to be careful while doing so if we're drinking when candidates are lying. During the debates of 2012, there was about 70,000 alcohol-poison related instances which occurred, and the Surgeon General warned everyone of this danger in 2015\r\n\r\nThe story was no different prior to the first presidential debate between Clinton and Trump on Monday, Sept. 26, 2016. The US Surgeon General warned that drinking when Trump lied could result in alcohol poisoning and facts back up his claims.\r\n\r\nAccording to Politco, Donald Trump accumulated 87 lies in their study lasting from Sept. 15 to Sept. 20. Yes, in 5-day period Donald Trump lied 87 times, according to Politico's \"rigorous fact-checking\" which involved statements made by both Trump and Clinton. The study was conducted following Trump's statement on the \"birther moment\" and how Clinton, not he, started it in 2008. Trump's 87 lies over a five-day period averaged out to him telling a lie about every three minutes and 15 seconds over five hours of remarks.\r\n\r\nSo, in terms of this average, Trump probably told about 28 lies during the CNN Presidential debate between him and Clinton. The Surgeon General warned Americans to be cautious and said that first-responders were bracing themselves to handle alcohol-related issues following Clinton and Trump's CNN debate.\r\n\r\nSo, Americans cannot say they were not warned to be cautious about playing drinking games regarding Trump's habit of lie-telling. There are still a few debates ahead of us before the Nov. 8 election, so if you're going to drink during them keep it responsible. Baby sips for Trump's lies."}