{"top_img": "https://www.chicksontheright.com/wp-content/uploads/2016/09/2016-09-19-20-46-49.jpg", "text": "According to this, the Arizona state legislature needs some remedial courses on how to word their bills so that they don’t end up with laws that unintentionally ban perfectly normal parenting activities.\n\nCase in point.\n\nThe specific law criminalizes ANY contact between an adult and a child’s genitals, so if you’re a parent of a child and you’ve changed his/her diaper, or given him/her a bath, you’re a felon. For real.\n\nThis is what happens when you have terrible legislators who pass laws forbidding people from “intentionally or knowingly touching” the genitals of a child under the age of 15. Of course, their intention is to protect children from child molesters, but because they don’t know how to write effective legislation, AZ parents are now criminals if they dare to bathe their own kids.\n\nThe AZ Supreme Court, then, decided to double down, insisting that “prosecutors are unlikely to charge parents engaged in innocent conduct.” They ruled that defendants will be required to prove their lack of sexual intent. So much for innocent-until-proven-guilty, right?\n\nIn others words, just trust the prosecutors, y’all. There’s no need to rewrite or revise a terrible law that criminalizes normal behavior, because prosecutors will use common sense. See? Just trust them.\n\nWow.\n\nThere are a whole bunch of legal implications to consider here, and you can read those in detail at the sourcelink. But here’s an especially interesting tidbit:\n\nAs Fordham law professor John Pfaff explains, the majority’s logic has one final defect: It utterly ignores the reality of plea bargaining, which is how more than 90 percent of criminal cases in America are resolved. Given the immense expense and hassle of a trial, many defendants are pressured into striking a deal with a prosecutor, trading a lighter sentence for an admission of guilt. Arizona prosecutors can now dangle the threat of a probable child molestation conviction to coerce any parent of a young child into taking a plea deal on unrelated charges. With the state Supreme Court’s help, Arizona’s child molestation laws have been weaponized into a tool for prosecutorial harassment, allowing the state to target any parent or caregiver—out of spite or malice, or simply to boost their conviction rates. This terrible decision has gutted constitutional rights and turned many of the state’s residents into unknowing criminals. Barring intervention by the U.S. Supreme Court, due process has now been suspended for Arizona’s parents and caregivers.\n\nYikes.\n\nBut I’m sure it’ll all just work itself out. We should just trust the government on this, y’all. Because doesn’t government always know best?", "authors": ["Mockarena Cotr"], "keywords": [], "meta_data": {"description": "A terrible law just got upheld by a terrible Supreme Court.", "og": {"site_name": "Chicks On The Right", "description": "A terrible law just got upheld by a terrible Supreme Court.", "title": "Changing Your Baby's Diaper Is Now A Sex Crime In Arizona - Chicks On The Right", "locale": "en_US", "image": {"width": 812, "identifier": "https://www.chicksontheright.com/wp-content/uploads/2016/09/2016-09-19-20-46-49.jpg", "height": 550}, "url": "https://www.chicksontheright.com/2016/09/19/changing-your-babys-diaper-is-now-a-sex-crime-in-arizona/", "type": "article"}, "twitter": {"image": "https://www.chicksontheright.com/wp-content/uploads/2016/09/2016-09-19-20-46-49.jpg", "description": "A terrible law just got upheld by a terrible Supreme Court.", "card": "summary", "title": "Changing Your Baby's Diaper Is Now A Sex Crime In Arizona - Chicks On The Right"}, "robots": "noodp", "article": {"publisher": "https://www.facebook.com/ChicksOnTheRight/", "section": "Constitution", "tag": "felony", "published_time": "2016-09-19T20:49:22-04:00", "author": "https://www.facebook.com/ChicksOnTheRight/"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "https://www.chicksontheright.com/2016/09/19/changing-your-babys-diaper-is-now-a-sex-crime-in-arizona/", "images": ["https://secure.gravatar.com/avatar/0a2fb62ae885c1cdb2a0c69249a9c25a?s=120&d=mm&r=g", "http://www.chicksontheright.com/changing-your-babys-diaper-is-now-a-sex-crime-in-arizona/?utm_source=RWN&utm_medium=RWN&utm_campaign=RWN#!", "https://www.chicksontheright.com/wp-content/uploads/2015/11/cotrolog-smalll.png", "https://www.chicksontheright.com/wp-content/uploads/2015/11/CotR_banner1-copy-2.jpg", "http://pixel.quantserve.com/pixel/p-8W3QtpyKy7xuZ.gif", "http://rightchicks.staging.wpengine.com/wp-content/uploads/2015/11/book-thumb.jpg", "https://www.chicksontheright.com/wp-content/uploads/2016/09/2016-09-19-20-46-49-812x478.jpg", "https://www.chicksontheright.com/wp-content/uploads/2016/09/2016-09-19-20-46-49.jpg", "https://www.chicksontheright.com/wp-content/uploads/2017/08/kardashian-jenner-424x250.jpg", "http://pixel.quantserve.com/pixel/p-d1x2X8_nNBHjc.gif"], "title": "Changing Your Baby's Diaper Is Now A Sex Crime In Arizona", "url": "http://www.chicksontheright.com/changing-your-babys-diaper-is-now-a-sex-crime-in-arizona/?utm_source=RWN&utm_medium=RWN&utm_campaign=RWN", "summary": "", "movies": [], "publish_date": {"$date": 1474332562000}, "source": "http://www.chicksontheright.com"}
