{"title": "ALERT: Police Pull Over ‘Islamic Refugee,’ Horrified To See What Was In The Car", "text": "We need a border wall. It is not just a matter of preventing illegal immigration, but securing an essential access point into America.\r\n\r\nLaw enforcement is on high alert after a routine traffic stop revealed troubling intentions. Police in Luna County, New Mexico, pulled over an undocumented Middle Eastern woman with the plans for a nearby gas pipeline and surrounding area.\r\n(via Mad News World)\r\n\r\nPolice were unable to determine why the woman, described as an “Islamic refugee,” was in possession of the plans, but many are fearing the worst.\r\n\r\nThe plans detailed a pipeline in Deming, New Mexico. The FBI’s Joint Terrorism Task Force was deployed with the U.S. Border Patrol to investigate the area. The search came up empty.\r\n\r\nThe pipeline identified in the Muslim woman’s plans is fairly remote, leading many to assume that the woman was scouting out potential targets for future terror attacks and did not have immediate intentions to launch an attack.\r\n\r\nIt is troubling to discover an undocumented Muslim woman in a county sharing a border with Mexico.\r\n\r\nA report released by Judicial Watch in 2015 revealed that Mexican cartels were working with terror organizations. The report indicates that Mexican gangs were accepting payments to smuggle foreigners from terror-plagued nations into our country.\r\n\r\nJudicial Watch also revealed in a 2017 report that Mexico-based Islamic terror groups have been illegally crossing the border into America to scout out potential targets.\r\n\r\nCongress should approve funding for President Trump’s border wall at once. It is not merely a matter of preventing illegal immigration. Many nefarious groups, such as terrorists and drug cartels, are aware that the southern border is the easiest way to sneak into America.\r\n\r\nMany of the illegal immigrants entering America are not even from Mexico. Instead, aliens from south of Mexico are able to travel across the country in order to reach the American-Mexican border. Many of these aliens receive active support from the Mexican government, who cannot support the illegal immigrants.\r\n\r\nIf a terrorist wanted to sneak into America to launch an attack, they could easily travel across the southern border. They could start their journey south of Mexico, arriving in countries without the ability to vet travelers.\r\n\r\nThe only way we can secure our nation from foreign threats is by constructing a wall on the southern border. Until we do, our country is easy pickings."}