{"top_img": "http://www.yesimright.com/wp-content/uploads/2015/11/radicalmuslim5_1.jpg", "text": "When Donald Trump said that he wanted to ban Muslim immigration until we know what’s going on, every single Democrat and liberal yahoo yelled until their voice was hoarse that it was racist.\n\nOh how wrong they were, and still are.\n\nFirst off, racism is the belief that one race is inherently better than another simply by virtue of the color of their skin. Islam isn’t a race, it is a religion that lends itself very well to radicalization. This is the same religion that has believers blow themselves up in crowded places thinking they’ll go to heaven to party with 72 virgins.\n\nThe insanity, in this issue, is clearly on the side of the Democrats. After seeing how the world is working, Trump wanted to put a temporary ban on all Muslim immigration until we figure out how to stop the terrorists from coming in.\n\nDemocrats think the world will agree with them, and they’re flat out wrong. Well, this has got to sting:\n\nA new poll has found that 49 percent of Australians support a ban on Muslim immigration, a huge jump from last October when only 28 percent backed the idea. The Essential Research survey also revealed 48 per cent of voters would welcome a national debate on the issue, and showed that two thirds of Australians agree that populist senator Pauline Hanson talks about topics other politicians are afraid to bring up. The top reasons for wanting a ban were fears over terrorism, and a belief that Muslim migrants do not integrate nor share Australian values. The poll was first conducted in early August and then repeated to ensure the results were not outliers.\n\nSo Australians want to preserve Australian values? That sounds like what every single other culture on earth wants to do. Yet, when Trump says “America first” it’s suddenly racist.\n\nOk, yeah, that sounds logical.\n\nSixty per cent of respondents who support the right-wing Coalition favour an end to Muslim migration along with 40 per cent of Labour voters and 34 per cent of Green voters. “Floored” by the results, the pollster laments that the “basket of deplorables”, who he previously thought were just a “marginalised rump, out of step with the views of modern, mainstream, cosmopolitan Australia”, is too big to ignore. He writes: “This not a ‘basket of deplorables’ who sit outside the confines of polite society, that is 49% of the men and women who make up our nation. “Yes, they are more likely to vote Coalition or ‘other’ but 40% of Labor voters and one third of Greens agree too. Look around you right now, there are people in your workplace, in your street, on your train, who agree with Hanson.”\n\nDo you hear that, Hillary? This is how you respond to people who oppose you. You don’t call them “deplorables,” you recognize that half the country is against you. Let’s get this done in November.\n\n(Source: Breitbart)\n\n\n\n", "authors": ["Blair Patterson"], "keywords": [], "meta_data": {"description": "When Donald Trump said that he wanted to ban Muslim immigration until we know what's going on, every single Democrat and liberal yahoo yelled until their voice was hoarse that it was racist.\r\n\r\nOh how wrong they were, and still are.\r\n\r\nFirst off, racism is the belief that one race is inherently bett", "generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "author": "Blair Patterson", "og": {"site_name": "Yes I'm Right.", "description": "When Donald Trump said that he wanted to ban Muslim immigration until we know what's going on, every single Democrat and liberal yahoo yelled until their voice was hoarse that it was racist.\r\n\r\nOh how wrong they were, and still are.\r\n\r\nFirst off, racism is the belief that one race is inherently bett", "title": "Australia Voted To Ban Muslims And Liberals Are Pissed", "url": "http://www.yesimright.com/australia-voted-to-ban-muslims-and-liberals-are-pissed/", "image": "http://www.yesimright.com/wp-content/uploads/2015/11/radicalmuslim5_1.jpg", "updated_time": "2016-09-23T07:43:05+00:00", "type": "article"}, "twitter": {"url": "http://www.yesimright.com/australia-voted-to-ban-muslims-and-liberals-are-pissed/", "card": "summary_large_image", "title": "Australia Voted To Ban Muslims And Liberals Are Pissed"}, "fb": {"app_id": 394342743979851}, "msapplication-TileImage": "http://www.yesimright.com/wp-content/uploads/2016/06/cropped-favicon2-270x270.png", "article": {"publisher": "https://www.facebook.com/yesiamright/", "section": "POLITICS", "published_time": "2016-09-23T07:42:51+00:00", "modified_time": "2016-09-23T07:43:05+00:00"}, "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://www.yesimright.com/australia-voted-to-ban-muslims-and-liberals-are-pissed/", "images": ["http://www.yesimright.com/wp-content/uploads/2017/08/rosie_1-324x160.jpg", "http://www.yesimright.com/wp-content/uploads/2015/10/obamatreason2_1.jpg", "https://pixel.quantserve.com/pixel/p-4_bCA6jtHeMt5.gif", "http://www.yesimright.com/wp-content/uploads/2016/06/yir_shadow2_long-e1466287423877.png", "http://www.yesimright.com/wp-content/uploads/2016/07/hillarydnc-324x160.jpg", "http://media.breitbart.com/media/2016/09/AUSTRALIA-DEMONSTRATION-RACISM-640x480.jpg", "https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=EKGFm1akKd60kU", "http://www.yesimright.com/wp-content/uploads/2015/11/radicalmuslim5_1.jpg", "http://www.yesimright.com/wp-content/uploads/2017/04/msnbcsnap-324x160.jpg", "http://www.yesimright.com/wp-content/uploads/2017/08/ANTIFA-8-17-17-324x160.jpg", "http://www.yesimright.com/wp-content/uploads/2016/06/obamaevil_1-324x160.jpg", "http://www.yesimright.com/wp-content/uploads/2017/05/Woods-5-16-17-324x160.jpg"], "title": "Australia Voted To Ban Muslims And Liberals Are Pissed", "url": "https://goo.gl/p7jFZG", "summary": "", "movies": [], "publish_date": {"$date": 1474616571000}, "source": "https://goo.gl"}
