{"title": "Homosexual Thinks Muslims Will Accept Him, Instantly Learns How They Deal With LGBT", "text": "Once again, the “religion of peace” has proven to be neither peaceful nor tolerant — but don’t tell that to political leaders across Europe. They wouldn’t listen anyway.\r\n\r\nIn May of 2016, Aaron Woods, a homosexual, was the target of a truly “homophobic” attack, according to Brighton & Hove News.\r\n\r\n“The victim, a 26-year-old from Eastbourne, was approached by a man who used homophobic language before being punched in the face and suffering a broken jaw,” Sussex police reported.\r\n\r\nAccording to the victim’s friend, Brian Markintosh, when Woods was being attacked, the assailant “was shouting all this Muslim stuff … Aaron was in so much pain. He was really screaming.”\r\n\r\n\"Gay-Bashing\" Incident\r\n\r\n“He’s such a gentle giant. He’s the kindest person you could imagine — this geezer broke his jaw with a knuckleduster. He was filming the young gay guys,” Markintosh added.\r\n\r\nNear the beginning of that same month, there was a similar incident to the one with Woods, in which a gay couple was attacked by two men.\r\n\r\n“I am saddened to hear of the homophobic assaults in Brighton over the last two weekends,” Sgt. Peter Allan said. “I am pleased, however, that the victims are recovering from their physical injuries and that prompt arrests were made in both cases.”\r\n\r\nNo matter how you feel about them, the gay community is no doubt one of the most accepting groups out there. That being said, it would make sense that the incredibly welcoming community would fit right in with Islamic followers and their “religion of peace,” right?\r\n\r\nWrong. Shariah law, the Islamic legal system, states that homosexuality is an abominable form of sexual sin punishable by death.\r\n\r\nMany American Muslims are much less orthodox, accepting society’s moral evolution when it comes to things the Quran explicitly condemns and requires be punished. But in the end, radical Islam and the gay community cannot “co-exist” — which is exactly what Aaron Woods learned, to his sorrow."}