{"top_img": "http://usherald.com/wp-content/uploads/2015/04/post_1428850208.jpg", "text": "With the growing threat of terrorism around the world, and the increased hostilities from both the Soviet Union and North Korea, combined with a sustained and continuous policy of purging our military capabilities Army Chief of Staff Gen. Ray Odierno believes we’ve reached a dangerous and pivotal tipping point.\n\nSpeaking at the AUSA Institute of Land Warfare Global Force Symposium and Exposition in Huntsville, Alabama, the General said; “The Army is only generating enough readiness for immediate consumption, it's incumbent on all of us to understand that further reductions simply will put us into a place we simply cannot go.\"\n\nHowever the continued purging of our military in actuality is only a part of a much wider gap that exists between the administration and those within the military. It began early within the Obama Administration with a fundamental disregard of those military commanders who provided countless strategies and sound advice in how to execute successfully our military objectives, only to be continually rebuffed and ignored, which has given rise to ISIS all across the Middle East and into North Africa. And aside from the president’s astounding incompetence, there’s also an unbridled arrogance that has forcibly ended the military careers of countless officers.\n\nThe General went on to explain; \"Today our nation is facing enormous challenges. I believe we are at a strategic inflection point,\" Odierno said. \"Our nation is facing determined enemies across the globe that have the desire, the capabilities and with increasing capacity to threaten not only our security, but the security of our allies. We continue to witness change in velocity of instability, unforeseen just a few years ago.\"\n\nThe Army has cut 80,000 soldiers out of the active force, reorganized and cut 13 brigade combat teams and three aviation brigades from the active component. Investment in modernization is down by 25%, Odierno said, sidelining \"much-needed\" infantry fighting vehicle modernization and a scout helicopter development program.", "authors": ["Bob Amoroso"], "keywords": [], "meta_data": {"generator": "WordPress 4.8.1", "og": {"site_name": "US Herald", "description": "With the growing threat of terrorism around the world, and the increased hostilities from both the Soviet Union and North Korea, combined with a sustained and continuous policy of purging our military capabilities Army …", "title": "Top Army Chief of Staff General Has Had It With Obama Incompetence ⋆ US Herald", "locale": "en_US", "image": {"width": 640, "identifier": "http://usherald.com/wp-content/uploads/2015/04/post_1428850208.jpg", "height": 360}, "updated_time": "2015-11-09T14:07:15-05:00", "url": "http://usherald.com/top-army-chief-of-staff-general-has-had-it-with-obama-incompetence/", "type": "article"}, "twitter": {"description": "With the growing threat of terrorism around the world, and the increased hostilities from both the Soviet Union and North Korea, combined with a sustained and continuous policy of purging our military capabilities Army […]", "creator": "@usheraldnews", "image": "http://usherald.com/wp-content/uploads/2015/04/post_1428850208.jpg", "title": "Top Army Chief of Staff General Has Had It With Obama Incompetence ⋆ US Herald", "site": "@usheraldnews", "card": "summary_large_image"}, "fb": {"app_id": 211561922608080, "pages": 1746057572287188}, "article": {"publisher": "https://www.facebook.com/unitedstatesherald/", "section": "US NEWS", "published_time": "2015-04-22T10:10:33-05:00", "modified_time": "2015-11-09T14:07:15-05:00"}, "google-site-verification": "ZdE3006b76rd8x4CyNxQi3cdpRirnUjvfut4ZYX-bqY", "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://usherald.com/top-army-chief-of-staff-general-has-had-it-with-obama-incompetence/", "images": ["http://usherald.com/wp-content/uploads/2015/02/usherald-logo.png", "http://usherald.com/wp-content/uploads/2015/04/post_14288502081.jpg", "https://www.facebook.com/tr?id=718459264928386&ev=PixelInitialized", "http://usherald.com/wp-content/uploads/2015/04/post_1428850208.jpg"], "title": "Top Army Chief of Staff General Has Had It With Obama Incompetence ⋆ US Herald", "url": "http://usherald.com/top-army-chief-of-staff-general-has-had-it-with-obama-incompetence?utm_source=aep&utm_medium=generalobamaincompetent&utm_campaign=fbext", "summary": "", "movies": [], "publish_date": {"$date": 1429715433000}, "source": "http://usherald.com"}
