{"title": "REVEALED! Minnesota Mall Attacker ID'd As One Of Hillary's Somali Muslim Refugees", "text": "A man wearing a security uniform entered a mall in St. Cloud, Minnesota on Saturday night. He began shouting Allahu Akbar as he stabbed 9 shoppers.\r\n\r\nThe attacker is reported to have asked at least one victim if they were Muslim before stabbing the person.\r\n\r\nThe attacker has now been identified as Somali immigrant, Dahir Adan, a Muslim.\r\n\r\nDahir Adan\r\nDahir Adan\r\nSt. Cloud Somali-American community members are the ones who identified Adan as the terrorist, reported SC Times.\r\n\r\nOn Sunday ISIS claimed that Adan was one of their own.\r\n\r\nAdan’s terror attack came on the heels of a bomb being detonated at a Marine Corps race in New Jersey, a Muslim man attacking New York police with a meat cleaver, and a bomb exploding in Chelsea, Manhattan that injured 29 civilians on Saturday.\r\n\r\nMembers and officials of the St. Cloud Somali community made a statement expressing support for the terrorist’s family.\r\n\r\nThe Somali officials said that Adan was a good man as far as they knew, and that he was an “accomplished student” in high school (but of course).\r\n\r\n\r\nJason Falconer\r\nOfficer Jason Falconer of the Avon, Minnesota Police Department\r\nSt. Cloud Mayor Dave Kleis reported to the media that Adan was shot and killed by off-duty police officer, Jason Falconer. Kleis called Falconer a hero who “happened to be in the right place at the right time.”\r\n\r\nFalconer approached Adan during the stabbing spree and identified himself as an officer of the law. That’s when Adan lunged at him in an attempt to stab and kill him.\r\nOfficer Falconer then proceeded to send Adan to Allah where he will be greeted by his 72 virgins which surely will turn out to be pigs.\r\n\r\nLast year the Washington Times reported that Obama’s administration had relocated almost 10-thousand Somali refugees to Minnesota.\r\n\r\nThe Times went on to say that Somalis are targeted by terror groups such as ISIS for recruitment, and that one organization warned of attacks on American malls.\r\n\r\n“THIS POPULATION IS ALSO BEING TARGETED BY ISLAMIST TERROR ORGANIZATIONS LIKE THE ISLAMIC STATE AND AL-SHABAB, A SOMALIA-BASED GROUP WITH LINKS TO AL QAEDA, ACCORDING TO U.S. OFFICIALS.”\r\n\r\n“AMONG MINNESOTA-BASED SOMALI-AMERICANS, AMERICAN CONVERTS TO ISLAM OR SOMALI REFUGEES, THERE HAVE BEEN NUMEROUS CONVICTIONS FOR VARIOUS LEVELS OF COLLABORATION WITH ISLAMIST TERROR GROUPS, PLUS REPORTS OF FIGHTING WITH AL-SHABAB OR OTHER ISLAMIST GROUPS.”\r\n\r\n“AL-SHABAB MADE A PROPAGANDA VIDEO WARNING OF AN ATTACK ON SHOPPING MALLS AROUND THE WORLD, INCLUDING THE MALL OF AMERICA IN MINNESOTA. AL-SHABAB CLAIMED RESPONSIBILITY FOR THE TERROR ATTACK ON THE WESTGATE SHOPPING MALL IN KENYA TWO YEARS AGO, WHICH LEFT 67 DEAD.”\r\n\r\nIn July of this year, World Net Daily reported that Somali refugees in Minnesota regularly threaten women there with kidnapping and rape.\r\n\r\nIn May, Voice of America News reported that ISIS has steadily grown stronger in Somalia, and that the terror organization is now a major threat.\r\n\r\n“PRO-ISLAMIC STATE SOMALI MILITANTS HAVE GROWN IN NUMBERS AND ARE RECEIVING FINANCIAL AND MILITARY SUPPORT FROM YEMEN, A TOP INTELLIGENCE OFFICIAL TOLD THE VOA SOMALI SERVICE.”\r\n\r\n“HE SAID ISLAMIC STATE HAS WELCOMED ITS SOMALIA BRANCH AND HAS STARTED DELIVERING SUPPLIES THROUGH THEIR AFFILIATE FACTION IN YEMEN.”\r\n\r\n“THEY RECEIVED MILITARY SUPPLIES FROM YEMEN – WEAPONS, UNIFORM, ISIS SENT TRAINERS WHO INSPECTED THEIR BASES, AND THEY HAVE STARTED SENDING FINANCIAL SUPPORT,” HE SAID.\r\n\r\nIn June, three Somalians living in Minnesota were convicted of trying to join ISIS.\r\n\r\nIn July, the Somali terror group al-Shabab was approached by ISIS officials in an attempt tojoin forces to attack America.\r\n\r\nDepartment of Homeland Security documents show that while Hillary Clinton served as Secretary of State, over 31,000 Somali refugees were relocated to the United States.\r\n\r\nU.S. issued green cards to migrants from Muslim nations over the last 5 Years\r\n\r\nIf Hillary is elected, she plans on increasing the number of Muslim refugees from Syria alone by over 500%.\r\n\r\nBreitbart News reported that under a Clinton administration, the total number of Muslim refugees from all countries could top 1 million in her first term alone.\r\n\r\nIt’s clear that Muslim immigrants and refugees are being targeted for recruitment by ISIS and other terror groups. It’s clear the damage they can do as we saw last weekend with the stabbing attack in Minnesota.\r\n\r\nMen & women, minding their own business, had their faces slashed open, and were stabbed repeatedly by a single ISIS convert. And Hillary Clinton wants to import hundreds of thousands more of these potential terrorist scum.\r\n\r\nHillary cannot be allowed to become president. Under her rule, terror attacks on U.S. citizens will increase exponentially. All because she and the DNC want to pander to Islamists in the hope that they will vote Democratic, and that their party will continue to rule.\r\n\r\nA vote for Hillary is a vote for ISIS and other terror groups who are hell bent on killing American men, women, and children.\r\n\r\nDon’t vote for ISIS Hillary on November 8th. Vote Trump to Keep America Safe, and to send these terrorist pieces of sh-t back to Allah where they belong.\r\n\r\nSelah.\r\n\r\nFrom Freedom Daily"}