{"top_img": "https://ihavethetruth.com/wp-content/uploads/2016/03/029-pork-ban-940.png", "text": "America needs to get with the program when it comes to immigration. Yes, we are “a nation of immigrants,” the proverbial “melting pot.” More importantly we are UNITED STATES of AMERICA.\n\nThere should be no more of this each to their own garbage when it comes to how immigrants want to live their lives. If they want to stick with their own programs then they should have stayed put in their countries of origin.\n\n(Via JewsNews) Quebec mayor gives Muslim ‘refugees’ a little piece of his mind by spilling the truth that Canadians don’t adapt to them, it’s the other way around.\n\n” MUSLIMS MUST UNDERSTAND THAT THEY MUST ADAPT TO CANADA, ITS CUSTOMS, ITS TRADITIONS, ITS WAY OF LIFE, BECAUSE IT WAS THE COUNTRY THAT WAS CHOSEN TO EMIGRATE. YOU HAVE TO UNDERSTAND THAT THEY ARE THE ONES THAT THEY MUST INTEGRATE AND LEARN TO LIVE IN CANADA. NEED TO UNDERSTAND THAT THEY HAVE TO BE FOR THEM TO CHANGE THEIR LIFESTYLE, NOT THE CANADIANS WHO SO GENEROUSLY WELCOMED THEM. YOU MUST UNDERSTAND THAT CANADIANS ARE NOT RACIST OR XENOPHOBIC. WE ACCEPT MANY IMMIGRANTS, IN MANY COUNTRIES WITH DIFFERENT CULTURES AND RELIGIONS, CONTRADICTING TO MANY MUSLIM COUNTRIES WHICH DO NOT ACCEPT IMMIGRANTS NON-MUSLIMS. FOR THIS REASON, THE CANADIANS ARE NOT WILLING TO GIVE UP THEIR IDENTITY AND THEIR CULTURE. FINALLY, THEY HAVE TO UNDERSTAND THAT IN CANADA, WITH ITS JUDEO-CHRISTIAN ROOTS, CHRISTMAS TREES, CHURCHES AND RELIGIOUS FESTIVALS, RELIGION MUST REMAIN IN THE PRIVATE SPHERE. THE MUNICIPALITY OF DURVAL HAS THE RIGHT TO REFUSE ANY CONCESSIONS TO ISLAM AND SHARIA LAW. FOR MUSLIMS, WHO ARE NOT IN AGREEMENT WITH THE CANADIAN CULTURE AND RELIGION AND DO NOT FEEL COMFORTABLE IN CANADA, THERE ARE 57 BEAUTIFUL MUSLIM COUNTRIES IN THE WORLD, MOST OF THEM UNDER-POPULATED AND READY TO RECEIVE THEM WITH OPEN ARMS, IN ACCORDANCE WITH SHARIA LAW. IF YOU LEFT HIS COUNTRY TO COME TO CANADA, AND NOT TO A MUSLIM COUNTRY, IT IS BECAUSE YOU HAVE CONSIDERED THAT LIFE IS BETTER IN CANADA THAN IN OTHER PLACES. HELP YOURSELF TO THE QUESTION, JUST ONCE: WHY IS IT BETTER HERE IN CANADA THAT WHERE IT COMES FROM.\n\nIt boggles my mind that many feel that they have the right or the authority to control other peoples lives. This is the direct opposite of what we feel as humans.\n\nWhile most Americans are perplexed as to how a foreign entity could trump American law on our own sovereign soil, Texas isn’t waiting for the courts to intervene on the issue, but rather pass immediate legislation baring any attempt to institute Sharia law within the American Judicial System\n\nBecause Muslims cannot eat a particular meal, should mean they should bring their own. The few should never out weigh the many, especially when it comes to adopted culture. Adopt it, or don’t. Just do block others from it. Boom. There it is. AND, that is the philosophy we ought to have.\n\nIntegrate or Vacate, but don’t try to change us. You will fail.", "authors": ["Scott Osborn", "Terresa Monroe-hamilton", "Mr Wendal", "Max Jackson"], "keywords": [], "meta_data": {"description": "America needs to get with the program when it comes to immigration. Yes, we are “a nation of immigrants,” not cultures or refugees", "og": {"site_name": "I Have The Truth", "description": "America needs to get with the program when it comes to immigration. Yes, we are “a nation of immigrants,” not cultures or refugees", "title": "Mayor TELLS Muslim Refugees: ‘We Don’t Adapt To Your Culture, You Adapt To Ours’", "locale": "en_US", "image": {"width": 940, "identifier": "https://ihavethetruth.com/wp-content/uploads/2016/03/029-pork-ban-940.png", "height": 500}, "updated_time": "2017-07-02T14:25:26-07:00", "url": "https://ihavethetruth.com/2017/07/01/mayor-tells-muslim-refugees-we-dont-adapt-to-your-culture/", "type": "article"}, "twitter": {"image": "https://ihavethetruth.com/wp-content/uploads/2016/03/029-pork-ban-940.png", "description": "America needs to get with the program when it comes to immigration. Yes, we are “a nation of immigrants,” not cultures or refugees", "card": "summary", "title": "Mayor TELLS Muslim Refugees: ‘We Don’t Adapt To Your Culture, You Adapt To Ours’"}, "robots": "noodp", "DC.date.issued": "2017-07-01T12:39:31-07:00", "article": {"publisher": "https://www.facebook.com/RLC4CommonSense/", "section": "culture", "published_time": "2017-07-01T12:39:31-07:00", "modified_time": "2017-07-02T14:25:26-07:00"}, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0, user-scalable=no"}, "canonical_link": "//ihavethetruth.com/2017/07/01/mayor-tells-muslim-refugees-we-dont-adapt-to-your-culture/", "images": ["https://ihavethetruth.com/wp-content/themes/braxton/images/search-icon.png", "https://secure.gravatar.com/avatar/30ee4506413ae035f4283dc80b6a3892?s=46&r=pg", "https://ihavethetruth.com/wp-content/uploads/2017/08/springfield-illinois-il-capitol-building-ap-photo-640x480-400x242.jpg", "https://secure.gravatar.com/avatar/abf9521a5ba0a458cbe557adcd75d689?s=100&r=pg", "https://ihavethetruth.com/wp-content/uploads/2017/04/IHTTlogoclean1.jpg", "https://ihavethetruth.com/wp-content/uploads/2017/08/Church-400x242.jpg", "https://ihavethetruth.com/wp-content/uploads/2017/08/Hunks-400x242.jpg", "https://ihavethetruth.com/wp-content/uploads/2016/03/quebec-mayor.jpg", "https://ihavethetruth.com/wp-content/uploads/2017/08/o-LOUIS-FARRAKHAN-SON-POLICE-INVESTIGATION-facebook-400x242.jpg", "https://ihavethetruth.com/wp-content/uploads/2016/03/029-pork-ban-940.png"], "title": "‘We Don’t Adapt To Your Culture, You Adapt To Ours’", "url": "https://ihavethetruth.com/2016/03/27/162167/", "summary": "", "movies": [], "publish_date": {"$date": 1459036800000}, "source": "https://ihavethetruth.com"}
