{"top_img": "http://eaglerising.com/wp-content/uploads/2016/09/hillary-clinton-1.jpg", "text": "I can’t wait for “Weekend at Chelsea’s” to hit the big screen. CNN and the rest of Hillary Clinton’s slobbering media sycophants have already written the script. If this woman, God forbid, dropped dead on the sidewalk tomorrow, these doting suck-ups – these mass media strumpets whose voter trust has, understandably, reached an all-time low – would dutifully parrot the Clinton campaign talking points and call it a “minor setback” to her “inevitable” victory.\n\nThe American people aren’t buying it. This is a severely ill woman. No more “conspiracy theory” dismissals. Mrs. Clinton’s “mild cold,” er, “seasonal allergies,” I mean “heat exhaustion,” that is to say “minor case of pneumonia” is, evidently, of the rare kind that requires a permanent traveling physician and a “mystery man” who rushes to her side whenever she has one of her frequent and uncontrollable “episodes” (or otherwise freezes up with a brain “short-circuit” during a speech).\n\nThis guy has been spotted with the Clintons during medical emergencies going back to 2003 when Hillary suffered a brain blood clot (also covered up) and carries in hand what many medical experts say is a Diazepam pen. Diazepam is an intravenous drug used to treat seizures.\n\nBlue tinted glasses of the sort Mrs. Clinton was wearing Sunday when she collapsed are also worn by patients who suffer seizures. These therapeutic specs are likewise used to relieve symptoms of Parkinson’s disease – a neurological disorder from which a number of doctors indicate Mrs. Clinton likely suffers (since when has “pneumonia” required a neurological squeeze test?).\n\nThe Clinton campaign needs to come clean. They won’t, but they should. I wonder what official “diagnosis” we’ll get the next time she seizes up and collapses into the arms of eerily calm Secret Service agents acting as though they’ve been there a hundred times before. “Nothing to see here, folks. Secretary Clinton’s sciatica is just acting up a bit from the 30 miles she ‘powered through’ yesterday going door-to-door.”\n\nThe point is that, once more, by lying about illness Mrs. Clinton has reinforced (and justified) concerns about both her physical and moral fitness to serve as president. She’s proven, yet again, that she can’t be trusted. She has confirmed a number of pre-conceptions that voters, as revealed by her historically low approval ratings, have formed relative to her health and character. She’s a liar. That’s her default mode. She’s corrupt. And she’s sick. Very sick. She puts her own personal political ambition and lust for power above all else – including the best interests of the nation, and even her own life.\n\nDo I take joy in Mrs. Clinton’s sufferings and plummeting poll numbers? Well, no on the first, yes on the second. “Do not gloat when your enemy falls; when they stumble, do not let your heart rejoice” (Proverbs 24:17).\n\nIndeed, Mrs. Clinton has had a very bad week, but her poll numbers were already trending downward. Her medical crisis over the weekend, coupled with her stepping in it by smearing half of Donald Trump’s supporters as a “racist” and “irredeemable” “basket of deplorables,” has only served to accelerate the plunge.\n\nPerhaps this is because of the glaring hypocrisy associated with such a statement – especially by this particular woman. This is the same Hillary Clinton who once called the late Sen. Robert Byrd, D-W.Va., her “friend and mentor.” Sen. Byrd, of course, was a recruiter for the actually deplorable KKK. This is the same Hillary Clinton whose husband, former president Bill Clinton, was caught jokingin 2008 that President Obama should be carrying his bags – the same woman whose Democratic Party opposed the 1964 Civil Rights Act while Republicans, not unlike those she just slandered, worked hard to pass it. Finally, and going back a bit further, this is the same Hillary Clinton whose party fought a war to maintain slavery in the U.S. while hundreds-of-thousands of Republicans gave up their lives to free them.\n\nWho’s the racist?\n\nI’m praying for Hillary Clinton. Despite what her campaign and worshipful media disciples are peddling, and notwithstanding her being caught in lie after lie, our eyes have been telling us the truth for months, maybe even years now. To watch this increasingly frail, bitter and elderly woman stiffen up, convulse and collapse into the arms of well-practiced staffers is hard to stomach. You can’t help but feel some modicum of compassion for her, wicked though she may be.\n\nIt’s almost tragic to witness. Hillary Clinton has lived her entire life for this moment. Everything she’s ever done or said, and the mounding piles of lecherous BS she’s put up with from her sexually predatory partner-in-crime, has been designed to place her in the Oval Office, not as first lady, but as president of the United States. Proverbs 19:21 says, “Many are the plans in a person’s heart, but it is the LORD’s purpose that prevails.”\n\nAm I saying there’s no chance Hillary Clinton will win? Not at all, though I think it unlikely. Between her devoted media harpies, her team of around-the-clock doctors and a campaign staff well versed in the practice of propaganda and cover-up, there’s always a chance they might just literally carry her over the finish line to victory.\n\nStill, it remains my humble prayer that this past week signals the beginning of the end for Hillary Clinton’s political aspirations. Even so, I also pray she might live a long and healthy life in the private sector – a life with plenty of time to bounce cute little grandkids on her knee.\n\nWhen they visit her in prison.\n\nThe views expressed in this opinion article are solely those of their author and are not necessarily either shared or endorsed by EagleRising.com", "authors": ["View All Posts", "Matt Barber"], "keywords": [], "meta_data": {"description": "Am I saying there’s no chance Hillary Clinton will win? Not at all, though I think it unlikely.", "og": {"site_name": "Eagle Rising", "description": "Am I saying there’s no chance Hillary Clinton will win? Not at all, though I think it unlikely.", "title": "Is it the Beginning of the End for Hillary Clinton?", "locale": "en_US", "image": "http://eaglerising.com/wp-content/uploads/2016/09/hillary-clinton-1.jpg", "updated_time": "2016-09-21T11:14:04+00:00", "url": "http://eaglerising.com/36912/is-it-the-beginning-of-the-end-for-hillary-clinton/", "type": "article"}, "robots": "noimageindex", "fb": {"app_id": 256195528075351, "pages": 135665053303678}, "article": {"section": "2016 Election", "tag": "Hillary Clinton", "published_time": "2016-09-21T07:50:40+00:00", "modified_time": "2016-09-21T11:14:04+00:00"}, "viewport": "initial-scale=1,maximum-scale=1,user-scalable=no", "googlebot": "noimageindex"}, "canonical_link": "http://eaglerising.com/36912/is-it-the-beginning-of-the-end-for-hillary-clinton/", "images": ["http://constitution.com/wp-content/uploads/2017/08/confederatemonument_poll_pop.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/hillary-clinton-1-800x300.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/03/eagle-rising-logo3-1.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46729-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46764-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46731-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46745-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/george-h.w.-bush-375x195.jpg", "http://pixel.quantserve.com/pixel/p-52ePUfP6_NxQ_.gif", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46654-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2017/04/crtv_300x250_1.jpg", "http://eaglerising.com/wp-content/uploads/2016/09/hillary-clinton-1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=22315475&cv=2.0&cj=1", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46750-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/03/Matt-Barber-144x144.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46612-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46761-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46642-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46735-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46755-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46752-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46748-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46715-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46743-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46712-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46757-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/sombreros-375x195.jpg"], "title": "Is it the Beginning of the End for Hillary Clinton? – Eagle Rising", "url": "http://eaglerising.com/36912/is-it-the-beginning-of-the-end-for-hillary-clinton/", "summary": "", "movies": [], "publish_date": {"$date": 1474444240000}, "source": "http://eaglerising.com"}
