{"top_img": "http://eaglerising.com/wp-content/uploads/2016/09/aids.jpg", "text": "Former President Bill Clinton and his Clinton Health Access Initiative (CHAI) distributed “watered-down” HIV/AIDs drugs to patients in sub-Saharan Africa, and “likely increased” the risks of morbidity and mortality, according to a draft congressional report obtained by The Daily Caller News Foundation.\n\nThe congressional report, titled,“The Clinton Foundation and The India Success Story,” was initiated by Rep. Marsha Blackburn, a Tennessee Republican and vice-chair of the House Energy and Commerce Committee.\n\nThe CHAI program to help AIDS victims is considered one of the Clinton Foundation’s most important contributions and is probably its best known initiative.\n\nThe congressional report focused on Clinton’s decade-long relationship with a controversial Indian drug manufacturer called Ranbaxy, which CHAI used as one of its main distributors of HIV/AIDS drugs to Third World countries.\n\nIt also highlighted the work of Dinesh Thakur, a former Ranbaxy employee who became a star whistleblower and permitted the U.S. government to launch a landmark lawsuit against the Indian firm. The company was vulnerable to U.S. prosecution because it also sold its generic drugs on the U.S. market.\n\nRanbaxy ultimately pleaded guilty in 2013 to seven criminal counts with intent to defraud and the introduction of adulterated drugs into interstate commerce.\n\nThe Department of Justice further levied a $500 million fine and forfeiture on the company.\n\n“This is the largest false claims case ever prosecuted in the District of Maryland, and the nation’s largest financial penalty paid by a generic pharmaceutical company,” said U.S. Attorney for the District of Maryland Rod J. Rosenstein when Ranbaxy pleaded guilty.\n\n“When companies sell adulterated drugs, they undermine the integrity of the FDA’s approval process and may cause patients to take drugs that are substandard, ineffective, or unsafe,” said Stuart F. Delery, acting assistant attorney general for the civil division of the Department of Justice, when the government announced its action against the Indian company.\n\nThe Department of Justice stated in its final settlement, “alleged due to the company’s diluted drugs, it ‘subjected patients to increased risks of morbidity and mortality,’” according to the report.\n\n“The question becomes, ‘how many people lost their lives, how many people found it was a false promise,’” asked Blackburn in an interview with TheDCNF.\n\nThe possibility that CHAI distributed adulterated and diluted AIDS drugs to Third World victims could shake the foundations of the Clinton charity and spark a new round of scrutiny in the final weeks of presidential candidate Hillary Clinton’s campaign.\n\nBlackburn said she delivered the report to the inspector generals at the Department of Health and Human Services and to the Department of State, where Hillary served as secretary of state during President Barack Obama’s first term.\n\nThe congressional study also highlighted the unseemly ties between Bill and two controversial Indian-Americans who have been investigated and sanctioned by the Food and Drug Administration (FDA) and the Securities and Exchange Commission.\n\nThe most troubling revelations concern the Clinton Foundation’s vigorous promotion of Ranbaxy despite mounting evidence the Indian firm had persistently poor quality control and attempted to cover it up through either faulty or fraudulent reporting to the FDA.\n\nIt is unclear at this juncture how many AIDS patients received the “watered-down” drugs.\n\nProPublica estimated that in 2007 alone, the U.S. Agency for International Development allocated $9 million to Ranbaxy and delivered “more than $1.8 million packages.”\n\n“Substandard HIV medicines cause health problems for patients, perhaps even accelerating death from HIV-related infections,” Roger Bate, an economist at the American Enterprise Institute who researches substandard and counterfeit medicines, told TheDCNF.\n\nThakur told TheDCNF that many of the company’s anti-retroviral drugs were used to stabilize platelet and white blood cell counts in AIDS patients.\n\n“These drugs allow it to stabilize and essentially provide immunity to patients. If the content of the medicine is not what is listed on the label, you will not see the platelet levels or the WBC levels stabilize,” he said.\n\nRanbaxy’s first public hint of problems occurred in August 2004, one year after CHAI began working with the firm. The World Health Organization reported irregularities involving three Ranbaxy drugs in South Africa, according to the report.\n\nThe FDA sent a public “warning letter” to Ranbaxy in 2006 about reported irregularities in the company’s quality control efforts. It concluded that the drugs, which included anti-retroviral HIV/AIDs medications, “show much lower potencies in these batches.”\n\nAlthough Ranbaxy’s generic drugs are now barred from being sold in the U.S., CHAI and the former president continue to praise Ranbaxy and distribute the company’s HIV/AID drugs to patients abroad.\n\nBill heaped praise on Ranbaxy in 2013 during a speech in Mumbai, saying, the drugs saved millions of lives.\n\nNeither CHAI nor the Clinton Foundation have announced they severed ties with Ranbaxy.\n\nThakur said he’s now a public health activist who tries to get global health charities to focus on the quality of drugs rather than simply on “access” to patients.\n\nThe whistleblower tried to meet with CHAI and Clinton Foundation officials, but was only met with silence. “I have tried to reach out to them,” he told TheDCNF. “But I haven’t had a great amount of success with the Clinton Foundation.”\n\nCHAI was a part of the Clinton Foundation until 2010, when it spun off into a separate entity. The groups still have some overlapping board members and staff, and they continue to operate in close coordination. Bill Clinton, for example, is deeply involved with both organizations.\n\nCharles Ortel, a Wall Street analyst who has been an outspoken critic of the legal missteps by the Clinton Foundation, claims their separation was “deeply suspect.”\n\n“In the application, trustees of the new entity, including Bill Clinton, falsely claim the entity is not a successor to previous efforts. This is not true. They purposefully obscure the fact that a similar operation called ‘CHAI’ was by far the largest piece of the original Foundation,” Ortel told TheDCNF.\n\nThe congressional study suggests Bill may have relaxed quality standards in a 2000 executive order.\n\nHe signed an executive order that, “relaxed intellectual property policy standards,” promising the U.S. government “would not revoke or revise the intellectual property laws of any ‘Sub-Saharan country’ relating to HIV/AIDS medicines or technologies,” the report states.\n\nCHAI announced in October 2003 it was going to distribute generic, low-cost HIV drugs from four foreign drug manufacturers: Ranbaxy; Cipla of Mumbai, India; Matrix Labs of Hydrabad, India; Aspen Pharmacare of Johannesburg, South Africa.\n\nCHAI’s endorsement also allowed Ranbaxy to manufacture HIV drugs that would be bought by the U.S. government under the President’s Emergency Plan for AIDS relief — a $15 billion initiative proposed by former President George W. Bush.\n\nThe flow of U.S. funds combined with Clinton’s endorsement allowed the four foreign drug manufactures to become “good acquisition targets,” according to the study.\n\nRanbaxy filed 10 abbreviated new drug applications, three of which were approved by the FDA, according to the congressional study. Eventually, the firm would produce 13 generic HIV drugs.\n\nThe companies enjoyed great financial profits and they “exploded as they partnered with the Foundation for several years,” the report states.\n\nThe study also examined the key players in the Clinton-CHAI orbit, the potential for corruption and how the program ultimately benefited the Clinton Foundation in terms of donor contributions.\n\nOne relationship unearthed by the report was the American Indian Foundation, which Clinton co-founded with Indian-American businessmen Rajat Gupta and Vinod Gupta in 2001.\n\nRajat was convicted of insider trading in 2012 in a sensational trial.\n\nVinod eventually was forced to resign as CEO and chairman of the company InfoGroup and was fined $9 million in a Securities and Exchange Commission investigation. One of the charges stated Vinod had awarded Bill $3.3 million without board approval.\n\nBlackburn says the worst part of the story were the “false hopes” offered by the Clinton Foundation.\n\n“You think about the emotional state of health care workers as they are dealing with these individuals and the emotional state of the patients. To me it’s disturbing and very sad,” she said.\n\nThe views expressed in this opinion article are solely those of their author and are not necessarily either shared or endorsed by EagleRising.com", "authors": ["View All Posts"], "keywords": [], "meta_data": {"description": "The possibility that CHAI distributed adulterated and diluted AIDS drugs to Third World victims could shake the foundations of the Clinton charity.", "og": {"site_name": "Eagle Rising", "description": "The possibility that CHAI distributed adulterated and diluted AIDS drugs to Third World victims could shake the foundations of the Clinton charity.", "title": "Charity: Clinton Foundation Distributed \"Watered-Down\" AIDS Drugs to Sub-Saharan Africa", "locale": "en_US", "image": "http://eaglerising.com/wp-content/uploads/2016/09/aids.jpg", "updated_time": "2016-09-21T00:50:12+00:00", "url": "http://eaglerising.com/36899/charity-clinton-foundation-distributed-watered-down-aids-drugs-to-sub-saharan-africa/", "type": "article"}, "robots": "noimageindex", "fb": {"app_id": 256195528075351, "pages": 135665053303678}, "article": {"section": "2016 Election", "published_time": "2016-09-21T00:08:41+00:00", "modified_time": "2016-09-21T00:50:12+00:00"}, "viewport": "initial-scale=1,maximum-scale=1,user-scalable=no", "googlebot": "noimageindex"}, "canonical_link": "http://eaglerising.com/36899/charity-clinton-foundation-distributed-watered-down-aids-drugs-to-sub-saharan-africa/", "images": ["http://constitution.com/wp-content/uploads/2017/08/confederatemonument_poll_pop.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/aids-800x300.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/03/eagle-rising-logo3-1.png", "http://0.gravatar.com/avatar/38fd948afacd35c41436d914b472ef38?s=112&d=mm&r=g", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46729-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46731-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46745-featured-300x130.jpg", "http://pixel.quantserve.com/pixel/p-52ePUfP6_NxQ_.gif", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46654-featured-300x130.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=22315475&cv=2.0&cj=1", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/counter-terrorism-375x195.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2017/04/crtv_300x600_1.jpg", "http://eaglerising.com/wp-content/uploads/2016/09/aids.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46750-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46612-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46761-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46642-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46735-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46755-featured-300x130.jpg", "http://0.gravatar.com/avatar/38fd948afacd35c41436d914b472ef38?s=100&d=mm&r=g", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46752-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46748-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46715-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46743-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46737-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46712-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46757-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/isis-1-375x195.jpg"], "title": "Charity: Clinton Foundation Distributed “Watered-Down” AIDS Drugs to Sub-Saharan Africa – Eagle Rising", "url": "http://eaglerising.com/36899/charity-clinton-foundation-distributed-watered-down-aids-drugs-to-sub-saharan-africa/", "summary": "", "movies": [], "publish_date": {"$date": 1474416521000}, "source": "http://eaglerising.com"}
