{"title": "Hillary Denies She and Obama Founded ISIS…Then This Video Shows Up", "text": "It was late one night in the White House when Obama first came up with the idea for ISIS. He hadn’t been sleeping well. Michelle told him to take some deep breaths, have some hot milk, and rewatch Princess Bride, but he’d made it all the way to the Billy Crystal scene, and he was out of milk, and Michelle had started snoring. The snoring was loud and nasty and kind of wet-sounding, like a broken boat was giving birth to another boat. He had to get out of there.\r\n\r\nFirst, he headed down to the Oval Office and tried to sleep on the couch, but it wasn’t long enough for his legs, and it smelled like generals’ butts. For a long time, he just wandered around the West Wing alone. He was sad and tired and had the nervous feeling that he was doing something he shouldn’t. He peeked into people’s desk drawers and found pictures of cats and dogs and babies. He was thinking about stealing a Kind bar off one of his interns’ desks, when suddenly a word appeared to him: ISIS. He grabbed a Post-It note and wrote it down. What was it? What did it mean?\r\n\r\nIt wasn’t until months later, at Coachella, that the idea started to take shape. Obama loved electronic music — the beats, the lights, the DJs, the wonderful fans — and every year, for just one day, the Secret Service allowed him to go to the music festival. They would hang back, and he would wear sunglasses, a flower crown, a neon tank top, and a tight European-style bathing suit and just dance. The people who did recognize him were too drunk and high to convince anyone of what they’d seen. (“Hey, bro, it’s the president!” “Yeah, bro!”) The president would block it all out and surrender to the thumping, sick beat. He had done a tiny bit of molly with a French Canadian woman named Bonjour when the word “ISIS” came back to him. Ever since he was a little boy, he had wanted to start an international terrorist organization of his own. He’d just never had the right idea. People had been starting terrorist groups for years, and he knew that if he wanted to break into the market, he needed some big new shtick. Wait. Of course. He went into his wallet and dug out the crumpled Post-It note. Yes. He would be the first American president to start an international terrorist organization, and it would be called ISIS. Bonjour was naked now, trying to bend a glow stick around one of her breasts. He gave her his flower crown, got in an Uber, and drove straight back to Washington. By the time he got home, he had a plan.\r\n\r\nAt first it was difficult to get people to believe he wasn’t kidding. “I want to be the founder of a new terrorist group,” he’d tell them. They’d laugh and say something like, “Hey, Mr. President, please don’t ever say that again publicly!” Obama felt like one of the characters trying to start a luxury denim business on the HBO show How to Make It in America. Then, finally, he decided the only person who could really help him was Hillary.\r\n\r\nThey were down in the kitchen one night eating Popsicles and staring into each other’s eyes when he asked if he could tell her a secret. Hillary laughed and said, “Is it about how you’re really a terrorist?” He looked at her and said, “Yes, actually.” She stopped eating her Popsicle. “Donald Trump was right about you?” He nodded. “About everything.”\r\n\r\nHe explained that he had actually been born in Kenya in 1919, and that he was 97 years old. He’d made an American birth certificate out of simple graph paper and aged it with tea bags. (“Honestly, it took me, like, 20 minutes.”) He explained that his parents told him from an early age that he should grow up to become the president of the United States so that he could eventually destroy the country from the inside.\r\n\r\n“Isn’t that the plot of the first season of Homeland?” Hillary asked. Obama nodded. “Kind of. Also a little bit of The Americans.”\r\n\r\nNo one had come close to guessing his secret, until Donald Trump. He didn’t know what had given it away. He’d been so careful. Had Donald Trump figured out the secret messages he was sending through his Portuguese water dog, Bo? “Wait, what?” Hillary asked. She was starting to freak out. Obama explained that Bo was actually a supercomputer programmed to bark out messages in Morse code to terrorist organizations around the world, and he thought there was a chance that Donald Trump had seen that Bo’s eyes were really tiny LED screens. “Did you know that when Bo barks,” Obama said, “he’s just repeating the word dog over and over again in a robot voice?”\r\n\r\nHillary was quiet for a long time. She had stopped eating her Popsicle, and the whole thing had just melted away. Now her fingers were stuck together, and it looked like she had one weird fish-hand. When she finally spoke, it was almost a whisper. “You’re a 97-year-old Kenyan Muslim man who was sent here by your ancestors to destroy America?” Obama nodded. Hillary made a strange sound and cried out, “I feel like I’m short-circuiting!” Obama did his best to comfort her. “Bo does that sometimes. Then he’ll go outside and poop out a printer cartridge.”\r\n\r\nHillary was breathing hard. She walked the length of the kitchen, then walked the width of the kitchen, and then surprised herself by doing the first tumbling pass in Aly Raisman’s floor routine. Obama knew it was dangerous to tell someone his secrets, but it was such a relief. He felt light and loose. He felt 87 again. He took her hands into his. “I’m sorry my fingers are stuck together like a fish-hand,” Hillary apologized. “Do you mean a fin?” Obama asked. They both chuckled with their mouths closed. Hillary told him that she would probably need more time to process everything. Then he leaned down and said in a soft, strong voice: “But I haven’t even told you the best part yet. I’m going to start my own terrorist group and call it ISIS.”\r\n\r\n“Isis?”\r\n\r\n“No, ISIS. All caps.”\r\n\r\nHillary and Obama talked for hours that night. When they got tired of the kitchen, they moved outside to the Rose Garden with a six-pack, a joint, and, like, a ton of cheese. They lay with their backs on the wet grass and looked up into the hazy Washington sky as Obama told her everything he imagined for the new terrorist group, and she listened and laughed and gradually finished the beer. When she felt sleepy, she put her head just inside one of his arms, closed her eyes, and let the sound of his plans to annihilate the Western world wash over her like the hot summer air. She interrupted him once to point out how weird roses look at night. He said he didn’t want to talk about that and told her, in a cool way, to stop smoking all the weed. She interrupted again to show him that she could eat cheese and take a hit at the same time, but he was not as impressed as she thought he’d be. He told her “like for real” they had to focus right now on starting a terrorist group, and she laughed for what felt like an hour and 45 minutes.\r\n\r\nHe was starting to regret telling her about ISIS, when suddenly she sat up, looked him right in the eye, and said, “We’ll wait until I’m president, and then we will secretly destroy America together.” Her words shot through him. His heart was beating fast. That was it. That was the plan he had been waiting for, and it was beautiful. In the dim light, he could see dirt sticking to her face where the Popsicle had been. She looked scary, like Jodie Foster in Nell. A weirdly big piece of cheese fell out of her hair. He couldn’t stop smiling. For the first time in his life, he felt completely understood. They put their heads back in the grass, and he tried to remember the lyrics to “Wonderwall” as she secretly ate the cheese that had been in her hair. Pretty soon, it was morning again."}