{"top_img": "http://rightwingnews.com/wp-content/uploads/2016/09/Clinton-5-e1474464820329.jpg", "text": "New Clinton Foundation SCANDAL Just Broke – This Is What Hillary ACTUALLY Thinks About Black People…\n\nThis is just criminal and it is no surprise it involves the Clinton Health Access Initiative. Anything with ‘Clinton’ in it has to be corrupt, but this resulted in the deaths of many, many Africans. They distributed “watered-down” HIV/AIDs drugs to patients, virtually sentencing them to death. An Indian drug manufacturer called Ranbaxy was behind this… the question is, did the Clintons know about it. I’m betting that they did.\n\nRanbaxy was eventually found guilty in 2013 on seven counts with intent to defraud and the introduction of adulterated drugs into interstate commerce. The DOJ also levied a $500 million fine and forfeiture against the company. So, one wonders why the Clintons were not also looked into and questioned on all of this.\n\n“This is the largest false claims case ever prosecuted in the District of Maryland, and the nation’s largest financial penalty paid by a generic pharmaceutical company,” said US Attorney for the District of Maryland Rod J. Rosenstein when Ranbaxy pleaded guilty.\n\nFrom The Daily Caller:\n\nFormer President Bill Clinton and his Clinton Health Access Initiative (CHAI) distributed “watered-down” HIV/AIDs drugs to patients in sub-Saharan Africa, and “likely increased” the risks of morbidity and mortality, according to a draft congressional report obtained by The Daily Caller News Foundation. The congressional report, titled,“The Clinton Foundation and The India Success Story,” was initiated by Rep. Marsha Blackburn, a Tennessee Republican and vice-chair of the House Energy and Commerce Committee. The CHAI program to help AIDS victims is considered one of the Clinton Foundation’s most important contributions and is probably its best known initiative. × 101 Things All Young Adults Should Know by Sir John Hawkins John Hawkins's book 101 Things All Young Adults Should Know is filled with lessons that newly minted adults need in order to get the most out of life. Gleaned from a lifetime of trial, error, and writing it down, Hawkins provides advice everyone can benefit from in short, digestible chapters. Buy Now The congressional report focused on Clinton’s decade-long relationship with a controversial Indian drug manufacturer called Ranbaxy, which CHAI used as one of its main distributors of HIV/AIDS drugs to Third World countries. It also highlighted the work of Dinesh Thakur, a former Ranbaxy employee who became a star whistleblower, permitting the U.S. government to launch a landmark lawsuit against the Indian firm. The company was vulnerable to U.S. prosecution because it also sold its generic drugs on the U.S. market. Ranbaxy ultimately pleaded guilty in 2013 to seven criminal counts with intent to defraud and the introduction of adulterated drugs into interstate commerce.\n\n“The question becomes, ‘how many people lost their lives, how many people found it was a false promise,’” asked Blackburn in an interview with the DCNF.\n\nThis could definitely bring further scrutiny to the Clinton charities and to the Clintons themselves. Right when they need it least. A congressional study has uncovered inappropriate ties between Bill Clinton and the two Indian-Americans who were investigated and sanctioned by the FDA and the SEC. What is very troubling is the Clinton Foundation’s aggressive promotion of Ranbaxy despite mounting evidence that the Indian firm had persistently poor quality control and attempted to cover it up through either faulty or fraudulent reporting to the FDA. It is unclear at this juncture how many AIDS patients received the “watered-down” drugs. But that it happened at all, surely resulted in many deaths and is just monstrous. All for money.\n\nProPublica estimated that in 2007 alone, the US Agency for International Development allocated $9 million to Ranbaxy and delivered “more than $1.8 million packages.” “Substandard HIV medicines cause health problems for patients, perhaps even accelerating death from HIV-related infections,” Roger Bate, an economist at the American Enterprise Institute who researches substandard and counterfeit medicines, told the DCNF.\n\nRanbaxy’s generic drugs are banned in the US, but they are still selling and distributing HIV/AIDs drugs worldwide. The Clinton Foundation and Clinton’s charity have not severed ties with them either.\n\nCompanies that partner with The Clinton Foundation and charities make a ton of money. Corruption is rampant. Bill and Hillary Clinton obviously care nothing about black people or humans in general… their primary interest is monetary.", "authors": ["Terresa Monroe-hamilton"], "keywords": [], "meta_data": {"googlebot": "noimageindex", "og": {"site_name": "John Hawkins' Right Wing News", "description": "This is just criminal and it is no surprise it involves the Clinton Health Access Initiative. Anything with ‘Clinton’ in it has to be corrupt, but this resulted in the", "title": "New Clinton Foundation SCANDAL Just Broke - This Is What Hillary ACTUALLY Thinks About Black People... | John Hawkins' Right Wing News", "locale": "en_US", "image": {"width": 750, "identifier": "http://rightwingnews.com/wp-content/uploads/2016/09/Clinton-5-e1474464820329.jpg", "height": 322}, "url": "http://rightwingnews.com/hillary-clinton-2/new-clinton-foundation-scandal-just-broke-hillary-actually-thinks-black-people/", "type": "article"}, "referrer": "always", "robots": "noimageindex", "fb": {"app_id": 1631890973779575, "pages": 389658314427637}, "article": {"section": "Corruption", "published_time": "2016-09-21T10:10:05-04:00", "author": "https://www.facebook.com/terresamonroe"}, "google-site-verification": "SkBwg36QfD-9JmsE5roZWtBuTvXCuBAahBo8MiQVSEk", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://rightwingnews.com/hillary-clinton-2/new-clinton-foundation-scandal-just-broke-hillary-actually-thinks-black-people/", "images": ["http://1.gravatar.com/avatar/d35b77ff6c39007151d514afeb3a2758?s=96&d=mm&r=g", "http://pixel.quantserve.com/pixel/p-RS38vHsezmL8w.gif", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343802-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343804-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343804-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/2016/09/Clinton-5-e1474464820329-890x395_c.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343783-featured-214x123.jpg", "https://www.facebook.com/tr?ev=6026286623931&cd[value]=0.00&cd[currency]=USD&noscript=1", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343798-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343798-featured-214x123.jpg", "http://www.rightwingnews.com/wp-content/uploads/2014/08/rightwingnews_logo.png", "http://rightwingnews.com/wp-content/themes/rightwingnews-theme/images/loading.gif", "http://rightwingnews.com/wp-content/plugins/wpdev-content-ad/assets/book-ad.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343783-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343754-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343754-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/2016/09/Clinton-5-e1474464820329.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343802-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343814-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/2016/09/Clinton1-2-e1474464862366.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343814-featured-90x90.jpg", "http://1.gravatar.com/avatar/d35b77ff6c39007151d514afeb3a2758?s=32&d=mm&r=g"], "title": "New Clinton Foundation SCANDAL Just Broke – This Is What Hillary ACTUALLY Thinks About Black People…", "url": "http://rightwingnews.com/hillary-clinton-2/new-clinton-foundation-scandal-just-broke-hillary-actually-thinks-black-people/", "summary": "", "movies": [], "publish_date": {"$date": 1474467005000}, "source": "http://rightwingnews.com"}
