{"top_img": "http://eaglerising.com/wp-content/uploads/2016/09/hillary-6.jpg", "text": "A Daisy of a Rerun\n\nI am of an age which includes probably the first major political distortion in Presidential campaigning. That being the TV advertisement of an innocent little girl, sitting in a field picking daisy petals one by one, while a mushroom cloud arises in a most sinister fashion behind her.\n\nThe year was 1964 and the incumbent President Lyndon B Johnson “approved” that message. Only problem was that he followed the course in Vietnam which he was trying to assign onto his supposedly “war mongering” opponent, Barry Goldwater.\n\nToday, as our history books find difficulty in revisiting Johnson’s deceitful war policies, Goldwater’s vindication is now generally accepted without any acknowledgment from our Nation’s media.\n\nI mention this as a backdrop of our current Presidential campaign. Just maybe another daisy advertisement could be made, only this time, that little girl should be picking those daisy petals for each Clinton failure. Such a rendering, depicting reasons why Clinton is unworthy of the Presidency, would be shattering to her campaign.\n\nObviously, this version will never make it to our living rooms yet there are rumors that a “Daisy” remake aimed against Trump, has been mentioned. That being said, such considerations demonstrate just how desperate are the Clinton staffers.\n\nSomehow, if those daisy petals could be offered against Clinton as I previously mentioned, its message could outweigh Goldwater’s 1964 deception, when based upon the accuracy of recent events.\n\nInstead, today’s voters continue to wrestle with or just ignore the printed garbage which is masquerading as “news and views.” With the recent about-face announcement from Ted Cruz, the media’s reaction of ridicule was to be expected.\n\nNow, another unbalanced AP report unfolded, this one detailing Ted’s “dramatic about-face that may help unite a deeply divided Republican Party.” This in addition to previous statements in which Cruz called Trump a “pathological liar” and “utterly amoral.”\n\nAs the article relates, Trump countered with his nickname of “’Lyin Ted,’ insulted his wife, and linked his father to the John F. Kennedy assassination.” These actual quotes were selected for public consumption for one reason and although highly slanted and selective, it grades out under the sanctions of fair journalistic fodder.\n\nSchools of journalism teach that Americans are famous for both their short memories and their short attention spans. So, is it any wonder that our media pundits often place the more critical details far into an article, even within the closing paragraph, since many readers turn off after one paragraph?\n\nAnother safeguard of a derogatory story, which must unavoidably be reported is that its coverage is short-lived. I say “derogatory” when regarding the democratic and liberal policies and/or individuals. This exclusive slanting has been so prevalent that the “liberal press” moniker has now everyday acceptance.\n\nIt is to this unbalance that the informed and curious must either work on their retention skills or record the scanty details from a pertinent event. This extra correlation is my fountain for the following excerpts which will never qualify for the public’s re-airing. Also, the blatant public disservice, when comparing the above cited quotes verses what the AP ignores, needs no further explanation.\n\nAlso, with the first debate squarely in view, the caliber of moderating will now and forever pivot upon the Candy Crowley faux pas. Especially annoying is the unchanged format and résumés of the personnel who will rule this forum. In an effort to tone down or balance this slanted presentation, choice commentary against the protected candidate can offer a logical alternative and demonstrates reasons for its AP exclusion.\n\nThese quotes become especially prominent since both commentators are democrats themselves, and who have now reversed their opinions and are vigorously campaigning for the recipient of their former objections.\n\nWith that, consider the President’s past considerations of today’s democrat candidate, his hopeful successor, when back during the 2008 primary, Obama stated of Hillary, “She will say anything and change nothing. Hillary can’t be trusted and isn’t qualified to be President.”\n\nObviously, the deception and the intentional abandonment, along with the two weeks of lying about Benghazi had yet to occur. Not only is this pertinent, it’s damning, given the time frame.\n\nAlso during that same campaign, future first lady Michelle offered this opine: “If you can’t run your own house, you certainly can’t run the White House.”\n\nApparently, that one shortcoming continues to this day and while concerning if not pertinent, it is omitted from an equal public review.\n\nAgain, wouldn’t it be ironically significant to rerun that daisy commercial, only this time with documentation for each petal? That type of accounting may be even more withering than that long ago false imaging of a mushroom cloud!\n\nThe views expressed in this opinion article are solely those of their author and are not necessarily either shared or endorsed by EagleRising.com", "authors": ["View All Posts", "Jim Bowman"], "keywords": [], "meta_data": {"description": "Obama stated of Hillary, “She will say anything and change nothing. Hillary can’t be trusted and isn’t qualified to be President.”", "og": {"site_name": "Eagle Rising", "description": "Obama stated of Hillary, “She will say anything and change nothing. Hillary can’t be trusted and isn’t qualified to be President.”", "title": "Michelle Obama Attacks Hillary: \"If You Can’t Run Your Own House, You Certainly Can’t Run the White House\"", "locale": "en_US", "image": "http://eaglerising.com/wp-content/uploads/2016/09/hillary-6.jpg", "updated_time": "2016-09-26T11:51:25+00:00", "url": "http://eaglerising.com/37040/michelle-obama-attacks-hillary-if-you-cant-run-your-own-house-you-certainly-cant-run-the-white-house/", "type": "article"}, "robots": "noimageindex", "fb": {"app_id": 256195528075351, "pages": 135665053303678}, "article": {"section": "2016 Election", "tag": "Ted Cruz", "published_time": "2016-09-26T07:20:11+00:00", "modified_time": "2016-09-26T11:51:25+00:00"}, "viewport": "initial-scale=1,maximum-scale=1,user-scalable=no", "googlebot": "noimageindex"}, "canonical_link": "http://eaglerising.com/37040/michelle-obama-attacks-hillary-if-you-cant-run-your-own-house-you-certainly-cant-run-the-white-house/", "images": ["http://constitution.com/wp-content/uploads/2017/08/confederatemonument_poll_pop.jpg", "http://eaglerising.com/wp-content/uploads/2016/09/hillary-6.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/03/eagle-rising-logo3-1.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46729-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46764-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46731-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46745-featured-300x130.jpg", "http://pixel.quantserve.com/pixel/p-52ePUfP6_NxQ_.gif", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46654-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/cascade-mall-shooting-375x195.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2017/04/crtv_300x250_1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=22315475&cv=2.0&cj=1", "http://0.gravatar.com/avatar/901f52f93148bbf645afd0fddb2c9612?s=100&d=mm&r=g", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46750-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46612-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46761-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46642-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46735-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46755-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46752-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46748-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/science-375x195.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46715-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46743-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46712-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/hillary-6-800x300.jpg", "http://0.gravatar.com/avatar/901f52f93148bbf645afd0fddb2c9612?s=112&d=mm&r=g", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46757-featured-300x130.png"], "title": "“If You Can’t Run Your Own House, You Certainly Can’t Run the White House” – Eagle Rising", "url": "http://eaglerising.com/37040/michelle-obama-attacks-hillary-if-you-cant-run-your-own-house-you-certainly-cant-run-the-white-house/", "summary": "", "movies": ["https://www.youtube.com/embed/uO0R4k1tVMs?feature=oembed", "https://www.youtube.com/embed/lNj06em7cfo?feature=oembed"], "publish_date": {"$date": 1474874411000}, "source": "http://eaglerising.com"}
