{"top_img": "http://oppositionreport.com/wp-content/uploads/2016/09/GettyImages-599936028.jpg", "text": "\n\nPosted by Frank Wilkenmeyer on 19 Sep 2016\n\nWe’ve all seen campaign promises go horribly wrong. One of the most famous is probably “read my lips…no new taxes,” a moment in time that won an election and lost the next after George HW Bush made the promise but signed the largest tax increase in the history of tax increases. What Donald Trump just promised as a reaction to the attacks over the weekend in Chelsea and Minnesota may have that beat:\n\n.@JasonMillerinDC: Statement on Last Weekend’s Terror Attacks https://t.co/DZlIvkcHmB pic.twitter.com/l3EVTvLcfO — Official Team Trump (@TeamTrump) September 19, 2016\n\nTake a look at that and consider what it says. The personal attacks on President Obama and Secretary Clinton aside, Trump just promised to destroy the existential threat of terrorism in America. He didn’t promise to increase funding to counter-terrorism units or deliver a plan to fight internet terrorism recruitment, he promised to destroy all terrorists and end terrorism on our soil.\n\nLet’s imagine for a moment that Trump actually tried to implement this plan of his. “Destroy” doesn’t leave much to the imagination. While the mouth-breathers who support him are probably giving this statement a hearty “yeeeeehaw,” the reality is that he’s talking about something far more terrifying than the low rate of terrorism we actually witness in America. He’s talking about profiling Muslims. He’s talking about Donald Trump’s version of the Patriot Act, where nobody with brown skin is safe.The man being hunted by the FBI, for example, isn’t just a Muslim, he’s an\n\nThe man being hunted by the FBI, for example, isn’t just a Muslim, he’s an American citizen with the right to due process. Just because he’s a suspect in a bombing doesn’t mean he’s guilty of setting off bombs. With this blanket Trump statement, however, this man would be in a deck of cards marked “kill” and not on the most wanted list. There’s nothing that would lead one to believe that citizenship, constitutional rights or due process would come into play.\n\nWhat that means is that under Trump’s dream regime, we could expect Muslim heavy neighborhoods like Dearborn and Queens to become heavily patrolled and segregated and their residents routinely grabbed off the streets never to return. Without a way to differentiate Christian Arabs from Muslims, would they need to wear some kind of identifying mark to make them easier to spot? If you think I’m being overly critical and you doubt that fascism is where an American presidential candidate is leaning, read that statement one more time. It isn’t about the narrative. It isn’t about prevention or education.\n\nIt’s about destroying the existential threat of terrorism at all costs. It may sound good to a bunch of knuckle-draggers who love to hate based on skin color and religion, but to those of us who have studied history and understand exactly what that terminology means, Donald Trump just became even more frightening.\n\nThe only solace we have is that what he’s promising is nothing but another “read my lips.” Terrorism isn’t something you can simply “destroy” just because you said so. The thought of turning our streets into a Denzel Washington movie might get you a few more votes from the daft but it isn’t going to provide you with the laws you need to actually implement your fascism. Like the rest of Donald Trump’s campaign, in the end this is nothing more than a bloviating blowhard peddling fear to weak-minded, gullible morons.\n\nFeatured image from file", "authors": [], "keywords": [], "meta_data": {"generator": "WordPress 4.8.1", "og": {"site_name": "Democrats Winning the Hearts and Minds", "description": "Not only is it unrealistic, it's unconstitutional as hell.", "title": "Trump Just Made A Campaign Promise So Ridiculous It Makes ‘Read My Lips’ Look Good", "url": "http://oppositionreport.com/trump-just-made-a-campaign-promise-so-ridiculous-it-makes-read-my-lips-look-good/", "image": {"width": 1200, "identifier": "http://oppositionreport.com/wp-content/uploads/2016/09/GettyImages-599936028.jpg", "height": 630}, "locale": "en_US", "type": "article"}, "twitter": {"image": "http://oppositionreport.com/wp-content/uploads/2016/09/GettyImages-599936028.jpg?w=640", "card": "summary_large_image"}, "fb": {"app_id": 1555147758043521}, "msapplication-TileImage": "http://oppositionreport.com/wp-content/uploads/2015/12/cropped-2015-12-18_18-30-53-270x270.jpg", "viewport": "width=device-width; initial-scale=1; maximum-scale=1; user-scalable=0;"}, "canonical_link": "http://oppositionreport.com/trump-just-made-a-campaign-promise-so-ridiculous-it-makes-read-my-lips-look-good/", "images": ["http://oppositionreport.com/wp-content/uploads/2016/09/GettyImages-599936028.jpg", "http://oppositionreport.com/wp-content/uploads/2017/08/Baio-Fox.jpg", "http://oppositionreport.com/wp-content/uploads/2017/08/Untitled-1-Recovered-Recovered-Recovered-5.jpg", "http://oppositionreport.com/wp-content/themes/ares/data/1488260315_logo copy.jpg", "http://0.gravatar.com/avatar/01de25360ee280d1bd8f0b9a1f25034e?s=50&d=mm&r=g", "http://oppositionreport.com/wp-content/uploads/2017/08/trump-1-6.jpg", "http://pixel.quantserve.com/pixel/p-CR_FUckkEtQQm.gif", "http://oppositionreport.com/wp-content/uploads/2017/08/trump-11.jpg", "http://oppositionreport.com/wp-content/uploads/2017/08/joe-raedle-houston-flood-getty-OR.jpg"], "title": "Trump Just Made A Campaign Promise So Ridiculous It Makes ‘Read My Lips’ Look Good ‹ Opposition Report", "url": "http://winningdemocrats.com/trump-just-made-a-campaign-promise-so-ridiculous-it-makes-read-my-lips-look-good/", "summary": "", "movies": [], "publish_date": null, "source": "http://winningdemocrats.com"}
