{"top_img": "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/GettyImages-605695152.jpg", "text": "I woke up this morning to find a variation of this headline splashed all over my news feed:\n\nBill Clinton: ‘Natural’ For Foundation Donors to Seek Favors\n\nHere’s Google:\n\nNaturally, my reaction was “oh, s**t, what did Bill Clinton do to damage his wife’s campaign now?”\n\nOf course, the headline sounds really, really awful. It plays right into the idea that the Clinton Foundation is all about pay to play, just like Donald Trump has been saying all along. Unfortunately, it takes reading beyond the headlines, which is something most people don’t do, to find out the real story – and the real story is that there is no pay to play.\n\n“It was natural for people who’ve been our political allies and personal friends to call and ask for things. And I trusted the State Department wouldn’t do anything they shouldn’t do,” Clinton told NPR in an interview that aired Monday morning. Source: CNN\n\nIn other words, people can ask for favors, but that certainly doesn’t mean they’ll get them. Leaked emails have shown that some Clinton Foundation donors have gotten meetings with Clinton and that others were turned down. There is zero evidence of pay to play. In other words, people might have asked for favors, but there’s no evidence they got them.\n\nNow, let’s talk about the foundation the media doesn’t like to mention, the Trump Foundation. Trump hasn’t given to his own foundation since 2008. He does collect money from others, though, and gives it in his name. He also takes from the charity and allegedly buys things like oil paintings and football helmets, all for himself, but out of charity money.\n\nNew York Attorney General Eric Schneiderman said in a September 13 CNN interview that his office is investigating Trump’s charitable foundation over concerns that it “engaged in some impropriety” as related to New York charity laws. The investigation launched amid reports from The Washington Post that Trump spent money from his charity on items meant to benefit himself, such as a $20,000 oil painting of himself and a $12,000 autographed football helmet, and also recycled others’ contributions “to make them appear to have come from him” although he “hasn’t given to the foundation since 2008.” Source: Media Matters\n\nMedia Matters goes on to talk about the double standard and about how clearly the mainstream media is trying to promote Trump at the cost of Clinton’s candidacy:\n\nJournalists have been criticized for the “double standard” in the ways they cover Trump and Democratic presidential nominee Hillary Clinton. Earlier this month, cable news programs devoted 13 times more coverage to Clinton’s pneumonia diagnosis as The Washington Post’s reporting about the Trump Foundation. This week, both the Trump Foundation and Trump Organization stories were given short shrift by the broadcast news programs in favor of coverage of Donald Trump’s Dr. Oz stunt.\n\nAll of this biased coverage is hurting Clinton and helping Trump. Trump has seen major gains over the last few weeks, largely because the media covers every minor Clinton “scandal” (if you call getting sick a “scandal”) while ignoring every scandal in Trump’s closet, and trust me, there are a lot.\n\nFeatured image via Ethan Miller/Getty Images.", "authors": ["Wendy Gittleson"], "keywords": [], "meta_data": {"publisher": "Addicting Info | The Knowledge You Crave", "description": "These headlines are really damning, unless you actually read beyond them.", "generator": "WPZOOM Framework 1.5.0", "author": "Wendy Gittleson", "og": {"site_name": "AddictingInfo", "description": "These headlines are really damning, unless you actually read beyond them.", "title": "Proof The Mainstream Media Is Manipulating The Election By Taking Bill Clinton Out Of Context", "url": "http://addictinginfo.com/2016/09/19/proof-the-mainstream-media-is-manipulating-the-election-by-taking-bill-clinton-out-of-context/", "image": "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/GettyImages-605695152.jpg", "locale": "en_US", "type": "article"}, "twitter": {"description": "These headlines are really damning, unless you actually read beyond them.", "title": "Proof The Mainstream Media Is Manipulating The Election By Taking Bill Clinton Out Of Context", "url": "http://addictinginfo.com/2016/09/19/proof-the-mainstream-media-is-manipulating-the-election-by-taking-bill-clinton-out-of-context/", "image": "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/GettyImages-605695152.jpg", "site": "@AddInfoOrg", "card": "summary_large_image"}, "fb": {"app_id": 529217710562597, "pages": 146422995398181}, "article": {"publisher": "https://www.facebook.com/politicsbyjustin/"}, "keywords": "Bill Clinton, Clinton Foundation, clinton pay to play, Crooked Hillary, Hillary Clinton, political corruption, Trump foundation", "google-site-verification": "jVoeEwkTNH-nlRuMnNJ8bZ2zUtHf0dCo_GKDu1InEl4", "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://addictinginfo.com/2016/09/19/proof-the-mainstream-media-is-manipulating-the-election-by-taking-bill-clinton-out-of-context/", "images": ["http://i.imgur.com/JeqZLhj.png", "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/Screen-Shot-2016-09-19-at-10.28.21-AM.jpg", "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/09/GettyImages-605695152.jpg", "https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=Ckvzg1awO700y8", "http://i.imgur.com/rUJFIsF.png", "http://1.gravatar.com/avatar/7967831c4b263398ad7227f53695cfda?s=70&d=identicon&r=g", "http://addictinginfo.com/wp-content/uploads/2013/05/masthead.jpg", "http://pixel.quantserve.com/pixel/p-CR_FUckkEtQQm.gif", "http://b.scorecardresearch.com/p?c1=2&c2=17503306&cv=2.0&cj=1", "http://i.imgur.com/50AezNi.png"], "title": "Proof The Mainstream Media Is Manipulating The Election By Taking Bill Clinton Out Of Context", "url": "http://www.addictinginfo.org/2016/09/19/proof-the-mainstream-media-is-manipulating-the-election-by-taking-bill-clinton-out-of-context/", "summary": "", "movies": [], "publish_date": {"$date": 1474243200000}, "source": "http://www.addictinginfo.org"}
