{"top_img": "http://rightwingnews.com/wp-content/uploads/2016/09/HC-e1474477291944.jpg", "text": "BREAKING: Judge DEMANDS Release Of Clinton’s Security Training Files – She Has 5 Days…\n\nJust like Barack Obama and many people in his orbit, Hillary Clinton and her minions could never, ever in a million years pass a background security check. There are probably numerous terrorists who have cleaner backgrounds than these people and that’s no joke. They shouldn’t be cleared to clean a toilet there.\n\nThe Daily Caller News Foundation has been trying to get documents from the State Department forever concerning Clinton and her top aides completing recommended security training, briefings or courses on said security. Not only are these people willing morons concerning security, they have no desire to find out what they should and shouldn’t do. It’s called deniable plausibility. The Daily Caller News Foundation filed a FOIA lawsuit to get these people to produce mountains of documents. Will they see them before the election? A judge has ordered it… I wouldn’t hold my breath.\n\nFrom The Daily Caller:\n\nA frustrated federal judge ordered the State Department to begin producing within five days hundreds of documents on whether required or recommended security training, briefings or courses were completed by former Secretary of State Hillary Clinton and her top aides. Judge Richard Leon ruled Tuesday in favor of The Daily Caller News Foundation by rejecting the State Department’s motion to dismiss TheDCNF’s Freedom of Information Act lawsuit concerning production of the documents originally sought under the Freedom of Information Act. But he also denied TheDCNF’s request to depose State Department officials. × 101 Things All Young Adults Should Know by Sir John Hawkins John Hawkins's book 101 Things All Young Adults Should Know is filled with lessons that newly minted adults need in order to get the most out of life. Gleaned from a lifetime of trial, error, and writing it down, Hawkins provides advice everyone can benefit from in short, digestible chapters. Buy Now The State Department has been unable to produce any records confirming that Clinton and her top aides received mandatory annual security briefings about the proper handling of classified materials and the proper methods for conducting secure communications. In addition to Clinton, TheDCNF seeks the same records for former Clinton Chief of Staff Cheryl Mills, Deputy Chief of Staff Huma Abedin and Advisor Jacob Sullivan.\n\nHuma Abedin is especially suspect in security matters here. But these corruptocrats have not complied with anything else yet, I don’t look for them to do so this time. And for some reason they are never held to account for it. The rest of us would be in jail… guess we just aren’t the ‘right people’.\n\nJudge Richard Leon is getting fed up with State Department foot-dragging in releasing the documents. He ordered the department to release one third of the 400 documents by Sept. 26th and the rest of them by Oct. 10th. Bradley Moss, one of the attorneys representing TheDCNF, said “Judge Leon’s Order made clear his frustration with the State Department’s continued obstruction of the FOIA process. State will either meet his deadline or face the consequences of failure.” I hope they carry through with those consequences this time. It’s getting trite with the finger wagging and admonitions while just letting them get away with hell. The word for this is ‘corruption’.\n\nState Department officials admitted in a July 29th response to TheDCNF that their failure to produce the requested documents meant the “courses were not completed” by Clinton or her aides. Well, duh. That’s for peons, not the elite evidently.", "authors": ["Terresa Monroe-hamilton"], "keywords": [], "meta_data": {"googlebot": "noimageindex", "og": {"site_name": "John Hawkins' Right Wing News", "description": "Just like Barack Obama and many people in his orbit, Hillary Clinton and her minions could never, ever in a million years pass a background security check. There are probably", "title": "BREAKING: Judge DEMANDS Release Of Clinton's Security Training Files - She Has 5 Days... | John Hawkins' Right Wing News", "locale": "en_US", "image": {"width": 750, "identifier": "http://rightwingnews.com/wp-content/uploads/2016/09/HC-e1474477291944.jpg", "height": 375}, "url": "http://rightwingnews.com/hillary-clinton-2/breaking-judge-demands-release-clintons-security-training-files-5-days/", "type": "article"}, "referrer": "always", "robots": "noimageindex", "fb": {"app_id": 1631890973779575, "pages": 389658314427637}, "article": {"section": "Corruption", "published_time": "2016-09-21T13:19:31-04:00", "author": "https://www.facebook.com/terresamonroe"}, "google-site-verification": "SkBwg36QfD-9JmsE5roZWtBuTvXCuBAahBo8MiQVSEk", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://rightwingnews.com/hillary-clinton-2/breaking-judge-demands-release-clintons-security-training-files-5-days/", "images": ["http://rightwingnews.com/wp-content/uploads/2016/09/HC1-e1474477335772.jpg", "http://1.gravatar.com/avatar/d35b77ff6c39007151d514afeb3a2758?s=96&d=mm&r=g", "http://rightwingnews.com/wp-content/uploads/2016/09/HC-e1474477291944.jpg", "http://pixel.quantserve.com/pixel/p-RS38vHsezmL8w.gif", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343802-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343804-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343804-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343783-featured-214x123.jpg", "https://www.facebook.com/tr?ev=6026286623931&cd[value]=0.00&cd[currency]=USD&noscript=1", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343798-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343798-featured-214x123.jpg", "http://www.rightwingnews.com/wp-content/uploads/2014/08/rightwingnews_logo.png", "http://rightwingnews.com/wp-content/themes/rightwingnews-theme/images/loading.gif", "http://rightwingnews.com/wp-content/plugins/wpdev-content-ad/assets/book-ad.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343783-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343754-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343754-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343802-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343814-featured-214x123.jpg", "http://1.gravatar.com/avatar/d35b77ff6c39007151d514afeb3a2758?s=32&d=mm&r=g", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343814-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/2016/09/HC-e1474477291944-890x395_c.jpg"], "title": "BREAKING: Judge DEMANDS Release Of Clinton’s Security Training Files – She Has 5 Days…", "url": "http://rightwingnews.com/hillary-clinton-2/breaking-judge-demands-release-clintons-security-training-files-5-days/", "summary": "", "movies": [], "publish_date": {"$date": 1474478371000}, "source": "http://rightwingnews.com"}
