{"title": "BREAKING: WikiLeaks Releases Proof Hillary Lied and The FBI Covered It Up", "text": "The FBI has issued a letter stating they are investigating new evidence in the case against Hillary Clinton’s use of a private e-mail server. The new evidence was discovered during an investigation into Anthony Weiner, who was caught sexting with a 15-year old girl, and who is the estranged husband of Clinton’s top aide Huma Abedin.\r\n\r\nApparently, Abedin and Weiner shared a laptop that potentially contained “tens of thousands of e-mails” from Abedin, including e-mails she forwarded to herself from Hillary’s e-mail account which were not turned into the FBI. What this might mean is many of the deleted Hillary e-mails were likely just recovered by the FBI. If any of the e-mails are work related or classified that means both Hillary and Huma Abedin lied to the FBI during their original investigation. Lying to the FBI is illegal, and that alone is enough to prosecute Hillary Clinton and Huma Abedin irregardless of the other potential violations of the law that were committed. This story is still developing, but considering the fact the FBI released this letter just 11-days before the election means they found something serious.\r\n\r\nOn July 5th, 2016, FBI Director James Comey laid out the evidence against Hillary Clinton’s use of a private e-mail server, and mishandling of classified information, but shockingly did not recommend charges be brought against her. Since then, many high ranking officials within the FBI and other intelligence agencies have expressed “dismay,” and “disgust” with Director Comey’s decision. Meanwhile, many military and tech industry experts have expressed similar concerns. Some going as far as claiming the decision has irreparably harmed the reputation of the FBI.\r\n\r\nA high-ranking FBI official told Fox News that while it might not have been a unanimous decision, “It was unanimous that we all wanted her [Clinton’s] security clearance yanked.”\r\n“It is safe to say the vast majority felt she should be prosecuted,” the senior FBI official told Fox News. “We were floored while listening to the FBI briefing because Comey laid it all out, and then said ‘but we are doing nothing,’ which made no sense to us.” — Fox News\r\nUPDATE October 17, 2016:\r\nThe FBI has released a 100 page summary pertaining to the FBI investigation into Hillary Clinton’s private e-mail server. The documents claim a State Department official “pressured” the FBI into declassifying information in one of Clinton’s e-mails in exchange for extra agents at foreign dipolmoatic posts. Both the FBI and State Department deny the deal was ever struck.\r\n\r\nThe FBI summary also revealed a number of other questionable issues including a group of State Department officials that some called “The Shadow Government” who met weekly to discuss Freedom of Information requests related to Hillary Clinton. As well as discussions concerning security protocols and procedures which were regularly breached by Hillary Clinton, and her staff as Secretary of State. There was even one incident where Clinton ignored security advice that “placed Clinton, her staff, the media and her security detail in unnecessary danger in order to conduct a photo opportunity for ‘her election campaign’”. — BBC News\r\n\r\nUPDATE October 25, 2016:\r\nAccording to the The Wall Street Journal, a longtime Clinton supporter donated nearly $500,000 to an FBI Official’s wife who later investigated Hillary Clinton’s use of a private e-mail server.\r\n\r\nUncovering the Cover Up: Reddit Exposes Paul Combetta\r\nIn September of 2016, several Reddit users exposed the identity of Reddit user “stonetear”, as Paul Combetta, an IT Specialist who worked on Hillary Clinton’s private e-mail server. In fact, Mr. Combetta was granted immunity by the Justice Department for his involvement in the investigation, even though Paul Combetta was complicit in permanently deleting over 33,000 e-mails from Clinton’s private e-mail server.\r\n\r\nMr. Combetta posted a question on r/exchangeserver asking the community how to strip the e-mail address of a VIP from a bunch of archived e-mails.\r\n\r\n\r\nIt was assumed at the time that the VIP being referenced in the post was Hillary Clinton. However, new evidence released today suggests the VIP was in fact the President of the United States of America.\r\n\r\nWikileaks Podesta E-mails Release 7: October 14, 2016\r\nOn March 4, 2015, just hours after Hillary Clinton had been issued a subpoenaed by the Justice Department, John Podesta, the Chairman of the Hillary Clinton campaign, sent an e-mail to Cheryl Mills, an attorney who works for the Clinton campaign:\r\n\r\nFrom:john.podesta@gmail.com To: cheryl.mills@gmail.com Date: 2015–03–04 20:41 Subject: Special Category\r\nThink we should hold emails to and from potus? That’s the heart of his exec privilege. We could get them to ask for that. They may not care, but I seems like they will. — https://wikileaks.org/podesta-emails/emailid/9545\r\nIn other words, those deleted 33,000 e-mails we keep hearing about contain Hillary Clinton’s communications with President Obama. Which means both Hillary Clinton, and Obama lied to the FBI, Justice Department, Congress, and the American people. We now have definitive proof Obama was communicating with Hillary Clinton on her private e-mail server, and knew she was using a private e-mail server despite his claims otherwise.\r\n\r\nUPDATE October 25, 2016: Wikileaks Podesta E-mails Release 18 Confirms Intent of Cover Up\r\nOn March 7th, President Obama lied to the press and told the American people he found about Hillary Clinton’s private e-mail server at the same time as the public. Cheryl Mills, an attorney for the Clinton campaign, then e-mails John Podesta the same day a longtime Clinton supporter donated nearly $500,000 to an FBI Official’s wife who later investigated Hillary Clinton’s use of a private e-mail server.\r\n\r\nFwd: POTUS on HRC emails\r\nFrom:cheryl.mills@gmail.com To: john.podesta@gmail.com Date: 2015–03–07 21:41 Subject: Fwd: POTUS on HRC emails\r\nwe need to clean this up — he has emails from her — they do not say state.gov\r\n— — — — — Forwarded message — — — —\r\nBegin forwarded message: *From:* Josh Schwerin <joshschwerin@gmail.com> *Date:* March 7, 2015 at 6:33:44 PM EST *To:* Jennifer Palmieri <jennifer.m.palmieri@gmail.com>, Kristina Schake < kristinakschake@gmail.com>, Nick Merrill <nmerrill@hrcoffice.com>, Jesse Ferguson <jfferg@gmail.com> *Subject:* *POTUS on HRC emails*\r\nhttps://twitter.com/katherinemiller/status/574350749280432129/photo/1 Jen you probably have more on this but it looks like POTUS just said he found out HRC was using her personal email when he saw it in the news. — https://wikileaks.org/podesta-emails/emailid/31077#efmAABABT\r\nUPDATE October 20, 2016: Podesta E-mails Release 13 Confirms President Obama Knew Of Clinton’s Private E-mail Server\r\nOn Mar 8, 2015, at 7:56 AM, Jennifer Palmieri <jennifer.m.palmieri@gmail.com<mailto:jennifer.m.palmieri@gmail.com>> wrote:\r\nThey know POTUS and HRC emailed. Josh has been asked about that. Standard practice is not to confirm anything about his email, so his answer to press was that he would not comment/confirm. I recollect that Josh was also asked if POTUS ever noticed her personal email account and he said something like POTUS likely had better things to do than focus on his Cabinet’s email addresses.\r\nOn Mar 8, 2015, at 12:40 AM, Philippe Reines <pir@hrcoffice.com<mailto:pir@hrcoffice.com>> wrote:\r\nI find it odd the NYT didn’t actually quote the President saying what’s in their headline. Especially since the story has a disbelieving tone to his not noticing. One of us should connect with the WH just so they know that the email will show his statement to not make sense. I’m happy to do so to Josh Earnest since Jen is in a weird position, unless Cheryl or John you want to (or already have) with someone else. But it’s not unreasonable to assume that Josh is going to get asked how this was possible, and he should have the factset. Especially if it’s some weird technical thing with the President’s email setup that he doesn’t see addresses. — https://www.wikileaks.org/podesta-emails/emailid/21779\r\nTo make matters even worse for the cover up, in another leaked e-mail, Erika Rottenberg, another Clinton attorney, admits Hillary Clinton personally deleted many of the e-mails herself without oversight.\r\n\r\nI know when I talk to my friends who are attorneys we are all struggling with what happened to the emails and aren’t satisfied with answers to date. While we all know of the occasional use of personal email addresses for business, none of my friends circle can understand how it was viewed as ok/secure/appropriate to use a private server for secure documents AND why further Hillary took it upon herself to review them and delete documents without providing anyone outside her circle a chance to weigh in. It smacks of acting above the law and it smacks of the type of thing I’ve either gotten discovery sanctions for, fired people for, etc. — https://wikileaks.org/podesta-emails/emailid/4099\r\nThe reason FBI Director Comey did not press charges against Hillary Clinton was due to a lack of intent. He made the argument that Hillary Clinton was not subverting the law for any malicious intent, and therefore did not commit a provable crime.\r\n\r\nHowever, that was before the American people knew that Hillary Clinton was using a private insecure e-mail server to communicate with President Obama, and before we had proof that Hillary Clinton deleted e-mails personally. She also instructed Paul Combetta to remove evidence of the e-mails permanently, and did so after she had been subpoenaed by the Justice Department. This proves her intent to willfully and maliciously deleted evidence to protect both herself, and her boss, President Obama.\r\n\r\nThis suggests the White House illegally subverted the FBI investigation and forced them not to press charges knowing if she faced a judge she would have to reveal the President’s communications with her. Meanwhile, by protecting Hillary, the White House was able to ensure she was the nominee to maintain the cover up. By securing the White House for another 4-years it will prevent the American people from ever finding out what is contained in those 33,000 e-mails.\r\n\r\nWhen you consider these facts, as well as the other revelations within the Podesta e-mails on Wikileaks, it is clear the main stream media is also colluding with the Clinton campaign, and the White House. In effect, the White House is using the main stream media to elect Clinton in an attempt to protect their legacy, and hide the truth from the FBI, Congress, and the American people.\r\n\r\nTimeline of Events:\r\nMarch 2, 2015: The New York Times breaks the story that Clinton used a personal e-mail account while Secretary of State.\r\nMarch 4, 2015: The Benghazi committee issues a subpoena requiring preservation of all e-mails.\r\nMarch 7, 2015: Barack Obama states he only learned about the private e-mail server “through news reports” at the same time as everybody.\r\nMarch 7, 2015: 15:41:16 -0800 (PST) Cheryl Mills writes EMAIL ID 31077 as revealed by Podesta Emails Part 18: “we need to clean this up — he has emails from her — they do not say state.gov.”\r\nMarch 7, 2015: Hillary Surrogate Terry McCauliffe met with the FBI agent who oversaw the Clinton e-mail case and his wife and promised financial support ($500k+) if she ran for office. — Wall Street Journal\r\nMarch, 25–31, 2015: Paul Cobetta, a Platte River Networks employee, permanently and irreversibly deletes the email archive using a software called BleachBit likely under orders from Cheryl Mills after receiving advice on Reddit on how to delete e-mails for a “VIP”. The evidence under congressional subpoena is completely destroyed, including the Presidents e-mails."}