{"top_img": "http://news.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/03/Screen-Shot-2016-03-18-at-7.00.30-PM.jpg", "text": "For decades, employers have been holding America hostages with threats of taking their business elsewhere if we don’t vote the way they want. Of course, what generally happens when we vote the way they want is that we get screwed anyway. Jobs get outsourced, wages remain stagnant and regulations stop being enforced.\n\nIt hasn’t been since, well, the last presidential election, though, that we’ve seen a CEO be quite as blatant about what his plans are if his side (Republican) loses. Four years ago, it was “Papa” John Schnatter, who threatened to cut his employees’ hours and raise the price of pizzas if Obamacare went through. It did and he didn’t.\n\nThis year, another fast food mogul is making news for treating to hurt the economy if he doesn’t get his way. Andy Puzder is the CEO of Carl’s Jr. and Hardee’s. Here’s one of his commercials, which may not be safe for work:\n\nJudging by the commercials, like Donald Trump, Puzder likely cares little about political correctness. But that’s not the reason he wants a Republican in office. He just doesn’t want to pay people more, or at all. In an Op-Ed in the Wall Street Journal, Puzder says that if a Democrat wins, either Democrat, he will fully automate his stores. Speaking about an automated fast food system named Eatsa, Puzder wrote:\n\n“I want to try it,” CEO Andy Puzder told Business Insider of his automated restaurant plans. “We could have a restaurant that’s focused on all-natural products and is much like an Eatsa, where you order on a kiosk, you pay with a credit or debit card, your order pops up, and you never see a person.” “With government driving up the cost of labor, it’s driving down the number of jobs,” he says. “You’re going to see automation not just in airports and grocery stores, but in restaurants.” “This is the problem with Bernie Sanders, and Hillary Clinton, and progressives who push very hard to raise the minimum wage,” says Puzder. “Does it really help if Sally makes $3 more an hour if Suzie has no job?” Source: Yahoo Finance\n\nThis threat is probably less about you and me than about his employees. Across the country, Puzder has about 20,000 employees. He’s hoping he can convince his employees and the millions of other minimum wage and fast food employees across the nation to vote against their own interests.\n\nPuzder also has his own blog, where he writes a lot about politics and the joys of capitalism. One has to wonder if his 20,000 employees are quite as joyful about capitalism as he is.\n\nPuzder is doing just fine. In 2012, it was reported that he made nearly $4.5 million. His profits have been up in recent years, but his employees don’t see any of that. In fact, Puzder is famous for making big stink every time an opportunity to rip off his employees is denied.\n\nYou can guarantee, though, that even if a Republican wins the White House and the minimum wage stays the same, Puzder will still be automating. That’s just the way he is: profits over people.", "authors": [], "keywords": [], "meta_data": {"publisher": "Groopspeak", "description": "This might be the worst CEO in the country and no, it's not Papa John this time.", "generator": "WordPress 4.6.1", "author": "admin", "og": {"site_name": "AddictingInfo", "description": "This might be the worst CEO in the country and no, it's not Papa John this time.  <a href=", "title": "Fast Food CEO Threatens To Fire Everyone If A Democrat Wins The Presidency", "url": "http://news.groopspeak.com/fast-food-ceo-threatens-to-fire-everyone-if-a-democrat-wins-the-presidency/", "image": "http://news.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/03/Screen-Shot-2016-03-18-at-7.00.30-PM.jpg", "locale": "en_US", "type": "article"}, "twitter": {"description": "This might be the worst CEO in the country and no, it's not Papa John this time.", "creator": "@editor", "url": "http://news.groopspeak.com/fast-food-ceo-threatens-to-fire-everyone-if-a-democrat-wins-the-presidency/", "image": "http://news.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/03/Screen-Shot-2016-03-18-at-7.00.30-PM.jpg", "title": "Fast Food CEO Threatens To Fire Everyone If A Democrat Wins The Presidency", "site": "@groopspeak", "card": "summary_large_image"}, "apple-mobile-web-app-capable": "yes", "fb": {"app_id": 636595649691481}, "viewport": "width=device-width, initial-scale=1, user-scalable=1, minimum-scale=0.5, maximum-scale=1.0"}, "canonical_link": "http://news.groopspeak.com/fast-food-ceo-threatens-to-fire-everyone-if-a-democrat-wins-the-presidency/", "images": ["http://news.addictinginfoent.netdna-cdn.com/wp-content/plugins/jetpack/modules/sharedaddy/images/loading.gif", "http://news.addictinginfoent.netdna-cdn.com/wp-content/themes/groopspeaknews_v2/images/pageflipbg.png", "http://news.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/12/breakingnews1.jpg", "http://news.addictinginfoent.netdna-cdn.com/wp-content/uploads/2016/03/Screen-Shot-2016-03-18-at-7.00.30-PM.jpg", "http://1.gravatar.com/avatar/d9f072e9130198dc6fe7f2d500663cd0?s=70&d=mm&r=g"], "title": "Fast Food CEO Threatens To Fire Everyone If A Democrat Wins The Presidency", "url": "http://author.groopspeak.com/fast-food-ceo-threatens-to-fire-everyone-if-a-democrat-wins-the-presidency/", "summary": "", "movies": ["https://www.youtube.com/embed/uxPlxd7yjy0"], "publish_date": null, "source": "http://author.groopspeak.com"}
