{"top_img": "http://rightwingnews.com/wp-content/uploads/2016/09/soros-trump.jpg", "text": "EXPOSED: Soros Funding Fake Veterans’ PAC To Take Trump Down\n\nA couple months ago, Discover the Networks revealed a list of 187 groups who were funded by Soros. They have naturally been attacking the presidential candidate who is generally against their values like open borders, amnesty, giving illegals voting rights, Muslim migration and social justice. So, WHY then is Soros caught again?\n\nNow a new organization is going after Trump and sure enough, they’re funded by Soros TOO! It’s called ‘Common Defense PAC’ and their mantra is: “As veterans, we swore to protect the rights of every American. We continue to fulfill this promise by standing against Donald Trump.”\n\nThen on the ‘leadership team’ page on the website it lists a bunch of military veterans with no contact information for them. On their social media you see the same stuff. They feature videos and materials from other PACs that are ALSO funded by George Soros. Common Defense PAC shared one of its own anti-Trump video ads, which has a Common Defense PAC logo on it at the end, right underneath a URL link to a MoveOn.org petition called “Senator Portman: Disavow Donald Trump.”\n\nThe PAC routinely promotes the Twitter hashtag #VetsAgainstTrump, which is also promoted routinely by MoveOn.org. MoveOn.org’s Political Action arm has also put out advertising for the #VetsAgainstTrump hashtag. × 101 Things All Young Adults Should Know by Sir John Hawkins John Hawkins's book 101 Things All Young Adults Should Know is filled with lessons that newly minted adults need in order to get the most out of life. Gleaned from a lifetime of trial, error, and writing it down, Hawkins provides advice everyone can benefit from in short, digestible chapters. Buy Now The Common Defense PAC logo also shows up on an image on the web page for a Thunderclap campaign called #StandwithVets: #DumpTrump.” The campaign had a social media reach of more than 4.5 million people and was supported by actor Mark Ruffalo and leftist pundit Van Jones. MoveOn.org was listed as the organizer of the Thunderclap campaign. MoveOn.org and Common Defense PAC worked together on a live protest to pressure John McCain to “un-endorse Donald J. Trump.” ThinkProgress reported on August 4th that veterans “came to the Capitol to deliver McCain a petition, organized by progressive group MoveOn.org in conjunction with veterans group Common Defense PAC, calling for him to revoke his support for the Republican presidential nominee.”\n\nCommon sense PAC’s July quarterly filing report with the FEC lists ONLY one donor: a Baltimore IT consultant named Marjorie Roswell who gave $20,000 on June 30th. And then the group’s Director, Perry O’Brien has been a longtime left-wing activist. His ‘Iraq Veterans Against the War’ bio describes him:\n\nPerry O’Brien served as a medic in Afghanistan with the 82nd Airborne Division and was discharged as a conscientious objector in 2004. For several years he ran peace-out.com, a website providing support for other soldiers seeking to become conscientious objectors. He has been an active member of Iraq Veterans Against the War, and was a key organizer of Winter Soldier: Iraq and Afghanistan.\n\nThe PAC that’s suppose to be Veterans against Trump consists of only 1 conscientious objector. You can hardly call that a veteran, right? O’Brien personally started a MoveOn.org petition called “Tell GOP leaders to disavow Trump and his attacks on veterans.” The petition is probably what grabbed Soros attention to get O’Brien to start the shallow PAC. With all of these shell groups being created solely to destroy Trump and funded by Soros, do you think that Trump stands a chance against the Left?", "authors": ["Tiffiny Ruegner"], "keywords": [], "meta_data": {"googlebot": "noimageindex", "og": {"site_name": "John Hawkins' Right Wing News", "description": "A couple months ago, Discover the Networks revealed a list of 187 groups who were funded by Soros. They have naturally been attacking the presidential candidate who is generally against", "title": "EXPOSED: Soros Funding Fake Veterans' PAC To Take Trump Down | John Hawkins' Right Wing News", "locale": "en_US", "image": {"width": 680, "identifier": "http://rightwingnews.com/wp-content/uploads/2016/09/soros-trump.jpg", "height": 365}, "updated_time": "2016-09-27T14:03:19-04:00", "url": "http://rightwingnews.com/top-news/exposed-soros-funding-fake-veterans-pac-to-take-trump-down/", "type": "article"}, "referrer": "always", "robots": "noimageindex", "fb": {"app_id": 1631890973779575, "pages": 389658314427637}, "article": {"section": "Corruption", "published_time": "2016-09-26T02:39:58-04:00", "modified_time": "2016-09-27T14:03:19-04:00"}, "google-site-verification": "SkBwg36QfD-9JmsE5roZWtBuTvXCuBAahBo8MiQVSEk", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://rightwingnews.com/top-news/exposed-soros-funding-fake-veterans-pac-to-take-trump-down/", "images": ["http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343802-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/2016/09/soros-trump.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343804-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343754-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343783-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/2016/09/soros-trump-890x395_c.jpg", "http://rightwingnews.com/wp-content/themes/rightwingnews-theme/images/loading.gif", "http://rightwingnews.com/wp-content/plugins/wpdev-content-ad/assets/book-ad.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343783-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343814-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343804-featured-214x123.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343814-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/2015/07/145.thumbnail-144x144.png", "https://www.facebook.com/tr?ev=6026286623931&cd[value]=0.00&cd[currency]=USD&noscript=1", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343798-featured-90x90.jpg", "http://www.rightwingnews.com/wp-content/uploads/2014/08/rightwingnews_logo.png", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343802-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343754-featured-90x90.jpg", "http://rightwingnews.com/wp-content/uploads/wordpress-popular-posts/343798-featured-214x123.jpg", "http://pixel.quantserve.com/pixel/p-RS38vHsezmL8w.gif"], "title": "EXPOSED: Soros Funding Fake Veterans’ PAC To Take Trump Down", "url": "http://rightwingnews.com/top-news/exposed-soros-funding-fake-veterans-pac-to-take-trump-down/", "summary": "", "movies": [], "publish_date": {"$date": 1474871998000}, "source": "http://rightwingnews.com"}
