{"top_img": "http://occupydemocrats.com/wp-content/uploads/christieimpeach.jpg", "text": "71k SHARES SHARE THIS STORY\n\nNew Jersey’s despised Republican Governor Chris Christie is in scalding hot water as the top state legislators are now looking into filing articles of impeachment against him if he is found guilty of having orchestrated the closing of the George Washington Bridge in order to punish a political rival. Christie has been ordered to produce personal emails related to the “Bridgegate” scandal by a judge, as WNYC reports:\n\nThe decision on impeachment will be up to Democratic Speaker Vincent Prieto and if he gives the go-ahead, the Assembly Judiciary Committee would begin the process.It takes a majority of the 80-member Assembly to vote articles of impeachment. If it passes the Democrat-controlled body, the trial would be in the Senate, where two-thirds of senators would be needed to convict. Although Democrats hold a majority in the Senate, they would need three Republican senators to join them if all Democrats vote to convict.\n\nChris Christie is also Republican Presidential’s nominee Donald Trump’s transition team chairperson.\n\nJust four days ago, federal prosecutors pointed the finger at Christie at the start of a federal trial involving three senior aides to the Governor, accusing Christie of being deeply involved in the political retribution plot to shut down the George Washington Bridge to New York City, which resulted in the death of one person in an ambulance as enormous traffic jams stranded hundreds of thousands of motorists on one of the world’s busiest bridges.\n\nGovernor Christie was Trump’s most authoritative surrogate, as well as the first major “conservative” Republican endorser, in a move which most assumed meant that his political career was over inasmuch as his public service career now depended on Trump’s benefaction. Going from a multi-year flirtation with running for the highest office to endorsing Trump last March in a widely mocked ceremony then represented a stunning level of political debasement coming from the Governor.\n\nFamously, Chris Christie once lied for two hours straight to a nationally televised press conference, which you can see below in its painstaking detail. It’s have cued it to 1:43 so you can watch the Republican Governor’s the flat out denial of any knowledge of BridgeGate which he gave on January 9th, 2014, just two short months after his re-election, and four months after the scandal which delayed ambulances and emergency services. BrideGate literally gridlocked an entire town.\n\nLast week it was revealed that Governor Christie was actually informed personally about BridgeGate at the 9/11 memorial ceremony in 2013 from his senior aides, and stood by, and did nothing, though his aides knew about it and called him out for lying to everyone in their electronic messages.\n\nThe Republican Governor once thought to be the future of the party is about to be booted from office by his self-defeating act of lying about his administration’s bare knuckle political bullying. We will watch this story closely, and await the reaction of Republican nominee Donald Trump the impeachment charges Christie is facing, because the New Jersey Governor is one of the pillars of this year’s Republican Presidential campaign.\n\nWatch his shame:\n\nAdd your name to millions demanding that Congress take action on the President’s crimes. IMPEACH DONALD TRUMP!", "authors": ["Grant Stern", "Brett Bose", "Natalie Dickinson"], "keywords": [], "meta_data": {"generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "og": {"site_name": "Occupy Democrats", "description": "Trump's lapdog is in hot water.", "title": "BREAKING: New Jersey Moves To Impeach Chris Christie Over \"Bridgegate\"", "locale": "en_US", "image": {"width": 674, "identifier": "http://occupydemocrats.com/wp-content/uploads/christieimpeach.jpg", "height": 399}, "updated_time": "2016-09-23T20:35:59-04:00", "url": "http://occupydemocrats.com/2016/09/23/breaking-new-jersey-moves-impeach-chris-christie-bridgegate/", "type": "article"}, "twitter": {"image": "http://occupydemocrats.com/wp-content/uploads/christieimpeach.jpg", "creator": "@grantstern", "description": "Trump's lapdog is in hot water.", "card": "summary", "title": "BREAKING: New Jersey Moves To Impeach Chris Christie Over \"Bridgegate\""}, "fb": {"admins": "100010978633754 , 66801782", "app_id": 187891551586426}, "msapplication-TileImage": "http://occupydemocrats.com/wp-content/uploads/odfavicon-2.gif", "article": {"section": "Politics", "tag": "style", "published_time": "2016-09-23T19:30:29-04:00", "modified_time": "2016-09-23T20:35:59-04:00", "author": "https://facebook.com/grantstern"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1"}, "canonical_link": "http://occupydemocrats.com/2016/09/23/breaking-new-jersey-moves-impeach-chris-christie-bridgegate/", "images": ["http://occupydemocrats.com/wp-content/uploads/christieimpeach.jpg", "http://occupydemocrats.com/wp-content/uploads/od-political-WEBSITE-SIDEBAR-SMALL.png", "http://occupydemocrats.com/wp-content/uploads/Bye-Bye-Trump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/cher-1-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/olsteen-340x150.png", "http://occupydemocrats.com/wp-content/uploads/occupydemocrats-logo2x.png", "http://occupydemocrats.com/wp-content/uploads/fin-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2016-10-22-at-4.07.01-PM.png", "http://0.gravatar.com/avatar/6d91f94d3316d0ac53c3711f04f38fca?s=164&d=mm&r=g", "http://occupydemocrats.com/wp-content/uploads/TrumpMoore-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/donald-trump-with-felix-sater-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/sallyyates-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/DrunkTrump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/123452345-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/watters-1-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/it-340x150.jpg"], "title": "New Jersey Moves To Impeach Chris Christie Over \"Bridgegate\"", "url": "http://occupydemocrats.com/2016/09/23/breaking-new-jersey-moves-impeach-chris-christie-bridgegate/", "summary": "", "movies": ["https://www.youtube.com/embed/N5GRpJweZNU?feature=oembed&showinfo=0&rel=0&modestbranding=1"], "publish_date": {"$date": 1474588800000}, "source": "http://occupydemocrats.com"}
