{"top_img": "http://usherald.com/wp-content/uploads/2016/09/barack_obama_crying.jpg", "text": "Obama made a real fool out of himself during what was supposed to be his final address to the U.N. Assembly. During it he basically said that we have no chance in defeating ISIS and other Islamic extremist groups in Syria and otherwise. He spoke heavily to the shortcomings in military power that we have in combatting his \"JV team.\"\n\nSeeing as the U.S. is the global police force, he said that we have no chance of winning this battle.\n\nThe Daily Caller reports that Obama touched heavily upon the massive growth in military and increase in militants that form the Islamic State group. He cited this as the reason that he sees no viable military solution.\n\n\"If we are honest, we understand that no external power is going to be able to force different religious communities or ethnic communities to coexist for long,\" said Obama.\n\nPresident Obama continued by saying that we must \"be honest about the nature of these conflicts and our international community must continue to work with those who seek to build rather than to destroy.\"\n\nHe mentioned briefly that there will be a military aspect to dealing with the Islamic State group he also categorized Syria as \"a place like Syria, where there’s no ultimate military victory to be won.\"\n\nInstead Obama suggested that we \"pursue the hard work of diplomacy that aims to stop the violence and deliver aid to those in need and support those who pursue a political settlement and can see those who are not like themselves as worthy of dignity and respect.\"\n\nWhich may prove to be a little difficult since these people are not the most 'reasonable' people to try to deal with.\n\nIt's likely that many of the liberals who refuse to acknowledge the strong connection that we have seen between radical Islam and death and violence. These are the same people that would just as quickly chastise a Christian for wanted to say the pledge of allegiance in school as they would catch a bullet for a suspected Muslim terrorist.\n\nIt's this type of thinking that got us into the predicament that we are in today. Pretending like there is no real threat or that we are up against some JV team get's us nowhere and instead only makes this issue worse.\n\nIt's about time we start calling it like it is and taking action. We're past the point of being polite and too afraid to hurt anyone's feelings. If we don't take action soon, then Obama's pathetic defeatist monologue will soon become a reality.\n\nMake sure to share this on Facebook if you think it's time we take action against the very real threat that is radical Islam.\n\nSource: Conservative Tribune", "authors": ["Crispin White"], "keywords": [], "meta_data": {"generator": "WordPress 4.8.1", "og": {"site_name": "US Herald", "description": "Obama made a real fool out of himself during what was supposed to be his final address to the U.N. Assembly. During it he basically said that we have no chance in defeating ISIS …", "title": "BREAKING: Obama Just DISGRACED The U.S. By Surrendering To ISIS In Front Of Entire U.N. ⋆ US Herald", "locale": "en_US", "image": {"width": 800, "identifier": "http://usherald.com/wp-content/uploads/2016/09/barack_obama_crying.jpg", "height": 532}, "updated_time": "2016-09-21T10:10:27-05:00", "url": "http://usherald.com/breaking-obama-just-disgrace-u-s-surrendering-isis-front-entire-u-n/", "type": "article"}, "twitter": {"description": "Obama made a real fool out of himself during what was supposed to be his final address to the U.N. Assembly. During it he basically said that we have no chance in defeating ISIS […]", "creator": "@usheraldnews", "image": "http://usherald.com/wp-content/uploads/2016/09/barack_obama_crying.jpg", "title": "BREAKING: Obama Just DISGRACED The U.S. By Surrendering To ISIS In Front Of Entire U.N. ⋆ US Herald", "site": "@usheraldnews", "card": "summary_large_image"}, "fb": {"app_id": 211561922608080, "pages": 1746057572287188}, "article": {"publisher": "https://www.facebook.com/unitedstatesherald/", "section": "- TERROR WATCH -", "tag": "Obama", "published_time": "2016-09-20T18:03:43-05:00", "modified_time": "2016-09-21T10:10:27-05:00"}, "google-site-verification": "ZdE3006b76rd8x4CyNxQi3cdpRirnUjvfut4ZYX-bqY", "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://usherald.com/breaking-obama-just-disgrace-u-s-surrendering-isis-front-entire-u-n/", "images": ["http://usherald.com/wp-content/uploads/2015/02/usherald-logo.png", "http://usherald.com/wp-content/uploads/2016/09/barack_obama_crying.jpg", "https://www.facebook.com/tr?id=718459264928386&ev=PixelInitialized"], "title": "Obama Just DISGRACED The U.S. By Surrendering To ISIS In Front Of Entire U.N. ⋆ US Herald", "url": "https://goo.gl/aRYFof", "summary": "", "movies": ["https://www.youtube.com/embed/W5e8Gmw7xxk"], "publish_date": {"$date": 1474412623000}, "source": "https://goo.gl"}
