{"top_img": "http://occupydemocrats.com/wp-content/uploads/trumpliar-1.jpg", "text": "11.3k SHARES SHARE THIS STORY\n\nDuring a Republican primary debate in September 2015, now-Republican nominee Donald Trump said that he never lobbied Florida Governor Jeb Bush for casino gambling because “he would’ve gotten it, if I wanted it.” But if that is true, then Donald Trump committed yet another yet another felonious offense by the racist mogul – this time for for lying under oath in a civil court deposition, which is perjury, as Newsweek reports:\n\nOne of these stories is a lie—a detailed, self-serving fabrication. But unlike the mountain of other lies he has told, this time the character trait that leads to Trump’s mendacity is on full display: He makes things up when he doesn’t want to admit he lost.\n\nAssume the story he told at the debate is the lie. Even though Bush’s story reinforced what Trump was saying at rallies—he had played the “cash for outcomes” political game for years—he could not admit he had tried to do the same in Florida because he could not bring himself to say that he had lost. Instead, he looked America in the eye and lied. And then he felt compelled to stack on another boast: His people are so wonderful that they would have gotten casino gambling in Florida, regardless of Bush’s opposition—if Trump had wanted it.\n\nThe transcripts below will show you there was a dispute of fact between two candidates, but not just any fact, a fact which Jeb Bush would’ve full well known, as would have Trump. Because after Trump’s naïve attempt to muscle gambling into Florida over the objections of an anti-gambling Republican governor failed, he sued his former employee for his own failure. Eichenwald’s point is that either Trump lied baldly to the face of a former elected official on national television (and moderators let him get away with it unchecked) or:\n\nNow consider the other option, that Trump committed perjury in the 2007 testimony. There, he admitted pushing for casino gambling in Florida, but said he would have gotten what he wanted if he hadn’t been tricked by Fields. The rationale for the perjurious testimony is simple—Trump wants money from a man who stopped working for him and, once again, the story lets him deny he is anything less than perfect.\n\nWhy is all of this important? In the late 1990s, House Republicans impeached Democratic President Bill Clinton for allegedly lying in a deposition about a sensitive personal offense to his wife. The entire media hounded President Clinton over the Whitewater “scandal” for half of the decade and it was the only thing they could find.\n\nRepublicans selected a nominee who is legendary for his lies, but unlike Trump’s other tall tales and obvious gaslighting, this lie was either told to a Florida court of law under oath (it does seem like Trump lives in the Florida court system at times) or to national television and his party’s base to discredit his opponent by turning the truth on it’s head.\n\nTrump’s penchant for turning the truth upside down is not only a disastrous character flaw, but it’s a mortal danger to our national safety that he is even on the ballot as a major party candidate for President.\n\nSee for yourself the two transcripts Newsweek published and decide for yourself if Trump perjured himself to the court or lied to the Republican debate audience. Compare the two options presented by Eichenwald, there’s no third option here:\n\nBush: “The one guy that had some special interests that I know of that tried to get me to change my views on something—that was generous and gave me money—was Donald Trump. He wanted casino gambling in Florida.” Trump interrupted Bush: Trump: I didn’t— Bush: Yes, you did. Trump: Totally false. Bush: You wanted it, and you didn’t get it, because I was opposed to— Trump: I would have gotten it. Bush: Casino gambling before— Trump: I promise, I would have gotten it. Bush: During and after. I’m not going to be bought by anybody. Trump: I promise, if I wanted it, I would have gotten it. Bush: No way. Believe me. Trump: I know my people. Bush: Not even possible. Trump: I know my people.\n\nTranscript of 2007 Trial Deposition:\n\nA lawyer asked Trump, “Did you yourself do anything to obtain any of the details with respect to the Florida gaming environment, what approvals were needed and so forth?” Trump: A little bit. Lawyer: What did you do? Trump: I actually spoke with Governor-Elect Bush; I had a big fundraiser for Governor-Elect Bush…and I think it was his most successful fundraiser, the most successful that he had had up until that point, that was in Trump Tower in New York on Fifth Avenue. Lawyer: When was that? Trump: Sometime prior to his election. Lawyer: You knew that Governor Bush, Jeb Bush at that time, was opposed to expansion of gaming in Florida, didn’t you? Trump: I thought that he could be convinced otherwise. Lawyer: But you didn’t change his mind about his anti-gaming stance, did you? Trump: Well, I never really had that much of an opportunity because Fields resigned, telling me you could never get what we wanted done, only to do it for another company.\n\nAdd your name to millions demanding that Congress take action on the President’s crimes. IMPEACH DONALD TRUMP!", "authors": ["Grant Stern", "Brett Bose", "Natalie Dickinson"], "keywords": [], "meta_data": {"generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "og": {"site_name": "Occupy Democrats", "description": "Trump's past has come back to haunt him.", "title": "JUST IN: Newsweek Accuses Trump Of Committing A Felony", "locale": "en_US", "image": {"width": 658, "identifier": "http://occupydemocrats.com/wp-content/uploads/trumpliar-1.jpg", "height": 347}, "url": "http://occupydemocrats.com/2016/09/23/just-newsweek-accuses-trump-committing-felony/", "type": "article"}, "twitter": {"image": "http://occupydemocrats.com/wp-content/uploads/trumpliar-1.jpg", "creator": "@grantstern", "description": "Trump's past has come back to haunt him.", "card": "summary", "title": "JUST IN: Newsweek Accuses Trump Of Committing A Felony"}, "fb": {"admins": "100010978633754 , 66801782", "app_id": 187891551586426}, "msapplication-TileImage": "http://occupydemocrats.com/wp-content/uploads/odfavicon-2.gif", "article": {"section": "Politics", "tag": "Trump", "published_time": "2016-09-23T22:01:24-04:00", "author": "https://facebook.com/grantstern"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=1"}, "canonical_link": "http://occupydemocrats.com/2016/09/23/just-newsweek-accuses-trump-committing-felony/", "images": ["http://occupydemocrats.com/wp-content/uploads/od-political-WEBSITE-SIDEBAR-SMALL.png", "http://occupydemocrats.com/wp-content/uploads/Bye-Bye-Trump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/cher-1-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/trumpliar-1.jpg", "http://occupydemocrats.com/wp-content/uploads/olsteen-340x150.png", "http://occupydemocrats.com/wp-content/uploads/occupydemocrats-logo2x.png", "http://occupydemocrats.com/wp-content/uploads/fin-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/Screen-Shot-2016-10-22-at-4.07.01-PM.png", "http://0.gravatar.com/avatar/6d91f94d3316d0ac53c3711f04f38fca?s=164&d=mm&r=g", "http://occupydemocrats.com/wp-content/uploads/2938475-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/TrumpMoore-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/donald-trump-with-felix-sater-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/sallyyates-240x150.jpg", "http://occupydemocrats.com/wp-content/uploads/DrunkTrump-240x150.png", "http://occupydemocrats.com/wp-content/uploads/123452345-340x150.jpg", "http://occupydemocrats.com/wp-content/uploads/joelosteen-340x150.jpg"], "title": "Newsweek Accuses Trump Of Committing A Felony", "url": "http://occupydemocrats.com/2016/09/23/just-newsweek-accuses-trump-committing-felony/", "summary": "", "movies": [], "publish_date": {"$date": 1474588800000}, "source": "http://occupydemocrats.com"}
