{"top_img": "http://www.antinews.in/wp-content/uploads/2017/05/Edward-Snowden-Osama-Bin-Laden-Is-Alive-And-Well-In-The-Bahamas__1488574305_45.126.237.0.jpg", "text": "Edward Snowden: Osama Bin Laden is Still Alive Living in the Bahamas:\n\nEdward Snowden (the NSA whistleblower) has made another astonishing revelation. He apparently has documents that prove Osama Bin Laden is on the CIA’s payroll and currently living a luxury lifestyle in the Bahamas.\n\nIn 2013, Edward Snowden, a former contractor for the National Security Agency (NSA), released various documents regarding government surveillance programs. This resulted in him being charged for committing several crimes.\n\nAll of the charges carry a sentence of up to 10 years in prison. Due to this and the fact he believed it was the correct decision to reveal the shocking extent of phone surveillance by U.S. intelligence agency, he had no choice but to flee.\n\nHe currently resides in Russia, this is where he has be offered asylum for one year. Snowden has yet again provided a shocking piece of information. The Moscow Tribune reports that Snowden claims that Osama Bin Laden the infamous former leader of Al Qaeda, is in fact still alive and is in receipt of cash courtesy of the Central Intelligence Agency (CIA).\n\n“I have documents showing that Bin Laden is still on the CIA’s payroll,” Snowden claims. “He is still receiving more than $100,000 a month, which are being transferred through some front businesses and organizations, directly to his Nassau bank account. I am not certain where he is now, but in 2013, he was living quietly in his villa with five of his wives and many children.”\n\nSnowden claims the CIA faked the death of Osama Bin Laden. After reporting him dead, the man himself and his family were moved to a secret location in the Bahamas.\n\n“Osama Bin Laden was one of the CIA’s most efficient operatives for a long time,” Snowden claims. “What kind of message would it send their other operatives if they were to let the SEALs kill him? They organized his fake death with the collaboration of the Pakistani Secret services, and he simply abandoned his cover. Since everyone believes he is dead, nobody’s looking for him, so it was pretty easy to disappear. Without the beard and the military jacket, nobody recognizes him.”\n\nNaijaPicks say that these documents that prove this controversial claim are featured in his 2015 book.\n\nDespite the fact Snowden says he was trying to help the citizens of America by releasing these documents, he is still classed as a fugitive in the USA. This is also despite approximately 168,000 people signing a petition calling for Snowden to be pardoned. This was rejected by the White House rejected on July 28, 2015.\n\nWhilst resident in Hong Kong, Snowden was interviewed by several journalists inside a secret location. He was asked why he left his own country, his reply to The Guardian was:\n\n“I don’t want to live in a society that does these sort of things… I do not want to live in a world where everything I do and say is recorded.”\n\nSource : Unknown But Not Hidden; Image Source: Awareness Act", "authors": [], "keywords": [], "meta_data": {"ca_image": "http://www.antinews.in/wp-content/uploads/2017/05/Edward-Snowden-Osama-Bin-Laden-Is-Alive-And-Well-In-The-Bahamas__1488574305_45.126.237.0-150x150.jpg", "generator": "WordPress 4.8", "og": {"site_name": "Anti News Network", "description": "Edward Snowden: Osama Bin Laden is Still Alive Living in the Bahamas", "title": "Edward Snowden: Osama Bin Laden is Still Alive Living in the Bahamas", "locale": "en_GB", "image": "http://www.antinews.in/wp-content/uploads/2017/05/Edward-Snowden-Osama-Bin-Laden-Is-Alive-And-Well-In-The-Bahamas__1488574305_45.126.237.0.jpg", "url": "http://www.antinews.in/edward-snowden-osama-bin-laden-still-alive-living-bahamas/", "type": "article"}, "twitter": {"image": "http://www.antinews.in/wp-content/uploads/2017/05/Edward-Snowden-Osama-Bin-Laden-Is-Alive-And-Well-In-The-Bahamas__1488574305_45.126.237.0.jpg", "description": "Edward Snowden: Osama Bin Laden is Still Alive Living in the Bahamas", "card": "summary", "title": "Edward Snowden: Osama Bin Laden is Still Alive Living in the Bahamas - Anti News Network"}, "fb": {"pages": 1101259469943578}, "msapplication-TileImage": "http://www.antinews.in/wp-content/uploads/2017/02/14908370_1782421858673034_4749262631277297409_n.png", "article": {"section": "Conspiracy Archive", "published_time": "2017-05-13T03:21:25-07:00"}, "ca_title": "Edward Snowden: Osama Bin Laden is Still Alive Living in the Bahamas", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.antinews.in/edward-snowden-osama-bin-laden-still-alive-living-bahamas/", "images": ["http://www.antinews.in/wp-content/uploads/2017/05/Edward-Snowden-Osama-Bin-Laden-Is-Alive-And-Well-In-The-Bahamas__1488574305_45.126.237.0.jpg"], "title": "Edward Snowden: Osama Bin Laden is Still Alive Living in the Bahamas", "url": "http://www.antinews.in/edward-snowden-osama-bin-laden-still-alive-living-bahamas/", "summary": "", "movies": ["https://www.youtube.com/embed/7ksatFd8gkY"], "publish_date": {"$date": 1494670885000}, "source": "http://www.antinews.in"}
