{"top_img": "http://themiamigazette.com/wp-content/uploads/2017/05/Cannibals.png", "text": "Police in Vernal Heights, Florida, arrested 3-practicing cannibals who claim eating human flesh cures both type-1 and type-2 diabetes and depression.\n\nAccording to Vernal Heights Chief of Police, Gregory Moore, the 3-men were arrested when officers responded to what they assumed would be a routine noise complaint.\n\nPolice arrived at 3845 Toolson Lane (the home of William Provost) at approximately 7:45 PM on Sunday evening in response to a neighbor complaining of strange sounds coming from the home.\n\nResponding officers told reporters that they assumed their visit to the house would be a quick one and that they would simply be asking the residents to keep the noise down.\n\nWhen the officers arrived at 3845 Toolson Lane, they repeatedly knocked on the door and rang the doorbell, however, nothing could be heard over the sound a stereo inside the house repeatedly playing the same song, which was later identified as – Enya’s ‘Who Can Say’.\n\nAfter attempting to get the attention of the homeowner via knocking and ringing the doorbell for approximately 5-minutes, police entered the home through an unlocked door located at the rear of the house.\n\nThe responding officers told reporters that the house had been extremely dark, cluttered, and an overwhelming smell (which was later identified as decomposing flesh) filled the home. Upon clearing the first-floor of the home, the responding officers realized that the blaring music was coming from the home’s basement.\n\nAccording to the officers, a bizarre crime scene was quickly uncovered upon entering the basement. Three men, which have since been identified as 62-year-old William Provost, 51-year-old Dennis Ratcliff, and 36-year-old Michael Dore were sitting in a circle on the basement’s concrete floor and ritualistically chanting while eating what police initially believed was an animal carcass, but was later identified as human remains.\n\nWilliam Provost, who police believe to be the group’s ringleader, admitted to practicing cannibalism and told arresting officers:\n\n“I find human flesh to be the only thing that cures my type-2 diabetes and chronic depression. If expensive pharmaceutical drugs helped, I would figure out a way to obtain them, but they don’t, so I stick to what works for me”.\n\nUpon searching the home’s basement, police made several startling discoveries including a large room that appears to contain nothing more than decades worth of clutter, but upon further inspection, police discovered human remains hidden throughout the old wooden furniture and broken appliances.\n\nPolice also discovered a kitchen style refrigerator located in a small room in the corner of the basement that contained the limbs, organs, and miscellaneous remains of what police believe to be upwards of 7-8 different individuals.\n\nIn addition to the refrigerator, the small room in the basement also housed a make-shift ‘tool wall’ that contained a myriad of tools that police believe were used to dismember several victims.\n\nUpon their initial investigation, police believe the 3-men have been practicing cannibalism for the past 3-4 years and largely remained under the radar due to their practice of targeting and befriending homeless drifters they met at small dive-bars located upwards of 100-miles from their Vernal Heights residence.\n\nVernal Heights Chief of Police, Gregory Moore, spoke to reporters during a brief press-conference this morning.\n\n“Though modern-day cannibalism is extremely rare, it does unfortunately exist. That said -treating diabetes and or depression has to be the most bizarre reason for practicing cannibalism that I’ve ever heard.”\n\nProvost’s accomplices, 51-year-old Dennis Ratcliff, and 36-year-old Michael Dore, also admitted to cannibalizing human flesh because they believed it would cure depression and told arresting officer’s that Provost took them under his wing in late-2012.\n\nAs of Tuesday afternoon, police and detectives are still conducting a search at the residence located at 3845 Toolson Lane.\n\nAll three men are currently being held without bail at the Vernal Heights Municipal Jail.", "authors": ["Anthony Brooks"], "keywords": [], "meta_data": {"description": "Police in Vernal Heights, Florida, arrested 3-practicing cannibals who claim eating human flesh cures both type-1 and type-2 diabetes and depression.", "generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "author": "Anthony Brooks", "og": {"site_name": "The Miami Gazette", "description": "Police in Vernal Heights, Florida, arrested 3-practicing cannibals who claim eating human flesh cures both type-1 and type-2 diabetes and depression.", "title": "Cannibals Arrested in Florida Claim Eating Human Flesh Cures Diabetes and Depression", "locale": "en_US", "image": {"width": 956, "identifier": "http://themiamigazette.com/wp-content/uploads/2017/05/Cannibals.png", "height": 632}, "updated_time": "2017-05-30T13:44:24+00:00", "url": "http://themiamigazette.com/cannibals-arrested-florida-claim-eating-human-flesh-cures-diabetes-depression/", "type": "article"}, "twitter": {"image": "http://themiamigazette.com/wp-content/uploads/2017/05/Cannibals.png", "description": "Police in Vernal Heights, Florida, arrested 3-practicing cannibals who claim eating human flesh cures both type-1 and type-2 diabetes and depression.", "card": "summary", "title": "Cannibals Arrested in Florida Claim Eating Human Flesh Cures Diabetes and Depression"}, "article": {"section": "Uncategorized", "tag": "Vernal Heights", "published_time": "2017-05-30T13:43:13+00:00", "modified_time": "2017-05-30T13:44:24+00:00"}}, "canonical_link": "http://themiamigazette.com/cannibals-arrested-florida-claim-eating-human-flesh-cures-diabetes-depression/", "images": ["http://themiamigazette.com/wp-content/uploads/2017/05/Cannibal-Basement-Fridge.png", "http://themiamigazette.com/wp-content/uploads/2017/05/Cannibal-Basement.png", "http://themiamigazette.com/wp-content/uploads/2017/05/Police-Spokesman.png", "http://themiamigazette.com/wp-content/uploads/2017/05/Cannibal-Home.png", "http://2.gravatar.com/avatar/297522ab22952144f7a0e9e8f1d75843?s=96&d=mm&r=g", "http://themiamigazette.com/wp-content/uploads/2017/05/Cannibal-Tools.png", "http://themiamigazette.com/wp-content/uploads/2017/05/Cannibals.png"], "title": "Cannibals Arrested in Florida Claim Eating Human Flesh Cures Diabetes and Depression", "url": "http://themiamigazette.com/cannibals-arrested-florida-claim-eating-human-flesh-cures-diabetes-depression/", "summary": "", "movies": [], "publish_date": {"$date": 1496151793000}, "source": "http://themiamigazette.com"}
