{"top_img": "http://www.learnprogress.org/wp-content/uploads/2017/02/trump_dapl_0208.jpg", "text": "CNBC reported that Trump has substantial investments in the companies involved with the construction of the pipeline. Trump’s early decision to approve the pipeline was a conflict-of-interest, and we must impeach him for it.\n\nDonald Trump’s business investments spread throughout the world. Now, we know that he has ties to the Dakota Access Pipeline, the one that crosses sacred Indian land.\n\nThe construction of the pipeline raised the ire of Native American Sioux settlements in the area. It will cross sacred land and pollute their water supply.\n\nThe pipeline is also a threat to the Missouri and Mississippi Rivers, which provide drinking water for millions of people. In addition, the two rivers provide shipping avenues for commerce through the middle of the country.\n\nOpposition to the pipeline resulted in massive protests. The protests received international coverage when police and security workers for the construction firms sprayed protestors with water and beat them.\n\nThe opposition brought out many supporters, too. On November 15, 2016, there was a National Day of Action to protest the construction. There were massive protests in cities as Los Angeles, Chicago, Denver, and Trump’s own Manhattan in support of the Sioux Nation.\n\nVeterans also went to the front lines of the protest to stand against the construction and the violence from the hired thugs. American heroes supporting Native American heroes.\n\nAnd now we learn that “President” Trump has investments in the companies building the pipelines. No wonder the Orange Fuehrer ordered the resumption of their construction as one of his first moves as president.\n\nThis should come as no surprise since Trump ‘s financial ties are everywhere. Almost daily, we hear of another financial conflict-of-interest involving the president.\n\nThis involvement is another example of Trump’s unconstitutional failure to divest himself of his businesses interests. The Tenth Amendment of the Constitution prohibits him from profiting from decisions made while president. And here it is, another unconstitutional violation.\n\nAccording to Ethics experts, Trump’s decisions to pass his businesses to his two sons is not adequate. As with other presidents, he must divest himself of all business interests and place them in a blind trust.\n\nThe blind trust would prohibit Trump from any involvement. As he wants it, his two spoiled brat sons would consult him on business decisions regularly, and he would surely lie about it.\n\nThe Dakota Pipeline investment is one of many illegal ones by Trump, but perhaps the most controversial. If only the mainstream media will pick up the story and run with it will the public know of Trump’s support of the cruel actions of the police.\n\nWe must insist that the media tell this story. With its broadcast, the public will see how Trump uses the presidency for his financial gain and support his immediate impeachment.\n\nPlease share this story on Facebook!", "authors": [], "keywords": [], "meta_data": {"description": "Trump got caught with his hand in the cookie jar.", "og": {"site_name": "Learn Progress", "description": "Trump got caught with his hand in the cookie jar.", "title": "BREAKING: Trump Caught INVESTING in Dakota Pipeline Before Signing It", "locale": "en_US", "image": {"width": 1200, "identifier": "http://www.learnprogress.org/wp-content/uploads/2017/02/trump_dapl_0208.jpg", "height": 629}, "updated_time": "2017-02-16T16:46:33-05:00", "url": "http://www.learnprogress.org/trump-caught-investing-pipeline/", "type": "article"}, "twitter": {"partner": "tfwp", "image": "http://www.learnprogress.org/wp-content/uploads/2017/02/trump_dapl_0208.jpg", "description": "CNBC reported that Trump has substantial investments in the companies involved with the construction of the pipeline. Trump’s early decision to approve the pipeline was a conflict-of-interest, and we must impeach him for it. Donald…", "card": "summary", "title": "BREAKING: Trump Caught INVESTING in Dakota Pipeline Before Signing It"}, "robots": "noodp", "article": {"publisher": "https://www.facebook.com/exposetrumpnews/", "section": "Corruption", "tag": "DAPL", "published_time": "2017-02-08T18:43:39-05:00", "modified_time": "2017-02-16T16:46:33-05:00"}, "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://www.learnprogress.org/trump-caught-investing-pipeline/", "images": ["http://rs-stripe.learnprogress.org/stripe/image?cs_email={{GUID}}&cs_stripeid=9948&cs_offset=0&cs_containertype=web&cs_esp=powerinbox_web", "https://www.facebook.com/tr?id=1173586689414819&ev=PageView&noscript=1", "http://rs-branding.learnprogress.org/recommend/web.png", "http://www.learnprogress.org/wp-content/uploads/2017/01/wp-logo.png", "http://www.learnprogress.org/wp-content/uploads/2017/02/trump_dapl_0208.jpg"], "title": "Trump Caught INVESTING in Dakota Pipeline Before Signing It", "url": "http://www.learnprogress.org/trump-caught-investing-pipeline/", "summary": "", "movies": [], "publish_date": {"$date": 1486597419000}, "source": "http://www.learnprogress.org"}
