{"top_img": "http://donaldtrumppotus45.com/wp-content/uploads/2017/01/1i7mwo-1.jpg", "text": "69.9k SHARES Share Tweet\n\nFor years, the debate has raged over whether or not to make English the official language of the United States. We all know the annoyance, NAY, the OFFENSE of having to push one for English whenever we call ANY customer support hotline, be it a U.S. corporation or a Government entity.\n\n​\n\nWell, as Harry Truman used to say, and as President Trump is putting into action, THE BUCK STOPS HERE!\n\nYou may have heard the snowflakes crying and complaining from their mothers’ basements and their D.C. prison cells, those arrested for their massive temper tantrum in our Nation’s Capital last weekend, about how President Trump‘s staff removed the GLBT portals on the WhiteHouse.Gov site. Well, they’re crying even louder now, because today, PRESIDENT TRUMP DIRECTED HIS PEOPLE TO REMOVE THE SPANISH SPEAKING AND TRANSLATING PORTALS ON THE WHITEHOUSE.GOV WEBSITE!\n\nLiberal rag L.A. Times reports:\n\nPresident Trump, who chided his opponents during the campaign for speaking Spanish, has made a tangible change to the White House website to eliminate bilingual access. The site, which the Trump administration took over on Friday, no longer includes an option for translation into Spanish… Spokesman Sean Spicer suggested the translation option may return but made no specific commitment on timing when asked about it Monday. He spoke generally about the high volume of work facing the technology team during the changeover. “We are continuing to build out the website…,” Spicer said. “We’ve got the IT folks working overtime on that now.” During a Republican primary debate, Trump lashed out at former Florida Gov. Jeb Bush when he spoke Spanish. “This is a country where we speak English,” Trump said.\n\nPresident Trump is spreading the message that we conservatives have been lamenting for years. This is America. We have a culture. We have a language. We have a set of laws and rules by which EVERYONE in this country is expected to abide.\n\nIF YOU DON’T LIKE IT- LEAVE!\n\nFollow us and help us support our President, Donald J. Trump, by joining us on our Facebook page by clicking on this highlighted sentence.", "authors": ["Larry Hanson"], "keywords": [], "meta_data": {"description": "For years, the debate has raged over whether or not to make English the official language of the United States. We all know the annoyance, NAY, the OFFE...", "generator": "WordPress 4.8.1", "og": {"site_name": "Donald Trump", "description": "For years, the debate has raged over whether or not to make English the official language of the United States. We all know the annoyance, NAY, the OFFENSE of having to push one for English", "title": "BREAKING! President Trump Makes ENGLISH The OFFICIAL LANGUAGE OF THE United States!", "url": "http://donaldtrumppotus45.com/2017/01/26/breaking-president-trump-makes-english-the-official-language-of-the-united-states/", "image": {"width": 652, "identifier": "http://donaldtrumppotus45.com/wp-content/uploads/2017/01/1i7mwo-1.jpg", "height": 343}, "updated_time": "2017-01-26T16:12:35+00:00", "type": "article"}, "twitter": {"image": "http://donaldtrumppotus45.com/wp-content/uploads/2017/01/1i7mwo-1.jpg", "description": "For years, the debate has raged over whether or not to make English the official language of the United States. We all know the annoyance, NAY, the OFFENSE of having to push one for English", "card": "summary_large_image", "title": "BREAKING! President Trump Makes ENGLISH The OFFICIAL LANGUAGE OF THE United States!"}, "propeller": "f436eefdfd4c472c59f7dda0e1303fa9", "article": {"published_time": "2017-01-26T14:27:26+00:00", "modified_time": "2017-01-26T16:12:35+00:00"}, "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://donaldtrumppotus45.com/2017/01/26/breaking-president-trump-makes-english-the-official-language-of-the-united-states/", "images": ["http://sstatic1.histats.com/0.gif?3713533&101", "http://donaldtrumppotus45.com/wp-content/uploads/2017/01/1i7mm9-1.jpg", "http://donaldtrumppotus45.com/wp-content/uploads/2017/01/1i7mwo-1.jpg"], "title": "BREAKING! President Trump Makes ENGLISH The OFFICIAL LANGUAGE OF THE United States!", "url": "http://donaldtrumppotus45.com/2017/01/26/breaking-president-trump-makes-english-the-official-language-of-the-united-states/", "summary": "", "movies": [], "publish_date": {"$date": 1485388800000}, "source": "http://donaldtrumppotus45.com"}
