{"top_img": "http://uspostman.com/wp-content/uploads/2017/03/Megyn-Kelly-Trump.jpg", "text": "Share Facebook\n\nAccording to sgsnews:\n\nNBC Just Fired Megyn Kelly Before Her New Show Begins.\n\nMegyn Kelly turned down a $20 million payday to stay with the only trusted name in news for a daytime slot where she could play a white version of Oprah Winfrey on NBC for 25 percent less money. Now that her tenure at Fox has ended and her new show is scheduled to start production sequences for a fall premiere, Kelly decided she wasn’t happy and demanded the format be changed.\n\nAccording to Hugh McGovern, executive producer of Kelly’s new show:\n\n“Megyn had high hopes when she left Fox that people would still take her seriously as a journalist. She was lured to NBC with promises of easier days and evenings at home with the family. Now that she sees the production schedule, she feels like she’s been duped and has demanded she be given more serious show assignments.”\n\nThe problem, according to McGovern, is that Kelly sees a schedule filled with visits from celebrities and novelists to talk about their sitcoms and books, traveling assignments to dog shows and fashion week and even the addition of a musical guest. According to Maxwell Seawald, CEO of NBC Universal:\n\n“Ms. Kelly wants to be a journalist. Unfortunately, after her stint at Fox News and the way she attacked President Trump, she lost her following. Our data tells us that our audience will tolerate and even learn to like her, but not as a political pundit or someone they should take seriously. She needs to think less Diane Sawyer and more Kelly Ripa.”\n\nUnfortunately, Kelly couldn’t do that and the whole thing came to a head this afternoon, causing NBC to pay a severance clause of $150K to cancel her contract. NBC spokesman Hugh Levitt told Fox News:\n\n“Megyn Kelly was a superstar until she took on Trump. Now she’s a laughing stock. She could have worked a year or two and made herself $25 million. Instead she’ll spend her days looking for someone else who needs a washed up hasbeen from Fox News who knows nothing but how to piss people off.”\n\nSorry, Megyn. It’s not like we didn’t all see this coming. Hasta la vista, baby.\n\nWhat do you think about this?\n\nShare this post and leave your comment below.\n\nLike our page on facebook.\n\nNote: We at uspostman cannot make any warranties about the completeness, reliability and accuracy of this information.\n\nSource: sgsnews", "authors": ["Us Postman"], "keywords": [], "meta_data": {"description": "According to sgsnews: NBC Just Fired Megyn Kelly Before Her New Show Begins. Megyn Kelly turned down a $20 million payday to stay with the only", "generator": "WordPress 4.7.4", "og": {"description": "According to sgsnews: NBC Just Fired Megyn Kelly Before Her New Show Begins. Megyn Kelly turned down a $20 million payday to stay with the only", "title": "NBC Just Fired Megyn Kelly Before Her New Show Begins", "locale": "en_US", "image": {"width": 1254, "identifier": "http://uspostman.com/wp-content/uploads/2017/03/Megyn-Kelly-Trump.jpg", "height": 1015}, "url": "http://uspostman.com/2017/03/nbc-just-fired-megyn-kelly-new-show-begins/", "type": "article"}, "twitter": {"image": "http://uspostman.com/wp-content/uploads/2017/03/Megyn-Kelly-Trump.jpg", "description": "According to sgsnews: NBC Just Fired Megyn Kelly Before Her New Show Begins. Megyn Kelly turned down a $20 million payday to stay with the only", "card": "summary", "title": "NBC Just Fired Megyn Kelly Before Her New Show Begins"}, "robots": "noodp", "ca_image": "http://uspostman.com/wp-content/uploads/2017/03/Megyn-Kelly-Trump-150x150.jpg", "msapplication-TileImage": "http://uspostman.com/wp-content/uploads/2016/11/cropped-SMS-Man1-270x270.jpg", "onesignal": "wordpress-plugin", "article": {"section": "News", "published_time": "2017-03-08T09:42:58+00:00"}, "ca_title": "NBC Just Fired Megyn Kelly Before Her New Show Begins", "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://uspostman.com/2017/03/nbc-just-fired-megyn-kelly-new-show-begins/", "images": ["http://uspostman.com/wp-content/uploads/2017/03/Megyn-Kelly-Trump.jpg", "http://uspostman.com/wp-content/uploads/2017/04/CyrwRCnUsAAaUy4-310x165.jpg"], "title": "NBC Just Fired Megyn Kelly Before Her New Show Begins", "url": "http://uspostman.com/2017/03/nbc-just-fired-megyn-kelly-new-show-begins/", "summary": "", "movies": [], "publish_date": {"$date": 1488966178000}, "source": "http://uspostman.com"}
