{"top_img": "http://www.floridasunpost.com/wp-content/uploads/2017/04/tampa.jpg", "text": "A 32-year old Tampa local has suffered extensive injuries to his lower body after an unconventional attempt to ‘fill a scuba tank with weed smoke’ failed spectacularly last night. According to the testimony of several witnesses, Darren Winters had consumed a copious quantity of alcohol before making the decision to demonstrate the home-made device.\n\n“Darren’s a recreational diver,” commented one of the injured man’s friends. “For some time, he’s been tinkering with an old scuba tank that he’d bought cheaply from a dive shop. His plan was to use an air compressor to feed smoke into the tank, and then use a scuba regulator to inhale it.”\n\nMr Winters invited a number of his friends over to his residence, an apartment in Ybor, telling them he’d finally perfected what he called his ‘scuba bong’. “Clearly it wasn’t a bong at all,” pointed out one of his friends when interviewed by local journalists, “but he was so enamoured with that name we thought best not to correct him.”\n\nWhen his friends assembled at Mr Winter’s residence, they found him heavily intoxicated. “He’d had a number of celebratory drinks before we arrived, as he was so delighted to finally have his ‘scuba bong’ up and running.” With his friends present, Mr Winters proceeded to offer a demonstration of the home-made device in action. This is the point that everything went horribly wrong.\n\nAccording to the witnesses, Mr Winters was attempting to reattach the air compressor when he stumbled, knocking the scuba tank off a workbench and onto the concrete floor. “The tank basically exploded after [Winters] knocked it over,” commented one of the witnesses. None of Winter’s friends were injured, but the blast from the ruptured tank sent shrapnel flying directly into his lower body.\n\nWinter’s friends quickly phoned for an ambulance and he was rushed to hospital, where surgeons spent over eight hours treating his extensive wounds. His condition has now been downgraded from ‘critical’ to ‘serious’, but medical staff announced they’d been unable to save his testicles which had been ‘cleanly severed’ by a shard of metal.\n\nPreliminary investigations have identified that the scuba tank used by Winters may be banned from dive use throughout the US. “This tank was manufactured prior to 1992 and made of a type aluminium alloy that is known to have a high risk of fracturing,” commented the lead investigator on the case. “We regularly audit dive shops in Tampa to ensure these tanks are not being sold; however, the ban only extends to using the tank when diving. If [Winters] purchased the tank for the purpose of inhaling cannabis, the retailer has technically not breached the law.”\n\nThis news will be little comfort to Mr Winters, who will likely be unable to file for compensation against the business that sold him the defective tank. The young man faces a long recovery, but his associates shared their optimism that he would pull through. “He’s one of the toughest guys I know,” commented one of Mr Winter’s friends. “He’ll take the fact he won’t be able to have kids pretty hard, though.”\n\nCorrection: An earlier version of this post stated the victim was unemployed. Mr Winters is actually employed on a part-time basis at a Tampa pizza restaurant. We regret the error.\n\nIn other news making headlines, a 68-year old man from Decatur in Northern Alabama has discovered that his new bride is actually his own grand-daughter. The couple have no plans to divorce.", "authors": [], "keywords": [], "meta_data": {"generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "og": {"site_name": "Florida Sun Post", "description": "A 32-year old Tampa local has suffered extensive injuries to his lower body after an unconventional attempt to ‘fill a scuba tank with weed smoke’ failed spectacularly last night. According to the testimony of several witnesses, Darren Winters had consumed a copious quantity of alcohol before making the decision to demonstrate the home-made device. “Darren’s a …", "title": "Tampa man loses testicles after trying to 'fill scuba tank with weed smoke'", "locale": "en_US", "image": {"width": 681, "identifier": "http://www.floridasunpost.com/wp-content/uploads/2017/04/tampa.jpg", "height": 381}, "updated_time": "2017-06-17T01:48:20+00:00", "url": "http://www.floridasunpost.com/tampa-man-loses-testicles-trying-fill-scuba-tank-weed-smoke/", "type": "article"}, "twitter": {"image": "http://www.floridasunpost.com/wp-content/uploads/2017/04/tampa.jpg", "description": "A 32-year old Tampa local has suffered extensive injuries to his lower body after an unconventional attempt to ‘fill a scuba tank with weed smoke’ failed spectacularly last night. According to the testimony of several witnesses, Darren Winters had consumed a copious quantity of alcohol before making the decision to demonstrate the home-made device. “Darren’s a […]", "card": "summary", "title": "Tampa man loses testicles after trying to 'fill scuba tank with weed smoke'"}, "msapplication-TileImage": "http://www.floridasunpost.com/wp-content/uploads/2017/06/favicon-300x300.png", "article": {"section": "News", "published_time": "2017-05-29T02:26:05+00:00", "modified_time": "2017-06-17T01:48:20+00:00"}, "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://www.floridasunpost.com/tampa-man-loses-testicles-trying-fill-scuba-tank-weed-smoke/", "images": ["http://www.floridasunpost.com/wp-content/uploads/2017/06/180x150.png", "http://www.floridasunpost.com/wp-content/uploads/2017/06/mainlogo.png", "http://www.floridasunpost.com/wp-content/uploads/2017/04/tampa.jpg"], "title": "Tampa man loses testicles after trying to 'fill scuba tank with weed smoke'", "url": "http://www.floridasunpost.com/tampa-man-loses-testicles-trying-fill-scuba-tank-weed-smoke/", "summary": "", "movies": [], "publish_date": {"$date": 1496024765000}, "source": "http://www.floridasunpost.com"}
