{"top_img": "http://usasnich.com/wp-content/uploads/2016/12/919-696x364.jpg", "text": "BREAKING!\n\nLiberal rag Huffington Post is really running with this story from The Washington Post about the CIA “confirming” Russian interference in the presidential election.\n\nThey’re saying if 100% true, the courts can PUT HILLARY IN THE WHITE HOUSE!\n\nScary!\n\nFrom HuffPo:\n\nA 1995 federal court ruling out of Pennsylvania may offer some clues to Clinton supporters as to possible legal authority for removing an elected official from office and replacing them with their erstwhile opponent.\n\nIn light of late-breaking reports Friday evening that Russians interfered with the 2016 presidential election to assist Donald Trump’s victory, Clinton supporters are furiously in pursuit of remedies.\n\nAt 10:45 p.m. Friday evening, the Washington Post broke an explosive story alleging that Russians had interfered with the 2016 presidential election in order to assist Donald Trump in a victory over democratic candidate Hillary Clinton. The story reveals that a CIA assessment detailing this conclusion had been presented to President Obama and top congressional leaders last week.\n\nThe development has Clinton supporters and other concerned Americans confused and hot in pursuit of potential remedies. No clear constitutional remedy exists to halt the certification of the outcome. Article II of the U.S. Constitution vests Congress with the power to determine the date by which the Electoral College will cast their votes, presently set for December 19. In recent weeks, a massive online movement asking members of the Electoral College to become “faithless” or “conscientious” electors and to vote for Clinton instead of Trump has garnered national attention.\n\nThe electors would be well within their constitutional authority to do so, say groups like Hamilton’s Electors, which claims that the purpose of the Electoral College is to prevent demagogues like Mr. Trump from assuming the nation’s highest office. A petition urging the Electoral College to make Hillary Clinton president has gained nearly 5 million signatures.\n\nProponents of this strategy are concerned, with good reason, about the likelihood it will succeed. With Donald Trump having won 306 Electoral College votes, 37 Republican electors would need to switch their votes to Clinton, a tall order, and in the event that no one candidate has 270 electoral votes, the decision would go to the Republican-controlled House of Representatives.", "authors": [], "keywords": [], "meta_data": {"og": {"site_name": "USA Snich", "description": "BREAKING! Liberal rag Huffington Post is really running with this story from The Washington Post about the CIA “confirming” Russian", "title": "BREAKING: PUTIN INTERFERENCE COULD GIVE COURTS LEGAL RIGHT TO MAKE HILLARY PRESIDENT", "locale": "en_US", "image": "http://usasnich.com/wp-content/uploads/2016/12/919-696x364-300x225.jpg", "url": "http://usasnich.com/breaking-putin-interference-could-give-courts-legal-right-to-make-hillary-president/", "type": "article"}, "article": {"section": "NEWS", "published_time": "2016-12-11T14:03:24-04:00"}, "twitter": {"image": "http://usasnich.com/wp-content/uploads/2016/12/919-696x364.jpg", "description": "BREAKING! Liberal rag Huffington Post is really running with this story from The Washington Post about the CIA “confirming” Russian", "card": "summary", "title": "BREAKING: PUTIN INTERFERENCE COULD GIVE COURTS LEGAL RIGHT TO MAKE HILLARY PRESIDENT"}, "generator": "WordPress 4.7.5", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://usasnich.com/breaking-putin-interference-could-give-courts-legal-right-to-make-hillary-president/", "images": ["http://usasnich.com/wp-content/uploads/2016/12/919-696x364.jpg", "http://usasnich.com/wp-content/plugins/facebook-button-plugin/images/standard-facebook-ico.png"], "title": "PUTIN INTERFERENCE COULD GIVE COURTS LEGAL RIGHT TO MAKE HILLARY PRESIDENT", "url": "http://usasnich.com/breaking-putin-interference-could-give-courts-legal-right-to-make-hillary-president/", "summary": "", "movies": [], "publish_date": {"$date": 1481479404000}, "source": "http://usasnich.com"}
