{"top_img": "https://world-politicus.com/wp-content/uploads/2017/07/83496164_8d24ad50-423e-4bd9-8863-349deaa1ce01.jpg", "text": "62.1k SHARES Share\n\nObama is a shadow president that will not leave the current administration alone. He has been doing everything he can to mess up what Trump is doing. And being a liberal elite, he can get away with it. Everywhere President Donald Trump goes, Obama shows up too. A little odd, no? This concerning practice has gotten on the last nerve of the Trump administration and it shows that they are concerned with what Obama is trying to do. Obama needs to realize that he is no longer the president, no matter how much he wants to be.\n\nObama first went to Italy when Trump was there to try to disrupt what was going on there. Does he not know when to give up? It seems like now is as good a time as any. Obama’s administration is currently under investigation for many criminal actions they did while in office. Maybe he wants to try to deflect all of the negative press about him to Trump, like he so often does. But this last on was truly an Obama move.\n\nThe liberal media has been attacking the Trump administration for the hotel accommodations snafu that caused them to be without a hotel for awhile. But as it turns out, that was actually the Obama administration’s problem, not Trumps. So he is getting blamed for something that is clearly not his fault yet again. That is what conservatives have gotten used to over the years. Apparently liberals can do no wrong. When will the mainstream media report on that?\n\n“The funny thing,” a White House official said, “is that the United States delegation probably also would not have had hotel rooms if Hillary Clinton had become president. It was already too late by Election Day.”\n\n“But I bet even if Hillary had to sleep in a youth hostel,” he went on, “no one in the press would say it was her staffs’ fault.”\n\nThat is the double standard that we have to live with as Americans and it will not get any better. What do you think about this whole mess?\n\n(h/t Young Conservatives)", "authors": [], "keywords": [], "meta_data": {"generator": "WordPress 4.8.1", "og": {"site_name": "World Politicus", "description": "Obama is a shadow president that will not leave the current administration alone. He has been doing everything he can to mess up what Trump is doing. And being a liberal elite, he can get away with it. Everywhere President Donald Trump goes, Obama shows up too. A little odd, no? This concerning practice has …", "title": "Obama Appears In Germany For G20 Pretending To Be The President", "locale": "en_US", "image": {"width": 660, "identifier": "https://world-politicus.com/wp-content/uploads/2017/07/83496164_8d24ad50-423e-4bd9-8863-349deaa1ce01.jpg", "height": 371}, "url": "https://world-politicus.com/2017/07/08/obama-goes-g20-summit/", "type": "article"}, "twitter": {"image": "https://world-politicus.com/wp-content/uploads/2017/07/83496164_8d24ad50-423e-4bd9-8863-349deaa1ce01.jpg", "description": "Obama is a shadow president that will not leave the current administration alone. He has been doing everything he can to mess up what Trump is doing. And being a liberal elite, he can get", "card": "summary_large_image", "title": "Obama Goes To G20 Summit"}, "fb": {"app_id": 470850996602008, "pages": 862847370480630}, "article": {"section": "Politics", "published_time": "2017-07-08T00:40:00+00:00"}, "ia": {"markup_url": "https://world-politicus.com/2017/07/08/obama-goes-g20-summit/?ia_markup=1"}, "google-site-verification": "0GwCTA7maatAsmeHZMLjU2B0S7knQFdZkv8Icky_uH8", "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "https://world-politicus.com/2017/07/08/obama-goes-g20-summit/", "images": ["https://world-politicus.com/wp-content/uploads/2017/06/WORLDPOLITICUSv3-800px-300x129.png", "https://world-politicus.com/wp-content/uploads/2017/07/96221800_obama_arrives_sun-1-218x150.jpg", "https://world-politicus.com/wp-content/uploads/2017/07/83496164_8d24ad50-423e-4bd9-8863-349deaa1ce01.jpg", "https://world-politicus.com/wp-content/uploads/2017/06/Barack-Obama-218x150.png", "https://world-politicus.com/wp-content/uploads/2017/07/mccain-1-218x150.jpg"], "title": "Obama Goes To G20 Summit", "url": "https://world-politicus.com/2017/07/08/obama-goes-g20-summit/", "summary": "", "movies": [], "publish_date": {"$date": 1499472000000}, "source": "https://world-politicus.com"}
