{"top_img": "http://politicono.com/wp-content/uploads/2016/04/16688738525_e8f6703b04_o.jpg", "text": "Mike Pence said he didn’t understand why Michelle Obama had so passionately condemned his running mate, Donald Trump, for boasting about forcibly grabbing women by their genitals. The First Lady denounced the Republican presidential nominee, although she never dismissively spoke his name, for “speaking freely and openly about sexually predatory behavior” – which she said had “shaken (her) to the core.”\n\n“First and foremost,” Pence argued, “I have no idea why Mrs. Obama, who will be departing the White House shortly, is even commenting on the future President of the United States, God-willing. That’s the first thing I don’t quite get. Secondly, if she’s the First Lady, shouldn’t she be focused on doing whatever it is that First Ladies are supposed to be doing as their duties while their husbands are rescuing the world? What’s she doing commenting on and obviously worrying about her successor? That’s not what she should be doing.”\n\nThe governor of Indiana also said that she “has no business” commenting on men and their “restroom talk,” as well as that that’s not “ladylike behavior.” “Now, I know that the word ‘lady’ is kind of in her job description, but it looks to me she’s not behaving like one, at least as of late,” he said. “If she was a real lady, she wouldn’t be commenting on men’s restroom talk and neglecting her own work and duties just so she could get a word out on a topic that she finds interesting for some reason.”\n\nHe continued, “If we had anyone else serving as the first lady, they would pretend like they hadn’t heard it and would be going about their business in a normal fashion. But no, Michelle Obama is so vulgar she’s not only being vocal about it, but she’s also convinced that her job title will add weight and significance to her words. And she may be fooling those who can’t see through her smoke screen, but the rest of us have her figured out. She can’t fool me, just like she can’t fool Donald Trump or any other conservative American who has the guts to think for himself.”\n\n“How many times do I have to repeat the fact that what he did and the language he used was just restroom talk?” Pence asked. “He has apologized for it several times, and I really don’t know what else people want him to do. And now you have countless media outlets spearheaded by the New York Times who are calling Donald a sexual predator. And as if that wasn’t enough, the first lady also thinks she’s ordinary enough to be commenting on the issue as well. That’s just ridiculous.”\n\n“There is no way in hell Michelle Obama isn’t working with the New York Times in a joint effort to smear the good name of Donald Trump, if you ask me. I refuse to believe all of these women who are popping up out of nowhere with stories that Donald Trump had sexually assaulted them are a random occurrence. This is too well organized to be an accident. And the entire Democratic Party is behind it, with the addition of their latest recruit, the soon-to-be ex-first lady Michelle Obama. And I’m actually glad that’s the case because when Donald wins, we’ll offer all of them a job just for the fun of it,” Pence concluded.", "authors": ["Alex Stevan"], "keywords": [], "meta_data": {"description": "satire, satire article, satire news, satire palin, satire politics, satirical news", "generator": "WordPress 4.8", "og": {"site_name": "Newslo", "description": "“This is too well organized to be an accident. And the entire Democratic Party is behind it, with the addition of their latest recruit, the soon-to-be ex-first lady Michelle Obama”", "title": "Pence: “Michelle Obama Is The Most Vulgar First Lady We’ve Ever Had”", "locale": "en_US", "image": {"width": 673, "identifier": "http://politicono.com/wp-content/uploads/2016/04/16688738525_e8f6703b04_o.jpg", "height": 382}, "updated_time": "2017-07-11T02:20:08+00:00", "url": "http://politicono.com/pence-michelle-obama-vulgar-first-lady-weve-ever/", "type": "article"}, "fb": {"app_id": 395152810558131}, "article": {"publisher": "https://www.facebook.com/Newslo1", "section": "DC", "published_time": "2016-10-14T18:09:28+00:00", "modified_time": "2017-07-11T02:20:08+00:00"}, "verifyownership": "b03b12e9fdf4f032d48fc78bfadcdc32", "viewport": "width=device-width; initial-scale=1"}, "canonical_link": "http://politicono.com/pence-michelle-obama-vulgar-first-lady-weve-ever/", "images": ["http://t.co/i/adsct?txn_id=l4mpm&p_id=Twitter", "http://politicono.com/wp-content/uploads/2015/03/Dakota_Meyer_with_President_Obama-150x150.jpg", "http://politicono.com/wp-content/uploads/2015/07/thousands_protest_against_anti_gay_Charles-Worley-150x150.jpg", "http://politicono.com/wp-content/uploads/2016/06/hqdefault.jpg", "http://politicono.com/wp-content/uploads/2016/09/eric-trump-150x150.jpg", "http://politicono.com/wp-content/uploads/2014/06/130729170454-lead-intv-ted-cruz-full-00060416-story-top-150x150.jpg", "https://analytics.twitter.com/i/adsct?txn_id=l4mpm&p_id=Twitter", "http://politicono.com/wp-content/uploads/2016/04/16688738525_e8f6703b04_o-645x325.jpg", "http://politicono.com/wp-content/uploads/2012/09/sarah-palin-reality-show-150x150.jpg", "http://politicono.com/wp-content/uploads/2016/04/16688738525_e8f6703b04_o.jpg"], "title": "Pence: “Michelle Obama Is The Most Vulgar First Lady We’ve Ever Had”", "url": "http://politicono.com/pence-michelle-obama-vulgar-first-lady-weve-ever/", "summary": "", "movies": [], "publish_date": {"$date": 1476468568000}, "source": "http://politicono.com"}
