{"top_img": "http://static.lakana.com/media.fox5dc.com/photo/2016/08/25/Still0825_00018_1472181382501_1917472_ver1.0_640_360.jpg", "text": "Seth Rich Seth Rich\n\n- EDITOR'S NOTE (5/17/17): We want to update you on a story you first saw on FOX 5 DC. We want to make an important clarification on claims that were made by Rod Wheeler, the private investigator hired by Seth Rich's family, whose services are being paid for by a third party.\n\nWhat he told FOX 5 DC on camera Monday regarding Seth Rich's murder investigation is in clear contrast to what he has said over the last 48 hours. Rod Wheeler has since backtracked.\n\nIn an interview Monday, Wheeler told FOX 5 DC he had sources at the FBI confirming there was evidence of communication between Seth Rich and WikiLeaks. This is the verbatim of that exchange:\n\nFOX 5 DC: “You have sources at the FBI saying that there is information...”\n\nWHEELER: \"For sure...\"\n\nFOX 5 DC: “...that could link Seth Rich to WikiLeaks?\"\n\nWHEELER: \"Absolutely. Yeah. That's confirmed.\"\n\nIn the past 48 hours, Rod Wheeler has told other media outlets he did not get his information from FBI sources, contradicting what he told us on Monday.\n\nSince Rod Wheeler backtracked Tuesday, FOX 5 DC attempted incessantly to communicate with him, but he didn't return calls or emails.\n\nOn Wednesday, just before our newscast, Wheeler responded to our requests via a telephone conversation, where he now backtracks his position and Wheeler characterizes his on-the-record and on-camera statements as \"miscommunication.\"\n\nWhen asked if Wheeler is still working for Seth Rich's family, Wheeler told FOX 5 DC the contract still stands-- ties have not been severed.\n\nWe reached out once again to the Rich family, and through a spokesperson the Rich family tells FOX 5 DC, \"The family has relayed their deep disappointment with Rod Wheeler's conduct over the last 48 hours, and is exploring legal avenues to the family.\"\n\n-----------------------------------------------------------------------------------------------------------------\n\nOriginal story:\n\nIt has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now.\n\nRich was shot and killed last July in Northwest D.C and police have suggested the killing in the District's Bloomingdale neighborhood was a botched robbery. However, online conspiracy theories have tied the murder to Rich's work at the DNC.\n\nJust two months shy of the one-year anniversary of Rich's death, FOX 5 has learned there is new information that could prove these theorists right.\n\nRod Wheeler, a private investigator hired by the Rich family, suggests there is tangible evidence on Rich's laptop that confirms he was communicating with WikiLeaks prior to his death. Wheeler's services were offered to the family and paid for by a third party, according to a statement issued by the Rich family Tuesday which also includes that \"the private investigator who spoke to press was offered to the Rich family and paid for by a third party, and contractually was barred from speaking to press or anyone outside of law enforcement or the family unless explicitly authorized by the family.\"\n\nNow, questions have been raised on why D.C. police, the lead agency on this murder investigation for the past ten months, have insisted this was a robbery gone bad when there appears to be no evidence to suggest that.\n\nWheeler, a former D.C. police homicide detective, is running a parallel investigation into Rich’s murder. He said he believes there is a cover-up and the police department has been told to back down from the investigation.\n\n\"The police department nor the FBI have been forthcoming,” said Wheeler. “They haven't been cooperating at all. I believe that the answer to solving his death lies on that computer, which I believe is either at the police department or either at the FBI. I have been told both.”\n\nWhen we asked Wheeler if his sources have told him there is information that links Rich to Wikileaks, he said, “Absolutely. Yeah. That's confirmed.\"\n\nWheeler also told us, \"I have a source inside the police department that has looked at me straight in the eye and said, ‘Rod, we were told to stand down on this case and I can’t share any information with you.’ Now, that is highly unusual for a murder investigation, especially from a police department. Again, I don’t think it comes from the chief’s office, but I do believe there is a correlation between the mayor's office and the DNC and that is the information that will come out [Tuesday].\n\nWheeler told FOX 5 that he will provide us with a full report with the new details.\n\nFOX 5's Melanie Alnwick spoke with D.C. Police on Tuesday and was told that Wheeler’s assertion that a source inside the department told him that detectives were instructed to stand down regarding the Rich case was false.\n\nThe family sent Alnwick a statement on Tuesday with the following statement:\n\n\"As we've seen through the past year of unsubstantiated claims, we see no facts, we have seen no evidence, we have been approached with no emails and only learned about this when contacted by the press. Even if tomorrow, an email was found, it is not a high enough bar of evidence to prove any interactions as emails can be altered and we've seen that those interested in pushing conspiracies will stop at nothing to do so. We are a family who is committed to facts, not fake evidence that surfaces every few months to fill the void and distract law enforcement and the general public from finding Seth's murderers. The services of the private investigator who spoke to press was offered to the Rich family and paid for by a third party, and contractually was barred from speaking to press or anyone outside of law enforcement or the family unless explicitly authorized by the family.\"\n\nPREVIOUS COVERAGE ON THE SETH RICH MURDER INVESTIGATION:\n\nFamily of DNC staffer Seth Rich seeking to raise money to help solve his murder\n\nRepublican lobbyist says murder of DNC staffer Seth Rich linked to Russian operatives\n\nMother of murdered DNC staffer Seth Rich pleads for public's help\n\nRepublican lobbyist offers $100K reward in murder of Democratic National Committee staffer Seth Rich\n\nWikiLeaks offers $20K reward in murder of DNC staffer Seth Rich\n\nWikiLeaks founder addresses death of DNC staffer Seth Rich in Fox News interview\n\nComments by Julian Assange fuel speculation that murdered DNC staffer may have been WikiLeaks source\n\nWhat happened during final hours slain DNC employee Seth Rich was alive?\n\nParents of slain DNC employee make emotional plea to help find son's killer\n\nDNC honors murdered staffer Seth Rich with memorial bike rack outside of headquarters\n\nVigil held for slain DNC staffer in Bloomingdale\n\nDNC employee fatally shot in Northwest DC", "authors": [], "keywords": [], "meta_data": {"description": "It has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now.", "author": "FOX", "og": {"site_name": "WTTG", "description": "It has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now.", "title": "Family's private investigator: There is evidence Seth Rich had contact with WikiLeaks prior to death", "locale": "en_US", "image": {"width": 640, "identifier": "http://static.lakana.com/media.fox5dc.com/photo/2016/08/25/Still0825_00018_1472181382501_1917472_ver1.0_640_360.jpg", "height": 360}, "url": "http://www.fox5dc.com/news/local-news/254852337-story", "type": "article"}, "twitter": {"domain": "http://www.fox5dc.com", "description": "It has been almost a year since Democratic National Committee staffer Seth Rich was murdered in the nation's capital. There have been no solid answers about why he was killed until now.", "title": "Family's private investigator: There is evidence Seth Rich had contact with WikiLeaks prior to death", "image": {"src": "http://static.lakana.com/media.fox5dc.com/photo/2016/08/25/Still0825_00018_1472181382501_1917472_ver1.0_640_360.jpg"}, "creator": "WTTG", "site": "WTTG", "card": "summary_large_image"}, "fb": {"app_id": 1694671004102624}, "keywords": "Local News,News,Mobile main app feed,Facebook Instant,DC News,Marina Marraco's stories", "viewport": "width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"}, "canonical_link": "http://www.fox5dc.com/news/local-news/254852337-story", "images": ["http://static.lakana.com/media.fox5dc.com/photo/2016/08/25/Still0825_00018_1472181382501_1917472_ver1.0_640_360.jpg", "http://www.fox5dc.com/fox-main-theme/images/loading.gif", "https://cdn.relaymedia.com/ping?url=http%3A%2F%2Fwww.fox5dc.com%2Fnews%2Flocal-news%2F254852337-story", "http://static.lakana.com/lakana-fox-global/theme/images/wttg/placeholder-16x9.jpg", "http://static.lakana.com/lakana-fox-global/theme/images/wttg/logo-fox-5-washington-dc-wttg-alt.png"], "title": "Family's private investigator: There is evidence Seth Rich had contact with WikiLeaks prior to death - Story", "url": "http://www.fox5dc.com/news/local-news/254852337-story", "summary": "", "movies": [], "publish_date": null, "source": "http://www.fox5dc.com"}
