{"top_img": "http://royalcolumn.com/wp-content/uploads/2017/06/x4ujzdtn9uoh3jepyza5zg.png", "text": "When Donald Trump proposed in 2015 that we place a temporary ban on Muslims entering the United States, it was at a time when Europe was experiencing historical levels of migrations and terrorism. ISIS was carrying out terrorist attacks weekly and hundreds of innocent people were getting killed.\n\nWhether it was a jihadi running over 85 people with a truck, the Paris bombings, or even the German priest that was beheaded for being a Christian–they all were fueled by Islam. People need to understand that Islam is very dangerous and contradicts everything we believe in the United States.\n\nA Georgia state legislator has introduced legislation that would ban burqas and traditional Muslim veils.\n\nState Rep. Jason Spencer (R) filed legislation on Wednesday that would prevent women from posing for driver’s license photos while wearing a veil. The measure also adds burqas to a law that makes it a misdemeanor to wear a face covering in public or while driving.\n\nSpencer argues that this bill is specifically intended to reduce fear about Islamic terrorism. Spencer’s bill would prevent women from wearing head coverings while driving or while walking down a public sidewalk.\n\n“This bill is simply a response to constituents that do have concerns of the rise of Islamic terrorism, and we in the State of Georgia do not want our laws used against us,” Spencer told WSB-TV in Atlanta.\n\nMany people will immediately read this and argue that the First Amendment allows for protection of religious freedoms, and that is a true and correct argument. Our Constitution does allow all citizens to practice whatever religion they choose.\n\nHere is the problem: Islam is not a religion. It is a cancerous disease that calls for all Christians, women, and homosexuals to be brutally murdered for the false god Allah. A vast majority of terrorist attacks are carried out in the name of Allah. When was the last time we experienced a terrorist attack from someone citing the Bible?\n\nQuran 8:12: I will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them.\n\nI will cast terror into the hearts of those who disbelieve. Therefore strike off their heads and strike off every fingertip of them. Quran 9:29: Fight against those who believe not in Allah, nor in the Last Day, nor forbid that which has been forbidden by Allah and His Messenger and those who acknowledge not the religion of truth (i.e. Islam) among the people of the Scripture (Jews and Christians), until they pay the Jizya with willing submission, and feel themselves subdued.\n\nFight against those who believe not in Allah, nor in the Last Day, nor forbid that which has been forbidden by Allah and His Messenger and those who acknowledge not the religion of truth (i.e. Islam) among the people of the Scripture (Jews and Christians), until they pay the Jizya with willing submission, and feel themselves subdued. Quran 3:151: Soon shall We cast terror into the hearts of the Unbelievers, for that they joined companions with Allah, for which He had sent no authority.\n\nIs that what we want to blossom in our country, schools, and communities?\n\nJust for starters, Liberals already banned school prayer because Christian values may offend someone–so how is this any different?\n\nThere is a difference between a hijab and burqa. Spencer is arguing that we should ban the full-on cover that cloaks women from head to toe.\n\nWhile Liberals will decry this action, they better accept it because it will have a snowball effect in the United States. Outside of Georgia, several other states are starting to propose similar legislation.\n\nThe threat of Islam and those that practice it are so severe that France and Belgium have banned burqas and similar coverings altogether to try and keep citizens safe. Local governments in Italy, Spain, and Switzerland have also instituted bans.", "authors": [], "keywords": [], "meta_data": {"ca_title": "GEORGIA BECOMES FIRST STATE TO BAN MUSLIM CULTURE IN HISTORIC MOVE TO RESTORE WESTERN VALUES!!!", "generator": "WordPress 4.7.3", "viewport": "width=device-width, initial-scale=1", "ca_image": "http://news4everyday.com/wp-content/uploads/2017/06/image-42-660x330-150x150.jpeg"}, "canonical_link": "http://news4everyday.com/2017/06/26/georgia-becomes-first-state-to-ban-muslim-culture-in-historic-move-to-restore-western-values/", "images": ["http://news4everyday.com/wp-content/uploads/2017/08/caitlyn-bathroom-150x150.jpg", "http://royalcolumn.com/wp-content/uploads/2017/06/x4ujzdtn9uoh3jepyza5zg.png", "http://news4everyday.com/wp-content/uploads/2017/08/Screenshot_2-150x150.png", "http://news4everyday.com/wp-content/uploads/2017/08/benji-taylor-150x150.png", "http://news4everyday.com/wp-content/uploads/2017/06/image-42-660x330.jpeg"], "title": "GEORGIA BECOMES FIRST STATE TO BAN MUSLIM CULTURE IN HISTORIC MOVE TO RESTORE WESTERN VALUES!!! – News 4 Everyday", "url": "http://news4everyday.com/2017/06/26/georgia-becomes-first-state-to-ban-muslim-culture-in-historic-move-to-restore-western-values/", "summary": "", "movies": [], "publish_date": {"$date": 1498435200000}, "source": "http://news4everyday.com"}
