{"top_img": "http://uspoln.com/wp-content/uploads/2017/04/Sean-Spicer-645x325-1.jpg", "text": "During a Monday press conference that media outlets were banned from airing, White House Press Secretary Sean Spicer announced that the president was sending “thoughts and prayers” to the victims of an alleged terrorist attack in London and to the families of seven dead U.S. sailors. Spicer defended the ban on broadcasting the briefing by noting that President Donald Trump had already appeared on camera on Monday for several minutes, although he took no questions. Spicer also said that the president had confidence in all the members of the Justice Department, including Special Counsel Robert Mueller, who is reportedly investigating the president for obstruction of justice. He also insisted that Trump has the power to fire Mueller if necessary. “If you serve at the pleasure of the president, you serve at the pleasure of the president,” he said. “That is a fact.”\n\nAsked by several reporters to clarify the full extent of the president’s power, or in other words, its limitations – if they exist – Spicer argued that the Constitution “clearly states” what the President of the United States can and cannot do. “However,” he added, “one must also recognize the fact that our Constitution was written quite a while ago and, as such, isn’t ideal when it comes to facing the issues that plague the American society nowadays. One of those issues is also the limit of the president’s power. Just like our language and many other things that are typically American, our Constitution is also a living thing that changes and evolves as time goes by. And if it doesn’t do so on its own, then it has us, the people of America, to help it. However, seeing how the people already have more than enough on their plate these days, the president has decided not to bother you folks with such boring decisions.”\n\nSpicer continued, “As a result, the president of the country nowadays has very different legal and executive abilities than those of many of his predecessors, especially some of the first ones like George Washington or Thomas Jefferson. As a matter of fact, in order to be able to deal with the problems of today, which vary incredibly compared to ones that existed when the Constitution was written, Donald Trump has incomparably more power than any other president in the history of our country. In other words, there’s a real need to follow the aforementioned ‘if you serve at the pleasure of the president, you serve at the pleasure of the president’ rule. For example, President Trump not only has the power to fire Robert Mueller; he also has the legal ability and right to cancel and disband the Supreme Court of the United States as well, should he feel the need for it. And no one could argue with such a decision.”\n\n“This is something that’s necessary in order to cope with the daily problems and disasters that go with the territory of living in a technologically advanced time. To make things perfectly clear once again: this is not something that’s exclusive to just Donald Trump; whoever succeeds him as president will also have a slightly higher level of power, because this power is linked to the position, not the man in the position. It is today a requirement as much as it is a logical order of events. It is important that we evolve with the times and not be stuck in the past while everyone else goes past us. We need to retain the proactively flexible approach to life that has been our trademark for so long. That goes especially for interpreting the Constitution of the United States,” Spicer concluded./politicops.com\n\nComments\n\ncomments", "authors": [], "keywords": [], "meta_data": {"generator": "WordPress 4.8.1", "og": {"site_name": "USPOLN", "description": "During a Monday press conference that media outlets were banned from airing, White House Press Secretary Sean Spicer announced that the president was sending “thoughts and prayers” to the victims of an alleged terrorist attack in London and to the families of seven dead U.S. sailors. Spicer defended the ban on broadcasting the briefing by …", "title": "Spicer: “Trump Has The Legal Right To Cancel SCOTUS Because They Serve At His Pleasure”", "locale": "en_US", "image": {"width": 645, "identifier": "http://uspoln.com/wp-content/uploads/2017/04/Sean-Spicer-645x325-1.jpg", "height": 325}, "url": "http://uspoln.com/2017/06/21/spicer-trump-legal-right-cancel-scotus-serve-pleasure/", "type": "article"}, "twitter": {"image": "http://uspoln.com/wp-content/uploads/2017/04/Sean-Spicer-645x325-1.jpg", "description": "During a Monday press conference that media outlets were banned from airing, White House Press Secretary Sean Spicer announced that the president was sending “thoughts and prayers” to the victims of an alleged terrorist attack in London and to the families of seven dead U.S. sailors. Spicer defended the ban on broadcasting the briefing by […]", "card": "summary", "title": "Spicer: “Trump Has The Legal Right To Cancel SCOTUS Because They Serve At His Pleasure”"}, "fb": {"app_id": 1112629802167457}, "article": {"publisher": "https://facebook.com/uspoln/", "section": "POLITICS", "published_time": "2017-06-21T01:59:21+00:00"}, "viewport": "user-scalable=yes, width=device-width, initial-scale=1.0, maximum-scale=1"}, "canonical_link": "http://uspoln.com/2017/06/21/spicer-trump-legal-right-cancel-scotus-serve-pleasure/", "images": ["http://uspoln.com/wp-content/uploads/2017/07/Buzz-Aldrin-645x325-380x260.jpg", "http://uspoln.com/wp-content/uploads/2017/06/craig-cobb-white-supremacist-souls-of-black-women-645x325-1-375x195.jpg", "http://uspoln.com/wp-content/uploads/2017/04/Sean-Spicer-645x325-1.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Cop-1-145x100.jpg", "http://uspoln.com/wp-content/uploads/2017/02/sarah-palin-645x325-380x260.png", "http://uspoln.com/wp-content/uploads/2017/07/Cop-1-380x260.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Trey-Gowdy-645x325-380x260.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Trey-Gowdy-645x325-145x100.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Brennan-640x360-380x260.jpg", "http://uspoln.com/wp-content/uploads/2017/04/Sean-Spicer-645x325-375x195.jpg", "http://uspoln.com/wp-content/uploads/2017/02/sarah-palin-645x325-145x100.png", "http://uspoln.com/wp-content/uploads/2017/07/paul-ryan-645x325-145x100.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Brennan-640x360-145x100.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Buzz-Aldrin-645x325-145x100.jpg"], "title": "“Trump Has The Legal Right To Cancel SCOTUS Because They Serve At His Pleasure”", "url": "http://uspoln.com/2017/06/21/spicer-trump-legal-right-cancel-scotus-serve-pleasure/", "summary": "", "movies": [], "publish_date": {"$date": 1498003200000}, "source": "http://uspoln.com"}
