{"top_img": "https://obnoxioustv.files.wordpress.com/2013/03/20130305-000628.jpg", "text": "New York Man Wanted For Infecting 240 Men And Women With HIV!!!\n\n\n\n\n\nThis will blow your mind…Read how a New York man has allegedly infected 240 people with the HIV virus by sleeping with men and women.\n\n“I met Stephawn when I was 19 years old,” explains Joshua Johnson on his blog.\n\nHe continues:\n\n“At 19, I was still trying to figure out my sexual orientation. I was still a virgin, because I was raised with traditional values. I was attracted to females, but I was also attracted to men. In fact, my attraction to men was stronger. I desperately tried to fight my attraction to the same sex, because I knew if I gave in that would mean a lifetime as an outcast in my family.\n\nJohnson goes on to explain in great detail how he fell victim to a sexually promiscuous fugitive who is wanted for allegedly infecting at least 240 people with the HIV virus that causes AIDS.\n\nLadies, as you read Joshua’s story below, keep in mind that black women are the fastest growing HIV demographic in the U.S. due to bisexual men who in relationships with women because they are confused about their sexuality.\n\nGay and bisexual men, regardless of race, are more sexually promiscuous than their heterosexual counterparts, according to Seekingarrangement.com and other reports.\n\nAuthorities in New York City are offering up to $100,000 for information leading to the arrest of 31-year-old Isaac Don Burks, aka Stephawn Burks, Stefan Levine, Isaac Levine, Stefan Burks, and Walter Brooks.\n\nBurks is described as an African-American male, medium brown skin, six feet two inches tall, weighing 185 pounds. The NYPD is looking for a fugitive they say has embarked on a terrifying campaign to “infect as many people as possible” with the HIV virus, and they caution that his victims could run into the hundreds.\n\nIsaac Don Burks, 31, has been indicted on eight counts of criminal transmission of HIV, prosecutors announced Friday, and warned that Burks targets people via popular gay websites and networking apps, such as Adam4Adam, Grindr, Jackd, and BGCLive.\n\nBurks, a black gay man from West New York, NJ, just outside Manhattan, who police say may have started his “mission to infect as many people as possible” with HIV as far back as ten years ago, was described as “sick in the head” by one alleged victim, who notes that Burks alluded to having possibly infected as many as 300 victims. The victrim, who did not wish to be publicly identified, recalls that Burks has been on a “downward spiral” since the death of his mother, and plies his prey with drugs and alcolhol, to “bring their guard down.”\n\nAccording to New York City Health Department spokesperson Kate Caraway, this is the first time a HIV infected individual has spread HIV to so many victims.\n\n“We want to make sure that anyone who may have injected drugs with, who may have had sex with him, does come forward and get tested,” she Caraway. “We want to make sure that they’re not spreading the virus to anyone else.”\n\nAnyone with information regarding Burks’ whereabouts is asked to call Crime Stoppers at 888-CRIMESC (888-274-6372). Your call will remain anonymous.\n\nThis makes the report we did on Craig Lamar Davis passing HIV around the Full Gospel Baptist Church seem like nothing.\n\nNow read Joshua Johnson story in his own words below:\n\n\n\n\n\nIsaac Burks aka Isaac Don Burks Pictured Above\n\nI met Stephawn, (Real Name: Isaac Burks – Isaac Don Burks), when I was 19 years old. I had just moved to Atlanta from North Carolina to attend Clark Atlanta University. At 19, I was still trying to figure out my sexual orientation. I was still a virgin, because I was raised with traditional values. I was attracted to females, but I was also attracted to men. In fact, my attraction to men was stronger. I desperately tried to fight my attraction to the same sex, because I knew if I gave in that would mean a lifetime as an outcast in my family.\n\nYou see, my father was a pastor and my mother was a physician. I came from a very stable background, and my parents were heavily into the church. They controlled everything in my life. They financed my education, sent me money every month, and paid virtually every bill that I had. They wanted to see me succeed in life, and I didn’t want to disappoint them.\n\nWhen I moved to Atlanta I met other gay men who were more comfortable with their sexual orientation. I pulled strength from these men, and bonded with them immediately. They taught me that it was ok to be gay, and that life was too short to live my life for others. Over the next few months my circle started to consist of nothing but gay men. I felt comfortable. I felt that I could express myself without judgement, and…. for the first time ever I felt accepted. As time passed by, I started coming out of the closet a little more each day. At first, I would never attend a gay club because of fear of being outed. My friends eventually talked me into attending a gay club for the first time. I was nervous! You see, I had a sister who attended Spelman College and four other male cousins who attended Clark. The last thing I needed was my family to find out my sexual orientation. That would mean the possibility of my parents cutting me completely off, and they were the ones paying for my tuition, books, and college expenses.\n\nI eventually put my fears aside after a night of drinking with my friends. We loaded up into my friends Ford Explorer and headed over to a club called Traxx. Apparently, this was the gay club that everyone in Atlanta attended on Saturday. I remember walking into a place that resembled a poorly decorated high school gym. It was huge! There had to be over 1,000 people in the place, and they were dancing the night away. Because we were underage, we couldn’t drink. Apparently everyone over 21 received a special wrist band to indicate their age, and no one in my party had one. After awhile of standing around we were starting to become over it. Clubs aren’t as fun when you are sober, and the liquor we had drank earlier was starting to wear off. While standing on the side I noticed a guy staring at me and smiling. He was very attractive, and every time I would catch him looking in my direction I would look the other way. This entire gay lifestyle was still new to me, so I didn’t know what to take his stares for. Eventually he worked up the nerve to come over to me and strike up a conversation. He told me that I looked familiar, and asked me where I was from. I told him that I was from Charlotte North Carolina, and I couldn’t possibly look familiar. I had never been to a gay club, and every one of my gay friends were college freshmen from different cities around the country. He asked me why I wasn’t drinking, and I told him we couldn’t buy drinks because we were all under 21. He offered to buy us a round of drinks at his expense. I jumped at the offer, because we wanted to enjoy ourselves that night. After all, no one comes to a club to have a bad time.\n\nHe returned minutes later with three drinks. The drinks he ordered for us were Long Island Iced Teas. I remember taking a sip and almost spitting the drink out. It was very strong. Rather than be rude and waste his money, I drank it slowly. Stephawn then asked why I was babysitting my drink. I asked what did he mean by that, because I had never heard the phrase used before. He told me to hurry up and finish my drink, he was going to order us another round. By the time the second round came, I was feeling nice. We continued to talk, and he kept buying me drinks.\n\nAfter the third round I was borderline drunk, and so were my friends. Every time he ordered me a drink, he also ordered my friends a drink too. After awhile my friends wanted to leave, and I told him that I would catch up with him later. He asked me to stay a little longer, and promised to take me home. I ditched my friends, and for the rest of the night it was just me and him.\n\nWe ended up leaving the club an hour later. While taking me home he told me that he wanted to stop by his house real quick to grab some gas money since his car was on E. We pulled into an apartment complex in the Lindbergh area of buckhead. He told me to come up with him so I did. As soon as the door to his apartment closed he started passionately kissing me. We eventually ended up in his bedroom where we kissed for hours it seemed. He started unbuckling my my pants, and I stopped him. I confessed that I was a virgin and didn’t have a clue what I was doing.\n\nHe told me to relax, and that everything was cool. He said everyone started off as a virgin at some point in there life, and that he could teach me how to have sex. He made me turn over on my stomach and took my shoes off. Then he took my pants off. I was tense and nervous. I didn’t know what to expect, but he was so attractive I wanted every ounce of this man. The first thing he did was start eating my ass and I moaned passionately as he gently ate my ass for hours it seemed. Next he started sucking my d***k from the back while I was laying on my stomach. It felt amazing. I wanted to please him too, but he told me to chill and go with the flow. Then he started grinding on my ass and rubbing his d***k on my ass crack. He grabbed some lotion that was strategically placed on his nightstand. He rubbed the lotion in my ass crack, and then put some on his index finger. He slowly put his finger inside of my ass. I moaned in extacy, because he was stroking my d***k while he was massaging my prostate with his finger. After awhile of fingering me, he tried to put his d***k in my ass raw. I immediately stopped him! I asked if he had a condom, and he said yea why? I said because I didn’t come to Atlanta to catch anything and safe sex was mandatory with me. He ran some line about being recently tested the week before, and I said that’s cool but we just met. If we were going to have a casual encounter it needed to be a safe casual encounter. He jumped up and grabbed a magnum out of his dresser. I watched him put the condom on, and then I buried my face into the pillow. It was painful at first. I didn’t understand how men could possibly enjoy what felt like having your insides ripped out. I had to stop him several times, because I could not take the pain. After about 20 minutes he was starting to get impatient. I couldn’t take the d***k, and he seemed to be over waiting for me to get used to the pain. I didn’t want to disappoint him, and I didn’t want my first sexual experience to be horrible with my partner not being satisfied. I decided to “man up” and squirted some more lube on my ass. I laid on my stomach, and put my face back into the pillow. He inserted his d***k inside of my ass, and this time it didn’t hurt as much. He started to increase his stroke, and I had no problem taking it. He was grabbing my waist, and I attempted to throw my ass back like I had seen in the porno movies. Whatever I was doing, he was enjoing it because he was moaning in extacy. After 10 minutes of f***king me doggy style he screamed he was going to cum. As he came I felt a warm liquid inside of my ass. I jumped up and looked back and saw his d***k without a condom on it! I screamed what happened to the condom? He grabbed around the bed and showed me the condom. There was no cum in it, and it was by the foot of the bed. I ran to the bathroom, because it felt like I had to s***t. When I used the bathroom, his cum rushed out of my ass. It was allot. I kept thinking to myself that this motherf***ker took the condom off while f***king me. That was the only explanation for cum being in my ass, because I watched him put the condom on.\n\nI came out of the bathroom with an angry look on my face. I said nigga I just used the bathroom and your cum came out of my ass. I asked him if he took the f***king condom off. He said no. He said that it must have broke. I wasn’t buying it, and I searched around for the condom. I found the used condom on the bed, and started examining it. The condom wasn’t broke at all! I rolled it out, and there was nothing wrong with it. I screamed what the f***k did you do, because this condom isn’t broken. He told me that I was tripping, and I ran to the bathroom with the condom and put it up to the faucet. I filled the condom with water and it didn’t leak at all! When I did that, he told me to get the f***k out of his house. I felt betrayed, I was scared for my life, and I was hurt. I had heard about Atlanta being one of the cities with the highest AIDS rates in the country, and I was determined not to be a statistic.\n\nI got my things, and got out of his house. This asshole didn’t even take me home, and it was 6am in the morning. As I waited outside of his apartments in the cold, I called a cab service. They arrived about 20 minutes later and took me home. The entire time he was texting my phone and calling me non stop. I didn’t answer his calls, because I didn’t want to talk to him. I was convinced that he had purposely took the condom off while f***king me. There was no other explanation for his cum being inside of me. I know some guys get off by that, but I was disgusted by it.\n\nThe thought of his cum inside me made my stomach turn. As the liquor wore off, I went into a deep depression. When I got to my dorm, I popped two tylenol pm’s and fell alseep.\n\nI didn’t tell anyone about my experience. How could I explain that I had sex and my partner purposely took the condom off and came inside my ass unprotected. I had just met this man. I didn’t even know his real name. When my friends asked me what happened, I said nothing and gave them a look that said “don’t ask me anymore questions!”. They didn’t ask, and I didn’t tell. That experience frightened me so bad that I decided to put my sexual desires on hold and focused on my education. That meant pulling back from my “gay friends” too, because I was starting to get a little too reckless and free with my sexuality. I started hanging more with my straight friends. After all, I had to keep my charade up. I had family that attended my school, so I couldn’t be seen with a bunch of gay men 24/7.\n\n8 months later while home for Christmas break I had to see my doctor for my yearly checkup. This was something my mother made me do ever year since I can remember. My doctor asked me was I sexually active, and I said no. I told him that I had sex once, but that was it. I wasn’t sexually active, because I wasn’t actively having sex. He told me that he was going to include an HIV test in my regular blood work anyway. A few days later I received a call from his office. It wasn’t the doctor, it was one of the office workers. She was obviously new, because I didn’t recognize her voice. She told me that I needed to come in, because there was something that the doctor needed to discuss with me. I was confused. I asked her what “something” was, and she said that she couldn’t release this information over the phone and that I should come in Today. This was very unusual, because I had never had this happen before and I had been getting a yearly checkup from the same doctor for over 15 years. At first I thought it could be high blood pressure, because that ran in my family. There was also a chance of cancer, because the women in my family had breast cancer and my grandfather passed away from prostate cancer. I borrowed my mothers car, and headed over to the doctor’s office. I didn’t want to scare her, so I didn’t mention what I was borrowing the car for.\n\nI will never forget what happened next. As I arrived to my doctor’s office, I was told to have a seat in the waiting room. There was soft music playing that turned out to be Barry Manilow’s Daybreak, and it made my stomach turn! I hated that f***king song. I was in no mood to hear a happy go lucky song when I was being called into my doctor’s office to discuss my lab results. Before the song could end, the doctor opened the door and escorted me to an exam room. It was cold, there was no window, and the light was very bright. Brighter than usual. He began to look over my charts and lab results. He grabbed my hand, which caught me off guard, and then said I’m sorry to have to tell you this, but your HIV results\n\ncame back positive. I swear I didn’t even hear the word positive, I just read his lips that seem to go in slow motion. I said, I’m sorry but there must be some mistake. I am not sexually active. I’ve only had sex once! I haven’t had oral sex, or any sexual activity with anyone but one person. He said that he would order additional tests, and they all came back positive.\n\nI thought about committing suicide. I could not eat. I could not sleep. I could not focus on school. I couldn’t do anything but cry. My doctor couldn’t legally tell my mother I was HIV positive, but I was on her insurance so she would find out sooner or later when she saw the co-pays for the HIV meds he prescribed and the increased doctor visits. I tried to get in contact with Stephawn but his number was disconnected.\n\nWhen I got back to school, I went over to the apartment complex where he lived but I couldn’t remember the apartment number. I had no way of reaching this guy. I wanted to kill him, and i was going to. I had a butcher knife and I was going to stab him thru the heart, because I knew this guy had given me HIV, because I didn’t have sex with anyone else. As time passed, I became so depressed that I eventually dropped out of school. I kept thinking what is the purpose of getting a degree when I’m going to die soon. I lost 15 pounds from not eating and started to look very frail. I decided to drop out of school, because I didn’t know how to deal with it all. I had no one to turn to. I couldn’t tell my friends, and I couldn’t tell my parents. Can you imagine telling your mother that you are HIV positive after a one night stand. I couldn’t dare to see the pain in her eyes of knowing her son is going to die before her.\n\nToday I read the article about Isaac Burks and saw his picture. This is the same guy who told me his name was Stephawn. This is the guy that gave me HIV! He ruined my life. I finally ended up telling my parents because I could not afford to pay the co-pays for the medication and doctor visits. My mother didn’t cry, and told me that she loved me and would be there for me every step of the way. Later on that night as I got up to use the bathroom I heard her crying in her room. Tears immediately started pouring down my face and I ran to the kitchen. I slit my wrist. I wanted to die. I fell out and woke up in the hospital surrounded by my family. I have been in counseling, hiv support groups, and seeing a psychiatrist every since. Accepting the fact that I am HIV positive has been very hard. I still have not been able to return to school, and I have tried to kill myself 3 times since then.\n\nTo the sick f***k Isaac Burks, also known as Stephawn who gave me HIV, I hope you rott in hell. Now that I know his real name I will contact the authorities and tell my story. Every day I hope that things will get better, and it doesn’t. I ask “Why me?” every day. What did I do to deserve this? I have not been able to date or have any sexual relations with anyone. I just know the minute I tell them my HIV status they will be out of the door. I am going to die alone. The last time I tried to commit suicide by swallowing a bottle of sleeping pills I woke up to my mother crying and begging me to stop. But I cant. I have nothing to live for. I am alive, but I am not living.\n\nI cried as I typed this post. I relived it, but felt I had to share my story. After finally coming out to my friends with my story I later found out that there were others that this man infected with HIV.\n\n\n\nRead Isaac Don Burks Response on his Facebook Page Below:\n\nIsaac Don Burks Facebook Page\n\nI can only say i pray 4 the person or persons responsible for creating a false story about me spreading HIV to hundreds of people. I would love to get on here and bash every lie and false story that is floating around, but i have a life to live. I have friends and family who know and love me dearly and are in my corner. I am not a person who would intentionally bring pain and hurt to anyones life. I have seen what this disease does to people first hand losing my best-friend to this at such a young age. It baffles me to think that someone would actually have so much hate in their heart to make a factitious news article and take my past experiences to add more significance to the story. Loosing my mother was a very hard thing to deal with but to say im on a downward spiral of destruction because of this is outrageous. Im actually doing a lot better with my mother in heaven because with her watching over me this lie CANNOT WIN. See sometimes people are hurt so bad in life that they do things to others intentionally and maybe accidentally but this article was definitely intentional to hurt and assassinate my character and mainly make me out to be a monster. I pray for you whoever you are. See my GOD doesn’t allow me to hate or to dwell in this foolishness with the serpent. I can say that i was always taught that the devil comes to steal, kill, and destroy. SATAN get behind me because no weapon formed against me shall prosper!!!!! For the ones who are spreading the story via internet i ask u WWJD, what if this was you or your brother, uncle, cousin, farther. I’m not madd because i know who i am and im better then this. When your life is going so good things come to make u backslide into worldly ways but i want. I dont have anyhing else really to say besides GOD BLESS you all", "authors": ["John Smith", "So Focused", "Messy Mae", "Fishertown Pa", "What's It To You", "Lenette Blackshear", "Sharon Young", "Margo Alverson", "Completely Understand", "Claudette Y"], "keywords": [], "meta_data": {"generator": "WordPress.com", "application-name": "Obnoxioustv's Blog", "title": "New York Man Wanted For Infecting 240 Men And Women With HIV!!! | Obnoxioustv's Blog on WordPress.com", "og": {"site_name": "Obnoxioustv's Blog", "description": "This will blow your mind…Read how a New York man has allegedly infected 240 people with the HIV virus by sleeping with men and women. “I met Stephawn when I was 19 years old,” explains Joshua…", "title": "New York Man Wanted For Infecting 240 Men And Women With HIV!!!", "url": "https://obnoxioustelevision.com/2013/03/05/new-york-man-wanted-for-infecting-240-men-and-women-with-hiv/", "image": "https://obnoxioustv.files.wordpress.com/2013/03/20130305-000628.jpg", "locale": "en_US", "type": "article"}, "twitter": {"text": {"title": "New York Man Wanted For Infecting 240 Men And Women With HIV!!!"}, "image": "http://sphotos-a.xx.fbcdn.net/hphotos-snc7/484286_514400635251223_2005542494_n.jpg?w=240", "site": "@WilliamGMcCray", "card": "summary", "creator": "@WilliamGMcCray"}, "msapplication-tooltip": "You've officially been choked by the Bow Tie!", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=WordPress.com Forums;action-uri=http://forums.wordpress.com/;icon-uri=https://s2.wp.com/i/favicon.ico", "article": {"publisher": "https://www.facebook.com/WordPresscom", "published_time": "2013-03-05T04:45:03+00:00", "modified_time": "2013-03-05T07:55:14+00:00"}, "viewport": "width=device-width", "description": "This will blow your mind...Read how a New York man has allegedly infected 240 people with the HIV virus by sleeping with men and women. “I met Stephawn when I was 19 years old,” explains Joshua Johnson on his blog. He continues: “At 19, I was still trying to figure out my sexual orientation. I…"}, "canonical_link": "https://obnoxioustelevision.com/2013/03/05/new-york-man-wanted-for-infecting-240-men-and-women-with-hiv/", "images": ["https://2.gravatar.com/avatar/5a348e3fffffc968d90b1cb352aa342f?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/4e3403812ba7d4768f6d2079fa5eb5a3?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/c31951d8d7ad77c760e79c6b5bda2c9b?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/3b48526ca09c984c5beb384f11990189?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/64187ec827a9b5d99b267ca25ae707fc?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/1de841c318756725be0f469aebcf165f?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/8dce82a29da2ca906f4f945f3f128e8a?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/810037ad70e1a2166f613c85a293c12f?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/13ff4758f88f6d664e02902ef4e4f6dd?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/08c15126627d96573491a50acb3d9320?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/ee7150072f2e53270720a50eae992fd2?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/a5d1f612252e18a743fe257c38607acb?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/014ca1ec5b3e780f5b9c2a21640820dc?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/3722b13bcfb1119df193ea7d99abb9f7?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/21fd4bca91527d8c6212d90f0567aab5?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/604a70c8280918332086011b4d576322?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/ffdc4574328918fa2e42057084bbd69d?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/4925a9318b047bdb3253e5ecb4ce711c?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/22a22bd3d4ecfb73e68d0eec4cd53df6?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/3552700e9e299eff0f53c4b47e6195c5?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/4d35aab285c5b60eaa56f3942b555ef5?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/801ba3728fce5c207366da6f599b3ffa?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/c11d0608c159c1848cf6c8c8596d88db?s=48&d=identicon&r=G", "https://i2.wp.com/sphotos-a.xx.fbcdn.net/hphotos-snc7/484286_514400635251223_2005542494_n.jpg", "https://0.gravatar.com/avatar/9a2a83b32c4800b3717df92b55146691?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/3570af2247d9eb872eb8a15878fd11c9?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/bbd66023a32253fd75c1d90831b99939?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/62753c69ba7b71dc5b6b9ef39251a4b9?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/c0a8eb6687bb912417ed4cba7db08620?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/f2c4dfdfb7cd7d232814799843b392d3?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/06133d358ffa518dc938f325fd849fff?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/4ee63bb2fe02123f7474b6e2125e567f?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/8cc1e5ef07d21009752c6aad4aa66217?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/515de1fd3bb4994d83ad5d2ea504c2ec?s=48&d=identicon&r=G", "https://pixel.wp.com/b.gif?v=noscript", "https://1.gravatar.com/avatar/a69894560710d3c15284b788f25499bf?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/2fccff4271c35ea443bd8e8277a196d4?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/d968d1ec5bbc1c7ee50811c90f6436a2?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/85fbcf6b5a3ed56ac9ada59305c9ef1f?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/48fdd579dcce71d9a3303969663fb361?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/915b002daa377238772bb9f0a9cf4d0c?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/17ce1faa92ff603d13f6bf0c9ebc6308?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/afd77c434bd60b2fdb7df59ea62aff51?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/ac7c6632e92e5e5e7863cbd041299a49?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/05cbcb61c4d7f7b1bec98ae80089cf8b?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/b0e87a408b087f0977675cc1621ff296?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/1077a2a9ec5abed58e741c8bf3eedc76?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/ca817688aeec6b82b0f51b77c94934af?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/0afb95e7054a33a87c686c18ded6ef5c?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/3764008e6dab60b8879a361b636dad77?s=48&d=identicon&r=G", "https://obnoxioustv.files.wordpress.com/2013/03/20130305-000628.jpg", "https://1.gravatar.com/avatar/a11b785325de894a2be9561716f23fa4?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/b98066d766b4acd5eef61affdd39c8f2?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/a1c3e419f413a32de01ffbf9fbea9649?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/fee307afa021717e36692a1947abc481?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/3989d4edfbf9bd370b6452d30a485925?s=48&d=identicon&r=G", "https://i1.wp.com/sandrarose.com/images17/isaac_burks_500x281.jpg", "https://2.gravatar.com/avatar/e95dc499476468670a88228eb31ee353?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/f0b55b9ae86211067a72079b82530cb3?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/616721487e55bf37a7cb2765e44c7cee?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/c19f8128f665a7bb2e676d209362a8a9?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/ce2c3bf931e9c9632b7862a12ca248f4?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/bbf2b33817b00475a7355658385d1ee1?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/fb63a224530a9d7dd2e2338c2973613e?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/65f3169d47e38d290f66133b6f7d4f9c?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/059556a4864bcdeb1888e29c4c9ef37e?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/e4b0036816c87d4109ae6f9658fee9a3?s=48&d=identicon&r=G", "https://2.gravatar.com/avatar/59e73841d561f5f2ad16f4578ec9ea79?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/6445ac16c54c1f6c20ac6c55dae2aa33?s=48&d=identicon&r=G", "https://obnoxioustv.files.wordpress.com/2013/03/20130305-000628.jpg?w=594", "https://1.gravatar.com/avatar/ad516503a11cd5ca435acc9bb6523536?s=25&d=identicon&forcedefault=y&r=G", "https://0.gravatar.com/avatar/f9160a0bb8fa434df19638a20c1f6153?s=48&d=identicon&r=G", "https://1.gravatar.com/avatar/1268e3c4cca8c2ab38a57659ff6e6f5e?s=48&d=identicon&r=G", "https://0.gravatar.com/avatar/f68f4b4d64cd6a57766e2a1571268238?s=48&d=identicon&r=G"], "title": "New York Man Wanted For Infecting 240 Men And Women With HIV!!!", "url": "https://obnoxioustelevision.com/2013/03/05/new-york-man-wanted-for-infecting-240-men-and-women-with-hiv/", "summary": "", "movies": [], "publish_date": {"$date": 1362441600000}, "source": "https://obnoxioustelevision.com"}
