{"top_img": "http://proudleader.com/wp-content/uploads/2017/03/25602642832_4ae1e69452_b.jpg", "text": "Need more proof that liberalism is a disease? Two United States Representatives were just arrested for plotting to carry out the assassination of President Trump. These aren’t some off-the-hook left wing extremists, they’re typical men with what seem like typical lives but liberalism has turned them insane with jealousy and rage.\n\nRep. Harold Spunkmeyer (D-Illinois) and Rep. Johnathon Leominster Jr (D-Massachusetts) were taken to a military holding facility under suspicion of terrorism for plotting to murder the President. Several of their closest aides as well as their families have also been detained. As we speak, a special unit of the Secret Service is closing the net on all of their friends and anyone else who could potentially cause harm to President Trump.\n\nAccording to reports, intelligence was gathered from the men’s computers that they were planning to ambush the president during one of his trips to Florida, giving them 4 to 5 possible attack attempts per month to work with. It’s unclear where exactly the attacks would have taken place, but the agents in charge of the investigation say they are certain the men were serious about the plan:\n\n“Their plans were hidden from plain sight in what they said was a ‘design for a new video game,’” said Special Agent George Ketterman, “While they never actually used the president’s name or purchased any of the items listed in the ‘game,’ like grappling hooks, stinger missiles, bulletproof jetskis or yellow cake uranium, there was enough evidence when presented to the president for him to order us to take them as terrorism suspects.”\n\nIn unrelated news, the men were known to be strong opponents of the Trump agenda and were also organizing massive protests and marches in their districts. ABC reports that between them they had raised more signatures opposing Trump’s executive orders on immigration and travel than any other lawmakers in Washington.\n\nNBC News tried to reach out to the men’s lawyers to see if there would be a statement available but couldn’t find one. It would appear that the men, their families and whoever may have been stupid enough to represent them will just disappear as enemies of the state under the Patriot Act.\n\nWelcome to Trump’s America, liberals. If you step out of line you’ll be removed altogether.", "authors": ["Thomas Rhett"], "keywords": [], "meta_data": {"ca_image": "http://proudleader.com/wp-content/uploads/2017/03/25602642832_4ae1e69452_b-150x150.jpg", "generator": "WordPress 4.7.5", "og": {"site_name": "Proud Leader", "description": "Need more proof that liberalism is a disease? Two United States Representatives were just arrested for plotting to carry out the assassination of President Trump. These aren’t some off-the-hook left wing extremists, they’re typical men with what seem like typical lives but liberalism has turned them insane with jealousy and rage. Rep. Harold Spunkmeyer (D-Illinois) …", "title": "2 Liberal Democrat Congressmen Arrested For Planning Trump’s Assassination - Proud Leader", "locale": "en_US", "image": {"width": 1024, "identifier": "http://proudleader.com/wp-content/uploads/2017/03/25602642832_4ae1e69452_b.jpg", "height": 683}, "url": "http://proudleader.com/2-liberal-democrat-congressmen-arrested-planning-trumps-assassination/", "type": "article"}, "twitter": {"image": "http://proudleader.com/wp-content/uploads/2017/03/25602642832_4ae1e69452_b.jpg", "description": "Need more proof that liberalism is a disease? Two United States Representatives were just arrested for plotting to carry out the assassination of President Trump. These aren’t some off-the-hook left wing extremists, they’re typical men with what seem like typical lives but liberalism has turned them insane with jealousy and rage. Rep. Harold Spunkmeyer (D-Illinois) […]", "card": "summary", "title": "2 Liberal Democrat Congressmen Arrested For Planning Trump’s Assassination - Proud Leader"}, "article": {"section": "Republicans", "published_time": "2017-03-21T19:03:42+02:00"}, "ca_title": "2 Liberal Democrat Congressmen Arrested For Planning Trump’s Assassination", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://proudleader.com/2-liberal-democrat-congressmen-arrested-planning-trumps-assassination/", "images": ["http://0.gravatar.com/avatar/3512574e2aed68d91fa331534eca358a?s=32&d=mm&r=g", "http://proudleader.com/wp-content/themes/viral/images/shadow.png", "http://2.gravatar.com/avatar/22cee9c018d6b9552c0d69681b973d3d?s=32&d=mm&r=g", "http://2.gravatar.com/avatar/b186f7fe976e26d9695fedabb8639c4c?s=32&d=mm&r=g", "http://proudleader.com/wp-content/uploads/2017/03/25602642832_4ae1e69452_b.jpg"], "title": "2 Liberal Democrat Congressmen Arrested For Planning Trump’s Assassination", "url": "http://proudleader.com/2-liberal-democrat-congressmen-arrested-planning-trumps-assassination/", "summary": "", "movies": [], "publish_date": {"$date": 1490115822000}, "source": "http://proudleader.com"}
