{"top_img": "https://uspoliticsinfo.com/wp-content/uploads/2017/05/jamescomey_070815fr-618x348-2.jpg", "text": "\n\nAnonymous sources within the FBI have revealed to The Times that they have new evidence indicating that everyone who voted for Donald Trump is an agent of the FSB (formerly the KGB). An unknown portion of these voters may have had their minds controlled by a Russian space-beam, agents close to the investigation say.\n\nThe allegation that 62 million Americans appear to be employed by Russian intelligence services has rocked the Bureau, and it is reported that multiple agents have taken their own lives, given that realizing just how deep this Russian hacking conspiracy runs blew their minds – literally.\n\nThis shocking new revelation comes after it was confirmed as a fact that Russia did Wikileaks because Donald Trump personally called Vladimir Putin and asked him to. It was also revealed earlier this week that Alex Jones (real name “Alexi Jonesinov”) is a Russian sleeper agent who was ordered by the FSB (formerly the KGB) to post news articles on the internet saying that Donald Trump would be a good President.\n\nHowever, the revelation that 62 million Americans are taking orders directly from the Kremlin is a revelation of a whole other order, which FBI agents are struggling with how to deal with.\n\nIt was determined by Puerto Rican federal judge Mizu Tomazaki that it is a crime to support Donald Trump or to post positive things about him on the internet. 9th circuit judges Weinberg, Steinman and Goldenstein upheld the ruling. Despite this, the logistics of rounding up 62 million people and locking them in prison present a difficult task to overcome.\n\nIt may also be that not every voter is a direct agent of the FSB (formerly the KGB), and some may have been under the control of a mind control beam in space.\n\n“We have not determined for sure that everyone who voted for Trump was paid directly by the Kremlin, given that it is highly possible that the Russians used a space-beam from a satellite to control their brains from a facility in St. Petersburg, and moved their bodies like puppets to the polls to check the Trump box,” one current agent familiar with the investigation told the times, describing the process of using a satellite-mounted space-beam to control people’s actions as “Russian neuro-brain hacking.”\n\nThis method was developed by the KGB, which became the FSB following the fall of the USSR.\n\nWhat we know for a fact is that the only reason anyone would vote for Donald Trump is that they were being influenced, whether through cash payments, blackmail or space beams, by Russian agents from the FSB (formerly the KGB).\n\n“If people were not beholden to Russia, they would have voted for Hillary Clinton,” a senior agent said, citing a definitive analysis by CrowdStrike, a contractor hired by the DNC to investigate Russian space-beam mind control.\n\nWhen asked for comment on these reports by The Times, Kremlin Spokesman Dmitry Peskov said the allegations of space-beam mind control by the FSB (formerly the KGB) were “ridiculous,” “outrageous” and “goofy.”\n\nSenator Chuck Schumer called the response from Peskov “predictable,” adding, “what do you expect from the criminal Putinist regime that kills journalists, oppresses gays, invaded the Ukraine, murdered innocent Syrians and hacked our elections by controlling people’s brains with a space-beam?”\n\nUpon hearing of the revelation of the fact that 62 million American voters are working directly for Russia, Senator John McCain has called for mass arrests. He referred to all Trump voters as “radical traitors to the core values and principles of democracy and human rights,” and demanded they be imprisoned and their homes given over to Syrian refugees.\n\nTOGETHER WE WILL MAKE AMERICA GREAT AGAIN!", "authors": ["Us Politics Info"], "keywords": [], "meta_data": {"ca_image": "https://uspoliticsinfo.com/wp-content/uploads/2017/05/jamescomey_070815fr-618x348-2-150x150.jpg", "generator": "Powered by Visual Composer - drag and drop page builder for WordPress.", "author": "Us Politics Info", "og": {"site_name": "Us Politics Info", "description": "Anonymous sources within the FBI have revealed to The Times that they have new evidence indicating that everyone who voted for Donald Trump is an agent of the FSB (formerly the KGB). An unknown portion of these voters may have had their minds controlled by a Russian space-beam, agents close to the investigation say. The", "title": "FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents! - Us Politics Info", "url": "https://uspoliticsinfo.com/2017/05/15/fbi-uncovers-evidence-that-62-million-trump-voters-are-all-russian-agents/", "image": {"width": 750, "identifier": "https://uspoliticsinfo.com/wp-content/uploads/2017/05/jamescomey_070815fr-618x348-2.jpg", "height": 400}, "updated_time": "2017-05-15T20:00:37+00:00", "locale": "en_US", "type": "article"}, "twitter": {"description": "Anonymous sources within the FBI have revealed to The Times that they have new evidence indicating that everyone who voted for Donald Trump is an agent of the FSB (formerly the KGB). An unknown portion of these voters may have had their minds controlled by a Russian space-beam, agents close to the investigation say. The", "creator": "@dailyusnewsfeed", "image": "https://uspoliticsinfo.com/wp-content/uploads/2017/05/jamescomey_070815fr-618x348-2.jpg", "title": "FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents! - Us Politics Info", "site": "@dailyusnewsfeed", "card": "summary_large_image"}, "fb": {"app_id": 1089239367784460}, "onesignal": "wordpress-plugin", "article": {"publisher": "https://www.facebook.com/US-News-Feed-256185128065500/", "section": "News", "published_time": "2017-05-15T20:10:27+00:00", "modified_time": "2017-05-15T20:00:37+00:00", "author": "https://www.facebook.com/US-News-Feed-256185128065500/"}, "ca_title": "FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents!", "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "https://uspoliticsinfo.com/2017/05/15/fbi-uncovers-evidence-that-62-million-trump-voters-are-all-russian-agents/", "images": ["https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=RcdYn1QolK10fn", "http://uspoliticsinfo.com/wp-content/uploads/2016/04/logo-272x92.png", "https://mailbird.evyy.net/i/380215/355555/4274", "https://uspoliticsinfo.com/wp-content/uploads/2017/01/logo-272x92.png", "https://uspoliticsinfo.com/wp-content/uploads/2017/05/jamescomey_070815fr-618x348-2.jpg", "https://mailbird.evyy.net/i/380215/355556/4274"], "title": "FBI Uncovers Evidence That 62 Million Trump Voters are All Russian Agents!", "url": "https://uspoliticsinfo.com/2017/05/15/fbi-uncovers-evidence-that-62-million-trump-voters-are-all-russian-agents/", "summary": "", "movies": [], "publish_date": {"$date": 1494806400000}, "source": "https://uspoliticsinfo.com"}
