{"top_img": "http://spinzon.com/wp-content/uploads/2016/11/Lady-gaga.jpg", "text": "Lady Gaga has opened up about the perils of fame. In an appearance on CBS’s “Sunday Morning,” the “Million Reasons” singer talked about how her life has changed since becoming famous and how she feels like she has no freedom because of the attention she has been getting. Gaga also said that she finds solace in her home, and that leaving it gives her a bit of anxiety. “I’m very acutely aware that once I cross that property line I’m not free anymore,” Gaga said.\n\n“It’s like I’m stepping out into this entirely different world where everybody’s allowed to follow me, take pictures of me, treat me like a circus freak and flat out do whatever they want around me and I can’t even call the police to help me because they’re not doing anything wrong,” the singer complained. “I realize that this is part of what I wanted when I set out to become famous and fulfill my dreams, but nobody told me I’d have to give up my privacy completely. And to top it all off – we’ve just had the presidential election and the least favorite guy won. Now I gotta deal with that as well.”\n\nAsked to elaborate on her opinion on President-elect Donald Trump, Gaga said that he wasn’t her “first choice,” as well as that “he couldn’t have picked a worse time to become President of the United States,” due to the fact that “I might have to go back to hiding my face again until he gets kicked out of the White House.” “It was fun pretending to be someone else at the beginning of my career, wearing masks and all that, but there comes a time when you outgrow all those childish costumes and just want to be yourself. And I haven’t been able to do that in a long time,” she revealed.\n\n“So, I’m sorry to have to disappoint my fans, but I’m afraid I’m going to have to revert to wearing a mask whenever I’m out in public, and that includes performing during live shows and on television as well,” the singer revealed. “At this point I’m not sure whether that’s going to be some aggressive type of makeup or a full-on mask that’ll cover my face, but what I do know is that’s the only thing I could think of to get at least some semblance of my privacy back other than visiting a plastic surgeon. I’m too good looking to be changing my face at this age.”\n\n“Until Donald Trump is fired from office and stops making everybody’s life miserable, and simultaneously, until things quiet down around me a bit to a point where I’m able to go out to lunch and not have my picture taken 10,000 times on the way to the diner, I’ll be going back to wearing a mask. What can I say – I guess I’ll need to put on an actual poker face for the time being, until things get back to normal, both in my private life and in the White House,” Gaga concluded.\n\nvia: therightists.com\n\nLady Gaga Reveals Plan To Cover Her Face Again “Until Trump Gets Fired From Office And I Feel Free Once More”", "authors": [], "keywords": [], "meta_data": {"description": "Gaga also said that she finds solace in her home, and that leaving it gives her a bit of anxiety. “I’m very acutely aware that once I cross that property...", "generator": "WordPress 4.8.1", "og": {"site_name": "Spinzon", "description": "Lady Gaga has opened up about the perils of fame. In an appearance on CBS’s “Sunday Morning,” the “Million Reasons” singer talked about how her life has changed since becoming famous and how she feels", "title": "Lady Gaga Reveals Plan To Cover Her Face Again \"Until Trump Gets Fired From Office And I Feel Free Once More\"", "url": "http://spinzon.com/lady-gaga-reveals-plan-cover-face-trump-gets-fired-office-feel-free/", "image": {"width": 618, "identifier": "http://spinzon.com/wp-content/uploads/2016/11/Lady-gaga.jpg", "height": 412}, "updated_time": "2016-11-25T11:07:26+00:00", "type": "article"}, "twitter": {"partner": "tfwp", "image": "https://i0.wp.com/spinzon.com/wp-content/uploads/2016/11/Lady-gaga.jpg?fit=618%2C412", "description": "Lady Gaga has opened up about the perils of fame. In an appearance on CBS’s “Sunday Morning,” the “Million Reasons” singer talked about how her life has changed since becoming famous and how she feels like she has no freedom…", "card": "summary", "title": "Lady Gaga Reveals Plan To Cover Her Face Again “Until Trump Gets Fired From Office And I Feel Free Once More”"}, "msapplication-TileImage": "https://i0.wp.com/spinzon.com/wp-content/uploads/2016/06/cropped-13450808_285319511812726_8686982567230012446_n-e1466592980864-1.png?fit=270%2C270", "article": {"published_time": "2016-11-25T11:07:26+00:00", "modified_time": "2016-11-25T11:07:26+00:00"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://spinzon.com/lady-gaga-reveals-plan-cover-face-trump-gets-fired-office-feel-free/", "images": ["https://i0.wp.com/assets.pinterest.com/images/pidgets/pinit_fg_en_rect_gray_20.png?w=710", "http://spinzon.com/wp-content/uploads/2016/11/Lady-gaga.jpg"], "title": "Lady Gaga Reveals Plan To Cover Her Face Again “Until Trump Gets Fired From Office And I Feel Free Once More”", "url": "http://spinzon.com/lady-gaga-reveals-plan-cover-face-trump-gets-fired-office-feel-free/", "summary": "", "movies": [], "publish_date": {"$date": 1480072046000}, "source": "http://spinzon.com"}
