{"top_img": "http://usadailynews24.com/wp-content/uploads/2017/07/169.jpg", "text": "The biggest story this week was the arrest of Pakistani Muslim and longtime aide of Debbie Wasserman Schultz, Imran Awan. Earlier this year, Awan and his two other brothers were caught trying to leave the country with stolen laptops that contained top secret information from various congressmen. Shortly, after the brothers were arrested a criminal investigation commenced and Imran realized that he was going to go to jail for a very long time. In his attempt to avoid facing justice, Awan tried to flee the country but was picked up by police at the Dulles International Airport. This, of course, is scandalous, to say the least, and it was turned up another few notches after Imran hired his lawyer. The lawyer that was hired to defend Imran was no other but a close Clinton family associate and lawyer Chris Gowen.\n\nHere is more from Conservative Review:\n\nIn 2012, Gowen went to bat for Hillary Clinton aide Huma Abedin, whose family is deeply connected to the Muslim Brotherhood. After GOP reps explored Abedin’s nefarious ties, Gowen pledged to “stand with Huma.”\n\nAlong with his private practice, the longtime Clinton aide is also an adjunct professor at American University Washington College of Law, where he teaches courses on legal ethics and law practice management.\n\nGowen’s Clinton connections are intriguing on another level, given that Awan’s employer in the House, Rep. Debbie Wasserman Schultz, remains a close Clinton confidant. The former Democratic National Committee chair resigned from her position after emails surfaced alleging she attempted to tip the scales of the Democratic primary in Clinton’s favor. Wasserman Schultz was also the 2008 campaign co-chair of Hillary Clinton’s first failed run for president.\n\nReading this you would think that the mainstream media would be reporting this story non-stop, but that has not occurred at all. In fact, ABC, NBC, and CBS have dedicated a whopping 37 seconds to this political scandal. Of course, that seems ludicrous, but it is obvious that the mainstream media does not want to get to the bottom of this at all. However, that has not stopped Americans from pressing for more information, and the heat is getting Debbie Wasserman Schultz.\n\nNow, they are reports that Debbie is not fairing well, and has been an absolute wreck since Imran’s arrest. Also, there are calls for Debbie to testify before Congress growing louder, and it seems that she is about to cave.\n\nHere is more from Conservative Fighters:\n\nDebbie Wasserman Schultz employed Pakistani IT staffers and brothers who were paid over $4 million dollars over the course of their employment even though they were accused of a cyber-security breach.\n\nImran Awan was arrested as he attempted to flee the U.S. after wiring approximately $300,000 to Pakistan. Fox News is the only cable network covering this huge scandal. When Imran Awan was arrested he was carrying $12,000 in cash on him. His wife was carrying $12,000 of cash when she fled the country too.\n\nImran and his Muslim brothers, Abid and Jamal accessed unauthorized computers while acting as IT specialists. The three brothers were making $161,000, $165,000, and $160,000 and one of the brothers has a criminal background.\n\nWord has it that Debbie Wasserman Schultz is an absolute wreck since Imran Awan was arrested. Calls for her to testify to Congress are increasingly growing as well.\n\nWasserman Schultz knows she’s in hot water over this IT scandal. The Gateway Pundit previously reported the FBI seized smashed hard drives belonging to Imran Awan. We also reported that Debbie Wasserman Schultz threatened the chief of the U.S. Capitol Police with ‘consequences’ for holding equipment that she says belonged to her in order to build a criminal case against a Pakistani IT staffer suspected of massive cyber security breaches.\n\nIt is rather clear in watching the video that Debbie Wasserman Schultz has something to hide. Since, why would she threaten the police if there was nothing in the equipment that could point back to her or the Clinton’s?\n\nJohn Cardillo reports, ‘Florida politicos who have known Wasserman Schultz for years are telling me she’s a nervous wreck, barely able to function since Imran Awan’s arrest.\n\nFL politicos who have known @DWStweets for years are telling me she's a nervous wreck, barely able to function, since #ImranAwan's arrest. — John Cardillo (@johncardillo) July 27, 2017\n\nThen someone witnessed Wasserman Schultz in the midst of an epic meltdown in public. Is it possible that Wasserman Schultz is realzing that the DNC is crumbling all around her now?\n\nMELTDOWN: From trusted source– @DWStweets seen screaming at teen daughter today in public over a 2$ purse pic.twitter.com/i7Y0RI9c8S — Jim Hoft (@gatewaypundit) July 28, 2017\n\nEstablishment Media Refuse To Cover House IT Scandal Rocking Democrats https://t.co/LNwZHmknTf pic.twitter.com/QoknOsz3C8 — The Daily Caller (@DailyCaller) July 27, 2017\n\nThis is why alternative news is exploding over the traditional sources of media. The mainstream media is refusing to cover this story but will report the fake Russian collusion story, and President Trump’s ban on transgenders in the military. They will do anything they can to stop the real truth of what is happening in our government to be revealed.\n\nDebbie Wasserman Schultz holds the key to many answers that the American people deserve to know. Hopefully, by keeping the pressure on Wasserman Schultz she will crack and we can get to the bottom of the DNC corruption once and for all.\n\nSHARE IF YOU WANT THE TRUTH EXPOSED!", "authors": [], "keywords": [], "meta_data": {"description": "The biggest story this week was the arrest of Pakistani Muslim and longtime aide of Debbie Wasserman Schultz, Imran Awan. Earlier this year, Awan and his two other brothers were caught trying to leave the country with stolen laptops that contained top secret information from various congressmen. Shortly, after the brothers were arrested a criminal investigation commenced…", "generator": "WordPress 4.8.1", "og": {"site_name": "usadailynews24", "description": "The biggest story this week was the arrest of Pakistani Muslim and longtime aide of Debbie Wasserman Schultz, Imran Awan. Earlier this year, Awan and his two [...]", "title": "Wasserman Schultz Going To Mental Hospital After What She Did Overnight Desperate To Escape Arrest - usadailynews24", "locale": "en_US", "image": {"width": 654, "identifier": "http://usadailynews24.com/wp-content/uploads/2017/07/169.jpg", "height": 340}, "url": "http://usadailynews24.com/wasserman-schultz-going-mental-hospital-overnight-desperate-escape-arrest/", "type": "article"}, "twitter": {"image": "https://i0.wp.com/usadailynews24.com/wp-content/uploads/2017/07/169.jpg?fit=654%2C340", "description": "The biggest story this week was the arrest of Pakistani Muslim and longtime aide of Debbie Wasserman Schultz, Imran Awan. Earlier this year, Awan and his two [...]", "card": "summary", "title": "Wasserman Schultz Going To Mental Hospital After What She Did Overnight Desperate To Escape Arrest - usadailynews24"}, "article": {"section": "Politics", "published_time": "2017-07-28T23:19:24+00:00"}, "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://usadailynews24.com/wasserman-schultz-going-mental-hospital-overnight-desperate-escape-arrest/", "images": ["https://i0.wp.com/usadailynews24.com/wp-content/uploads/2017/07/169.jpg?resize=654%2C340", "http://usadailynews24.com/wp-content/uploads/2017/07/169.jpg", "https://i0.wp.com/usadailynews24.com/wp-content/uploads/2017/07/Breaking-News.jpg?resize=80%2C60", "https://i2.wp.com/usadailynews24.com/wp-content/uploads/2017/07/158.jpg?resize=80%2C60"], "title": "Wasserman Schultz Going To Mental Hospital After What She Did Overnight Desperate To Escape Arrest", "url": "http://usadailynews24.com/wasserman-schultz-going-mental-hospital-overnight-desperate-escape-arrest/", "summary": "", "movies": ["http://www.youtube.com/embed/q9wwKZYIxco?version=3&rel=1&fs=1&autohide=2&showsearch=0&showinfo=1&iv_load_policy=1&wmode=transparent"], "publish_date": {"$date": 1501283964000}, "source": "http://usadailynews24.com"}
