{"top_img": "http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg", "text": "HERE Is WHAT WILL HAPPEN If The DEEP STATE TAKES DOWN PRESIDENT TRUMP & It’s NOT PRETTY … FOR THEM\n\n“The tree of liberty must be refreshed with the blood of patriots and tyrants.” – Thomas Jefferson\n\nELDER PATRIOT – Corrupt politicians ignore Jefferson’s directive to their own detriment. It’s no longer political, it’s personal.\n\nAmericans have had their eyes opened by the ascension of Donald Trump and no amount of leftwing money can put the Freedom Movement genie back in the bottle.\n\nConservative Senator Ted Cruz made that observation after reviewing the results of the 2016 elections and the expectations of the voters.\n\nCruz, who had the most high profile personality clash with Donald Trump during the Republican primary process nevertheless embraced Trump’s America First agenda and said, “If we’re given the White House and both houses of Congress and we don’t deliver, I think there will be pitchforks and torches in the streets. And I think quite rightly.”\n\nCandidate Trump promised many things – border control, lower taxes, fairer trade relations, a balanced budget, healthcare that puts the people first not the government, safer communities, and – to the extent possible – an end to foreign wars. What, among those promises, should any Republican, nay any American, have a problem with?\n\nAfter four months without a single legislative achievement, Congressional and Senatorial Republicans – notably John McCain, Paul Ryan and Lindsey Graham – have joined the Democrats in investigating President Trump absent a single shred of evidence that an underlying crime has been committed.\n\nSo, what gives?\n\nWell, there was one additional promise that Trump made on his way to the White House that has some Republicans joining with Democrats and quaking in their boots, Trump’s promise to “Drain the Swamp.”\n\nAs we reported yesterday, “An F.B.I. agent with ‘intimate knowledge of the inner workings of the Clinton case’ told us that they uncovered evidence of such massive corruption that the agents involved realized that damned near the entire government could be brought down.”\n\nThe criminal co-conspirators in both parties realized almost immediately that the new sheriff wasn’t interested in joining them in the swamp so they launched, what can only be characterized as, a coup attempt.\n\nDemocrats are well schooled in such things probably because of their close alliance with Marxist regimes that can only gain power by seizing it through bloody civil wars. It should be noted that the Democratic Party has already done this once before.\n\nOne Hundred and Fifty-Seven years ago the Democrats waged a war against the First Republican President Abraham Lincoln for giving Blacks their freedom. That war came at a high price, as many as 700,000 Americans died fighting for what they believe in. To put that in perspective, these casualties exceed the nation’s loss in all its other wars, from the Revolution through Vietnam.\n\nToday, Americans are still prepared to fight and die to protect their children’s God-given freedoms. Despite what you are reading and hearing in the mainstream media, they aren’t the leftwing-funded rioters, the pussy hat-wearing feminists, or the cuck bois that cant handle a micro aggression. No, the Americans that back Donald Trump are well armed.\n\nDonald Trump’s presidency will move forward politically lest the sixty million patriots who voted for him, that are comprised of the large majority of military voters, police, and NRA members, move it forward by force.\n\nThese patriots are armed, trained, prepared, and have proven their discipline. They have grown disgusted by the corruption in Washington and will do whatever is necessary to make sure Trump’s Freedom Agenda moves forward and under the direction of Donald Trump himself.\n\nNo amount of fake news based on unsubstantiated charges by unnamed sources is going to change that. The battle lines have been drawn and no amount of finger pointing is going to convince these patriots to let anyone overturn the election results.\n\nSo why are establishment politicians courting a bloodbath on the streets of America that will also threaten them personally when they could be part of Making America Great Again? It’s because they have been caught red-handed and up to their eyeballs in a worldwide criminal conspiracy that has nothing to do with politics and everything to do with defrauding the American taxpayers.\n\nAnd, now that they’ve been caught robbing the world’s largest bank – the U.S. treasury – they have chosen to go out in a blaze of glory rather than try to defend the indefensible at trial.\n\nWashington’s criminal elites have chosen to go to war to unseat our duly elected president. It’s time to make our voices heard before this turns very ugly. Buckle your chin strap, America is counting on you.\n\nEDITORS NOTE: THIS IS NOT A CALL TO ARMS BUT RATHER AN ANALYSIS OF WHAT WOULD HAPPEN IF THE DEEP STATES OVERTURNS A DUELY ELECTED PRESIDENT.\n\nHERE IS A LIST OF EVERY SINGLE TIME OBAMA COMMITTED AN IMPEACHABLE OFFENSE THAT DEMS & MEDIA COVERED UP\n\n“Impeach!” It’s been more than eight years since Democrats uttered that word – long enough for anyone to wonder if it was still in their vocabulary, considering the deafening silence through the dozens of serious scandals during President Obama’s administration – but now that President Trump is the man in the White House, it’s back with a vengeance.\n\nDemocrats everywhere are wildly slinging the “I” word, hoping to nail Trump for high crimes and misdemeanors after the New York Times claimed a memo written by former FBI Director James Comey said the president urged him to end the federal investigation into former national security adviser Michael Flynn.\n\nSome members of Congress are getting in on the action. They include Reps. Maxine Water, D-Calif., and Al Green, D-Texas. Even a Republican, Rep. Justin Amash, claimed Wednesday there are grounds to impeach President Trump. House Oversign Committee Chair Rep. Jason Chaffetz, R-Utah, asked for the alleged Comey memo and other documents. Chaffetz tweeted that he is prepared to subpoena the information. And Sen. John McCain, R-Ariz., invoked “Watergate.”\n\nNow the Democratic Party is reportedly poll testing impeachment as a 2018 election issue. More than 1 million people signed a petition calling on Congress to impeach Trump.\n\nWasting no time Wednesday, the mainstream media sprang into action, enthusiastically echoing the left’s impeachment calls. MSNBC launched a Watergate ad implying Trump is America’s new Richard Nixon.\n\n“Watergate. We know its name because there were reporters who never stopped asking questions,” says MSNBC host Chris Hayes, who hinted that Trump is next on the impeachment chopping block. “Now, who knows where the questions will take us. But I know this: I’m not going to stop asking them.”\n\nMeanwhile, some overzealous members of the left plastered fliers around Washington, D.C., demanding all White House staffers resign Wednesday.\n\nThe posters read: “If you work for this White House you are complicit in hate-mongering, lies, corrupt taking of Americans’ tax money via self-dealing and emoluments, and quite possibly federal crimes and treason. Also, any wars will be on your soul. … Resign now.”\n\nBut constitutional scholar Jonathan Turley, who voted for President Obama, warned “impeachment” enthusiasts not to get ahead of themselves with President Trump. Why?\n\nAt this time, there’s no evidence Trump actually committed a crime.\n\n“The criminal code demands more than what Comey reportedly describes in his memo,” Turley wrote in a May 17 opinion piece posted at the Hill. Turley explained:\n\nFor the first time, the Comey memo pushes the litany of controversies surrounding Trump into the scope of the United States criminal code.\n\nHowever, if this is food for obstruction of justice, it is still an awfully thin soup. Some commentators seem to be alleging criminal conduct in office or calling for impeachment before Trump completed the words of his inaugural oath of office. Not surprising, within minutes of the New York Times report, the response was a chorus of breathless “gotcha” announcements. But this memo is neither the Pentagon Papers nor the Watergate tapes. Indeed, it raises as many questions for Comey as it does Trump in terms of the alleged underlying conduct.\n\nA good place to start would be with the federal law, specifically 18 U.S.C. 1503. The criminal code demands more than what Comey reportedly describes in his memo. There are dozens of different variations of obstruction charges ranging from threatening witnesses to influencing jurors. None would fit this case. That leaves the omnibus provision on attempts to interfere with the “due administration of justice.”\n\nHowever, that still leaves the need to show that the effort was to influence “corruptly” when Trump could say that he did little but express concern for a longtime associate. The term “corruptly” is actually defined differently under the various obstruction provisions, but it often involves a showing that someone acted “with the intent to secure an unlawful benefit for oneself or another.” Encouraging leniency or advocating for an associate is improper but not necessarily seeking an unlawful benefit for him.\n\n. Obama’s Iran nuke deal\n\nObama knew about Hillary’s private email server\n\nObama IRS targets conservatives\n\nObama’s DOJ spies on AP reporters\n\nObamacare & Obama’s false promises\n\nIllegal-alien amnesty by executive order\n\nBenghazi-gate\n\nOperation Fast & Furious\n\n5 Taliban leaders for Bergdahl\n\nExtortion 17\n\n‘Recess ‘ appointments – when Senate was in session\n\nAppointment of ‘czars’ without Senate approval\n\nSuing Arizona for enforcing federal law\n\nRefusal to defend Defense of Marriage Act\n\nIllegally conducting war against Libya\n\nNSA: Spying on Americans\n\nMuslim Brotherhood ties\n\nMiriam Carey\n\nBirth certificate\n\nExecutive orders\n\nSolyndra and the lost $535 million\n\nEgypt\n\nCap & Trade: When in doubt, bypass Congress\n\nRefusal to prosecute New Black Panthers\n\nObama’s U.S. citizen ‘hit list’", "authors": [], "keywords": [], "meta_data": {"generator": "WordPress 4.7.5", "og": {"site_name": "Patriot Crier", "description": "ELDER PATRIOT – New evidence has been uncovered by a private investigator that proves Jim Comey was a dirty cop who had to go. After former DNC staffer Seth Rich was murdered his family asked", "title": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE & COVERED IT UP FOR HILLARY", "locale": "en_US", "image": {"width": 640, "identifier": "http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg", "height": 375}, "updated_time": "2017-05-16T12:13:35-06:00", "url": "http://patriotcrier.com/1-6kk-0/", "type": "article"}, "twitter": {"image": "http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg", "description": "ELDER PATRIOT – New evidence has been uncovered by a private investigator that proves Jim Comey was a dirty cop who had to go. After former DNC staffer Seth Rich was murdered his family asked", "card": "summary", "title": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE & COVERED IT UP FOR HILLARY"}, "fb": {"app_id": 2008505042708638}, "article": {"section": "Featured", "published_time": "2017-05-16T11:21:57-06:00", "modified_time": "2017-05-16T12:13:35-06:00", "author": "facebook.com/Hillary4prisoner"}, "viewport": "width=device-width, initial-scale=1.0"}, "canonical_link": "http://patriotcrier.com/1-6kk-0/", "images": ["http://patriotcrier.com/wp-content/uploads/2015/11/Screen-Shot-2015-11-22-at-12.08.04-PM.png", "http://patriotcrier.com/wp-content/uploads/2015/11/dutch_politician_no_islam-680x365.png", "http://patriotcrier.com/wp-content/uploads/2015/11/Screen-Shot-2015-11-11-at-10.10.02-PM.png", "http://patriotcrier.com/wp-content/uploads/2015/10/p.jpg", "http://patriotcrier.com/wp-content/uploads/2015/11/ap_ap-photo977-wi-e1447519779396-640x481.jpg", "http://patriotcrier.com/wp-content/uploads/2015/11/Screen-Shot-2015-11-12-at-9.46.07-PM.png", "http://patriotcrier.com/wp-content/uploads/2015/11/Tulane-shooting-YouTube-NOPD-Screenshot-640x475.png", "http://patriotcrier.com/wp-content/uploads/2015/11/694940094001_4629980359001_trumpad2.jpg", "http://patriotcrier.com/wp-content/uploads/2015/11/Screen-Shot-2015-11-12-at-9.55.17-PM.png", "http://patriotcrier.com/wp-content/uploads/2015/10/download-12.jpeg", "http://patriotcrier.com/wp-content/uploads/2015/11/austrian-girls-isis-Samra-Kesinovic-Interpol-640x480.jpg", "http://patriotcrier.com/wp-content/uploads/2015/11/Screen-Shot-2015-11-24-at-11.10.25-AM.png", "http://patriotcrier.com/wp-content/uploads/2015/10/PUTINVALDAI.jpg", "http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg"], "title": "COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE & COVERED IT UP FOR HILLARY", "url": "http://patriotcrier.com/1-6kk-0/", "summary": "", "movies": [], "publish_date": {"$date": 1494955317000}, "source": "http://patriotcrier.com"}
