{"top_img": "http://nativestuff.us/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public3.jpg", "text": "Australia Becomes First Country To Begin Microchipping Its Public\n\nAustralia may become the first country in the world to microchip its public. NBC news predicted that all Americans would be microchipped by 2017, but it seems Australia may have already beaten them to it. Back in 2010, CBS news reported that the Australian government had a potential RFID microchipping plan in the works related to the health care system.\n\nNow, it seems that this plan is beginning to unfold but the push is not a result of mandated health care reforms, but rather a clever propaganda campaign that equates RFID microchipping with becoming superhuman, and people are begging for it.\n\nUnder the headline ‘Australians embracing super-human microchip technology’, Australia’s premier media outlet news.com.au (News Corp Australia) reports: It may sound like sci-fi, but hundreds of Australians are turning themselves into super-humans who can unlock doors, turn on lights and log into computers with a wave of the hand.\n\nShanti Korporaal, from Sydney, is at the centre of the phenomenon after having two implants inserted under her skin. Now she can get into work and her car without carrying a card or keys, and says her ultimate goal is to completely do away with her wallet and cards.\n\nShe told news.com.au:\n\n“You could set up your life so you never have to worry about any password or PINs it’s the same technology as Paypass, so I’m hoping you’ll be able to pay for things with it.”\n\n“With Opal you get a unique identification number that could be programmed into the chip. Any door with a swipe card … it could open your computer, photocopier. Loyalty cards for shops are just another thing for your wallet.”\n\nThe microchips, which are the size of a grain of rice, can act like a business card and transfer contact details to smartphones, and hold complex medical data. In her interview with the Australian news outlet, Shanti claims that her friends and family are envious of her microchip lifestyle:\n\n“My nana wants one. I’ve had more opposition to my tattoos than I’ve ever had to the chip. My friends are jealous.”\n\nIn fact, the 27-year-old has noticed a business opportunity and set up a distribution service called Chip My Life with her husband, Skeeve Stevens where for just $80 to $140, people can become so called “super humans.” On the same day this news story broke, Shanti appeared at Austarlia’s launch of the much anticipated cyborg themed video game Deus Ex Mankind Divided, alongside American implantable technology pioneer Amal Graafstra.\n\nAs you can see, the push for RFID microchipping and assimilating the human population with robots and technology, is something that will most likely be sold to the public as helping them to become “super human,” but clearly if you become part machine/computer, that means there will be someone who can control that technology. If you think the elites wouldn’t capitalize on such an exceptional opportunity to control the population you obviously don’t know history very well.\n\nAmal Graafstra, who became one of the world first RFID implantees back in 2005, just made headlines recently in the US with a prototype of the world’s first implant-activated smart gun and is a huge proponent for this new technology.\n\nHe’s written a book, spoken at TEDx and also appeared in a number of documentaries.\n\nIn an interview with the Australian media outlet, Amal explained that the technology he has implanted into his body has “given me the ability to communicate with machines. It’s literally integrated into who I am.”\n\nShanti has bought into the culture that dominates society today, which is one dominated by the fantasy of super heroes that mesmerizes the population at theaters all across the globe.\n\nEver since watching movies like the Terminator, Matrix and Minority Report I wondered if we could actually live like that. I always wondered why we all weren’t living as ‘super-humans’.\n\nClick to WATCH: Australia Becomes First Country To Begin Microchipping Its Public", "authors": [], "keywords": [], "meta_data": {"generator": "WordPress 4.8", "og": {"site_name": "Native American Stuff", "description": "Australia may become the first country in the world to microchip its public. NBC news predicted that all Americans would be microchipped by 2017, but it seems Australia may have already beaten them to it. Back in 2010, CBS news reported that the Australian government had a potential RFID microchippi", "title": "Australia Becomes First Country To Begin Microchipping Its Public", "url": "http://nativestuff.us/2017/06/australia-becomes-first-country-to-begin-microchipping-its-public/", "image": "http://nativestuff.us/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public3.jpg", "type": "article"}, "twitter": {"url": "http://nativestuff.us/2017/06/australia-becomes-first-country-to-begin-microchipping-its-public/", "image": "http://nativestuff.us/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public3.jpg", "description": "Australia may become the first country in the world to microchip its public. NBC news predicted that all Americans would be microchipped by 2017, but it seems Australia may have already beaten them to it. Back in 2010, CBS news reported that the Australian government had a potential RFID microchippi", "card": "summary_large_image", "title": "Australia Becomes First Country To Begin Microchipping Its Public"}, "fb": {"pages": 257673987979945, "app_id": 197614150768306}, "ia": {"markup_url": "http://nativestuff.us/2017/06/australia-becomes-first-country-to-begin-microchipping-its-public/?ia_markup=1"}, "article": {"section": "Uncategorized"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://nativestuff.us/2017/06/australia-becomes-first-country-to-begin-microchipping-its-public/", "images": ["http://thedailycheck.net/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public4.jpg", "http://thedailycheck.net/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public3.jpg", "http://nativestuff.us/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public3.jpg", "http://thedailycheck.net/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public.jpg", "http://thedailycheck.net/wp-content/uploads/2017/06/Australia-Becomes-First-Country-To-Begin-Microchipping-Its-Public2.jpg"], "title": "Australia Becomes First Country To Begin Microchipping Its Public", "url": "http://nativestuff.us/2017/06/australia-becomes-first-country-to-begin-microchipping-its-public/", "summary": "", "movies": ["https://www.youtube.com/embed/cUQbh7Rj8Ug?rel=0&showinfo=0"], "publish_date": null, "source": "http://nativestuff.us"}
