{"top_img": "http://uspoln.com/wp-content/uploads/2016/11/Stephen-Bannon-645x325.jpg", "text": "The recently installed CEO of Donald Trump was accused of domestic violence against his second wife, who later said he threatened to leave her penniless unless she failed to testify against him. According to Politico, Breitbart News chairman Stephen Bannon was charged with battery, dissuading a witness, and misdemeanor domestic violence in connection with a January 1996 incident in the couple’s southern California home.\n\n“I was wondering when this would come up,” Bannon told Politico. “It’s been a while and given my current position at the head of Donald Trump’s campaign, I was curious to see how long it would take the Democrats to start digging around my past and try to find enough filth and misinformation to use as ammunition to bring me down. And while we’re on the subject, I’m actually disappointed; I honestly didn’t expect them to take this long,” he said laughingly.\n\nAsked to comment on the validity of the charges against him, Bannon first attempted to circle around a direct answer to the question and said, “Well, look, you know things like these are orchestrated, right? I mean, no one in their right mind would be looking to shoot down people that aren’t targeting them in the first place. And the fact that this is happening right now, like, 20 years later, I mean, it’s just ridiculous. Why would someone be doing this if not to discredit me and in doing so, Donald Trump as well? It’s so obvious I honestly find it hilarious.”\n\nBut, once the interviewer persisted in the search for a direct answer, Bannon said, “Alright, look, that’s the thing about marriage, right, you get to do all the things you’re not supposed to in a relationship, that’s the whole beauty of it. And just like there’s no rape in marriage, so too can nobody blame you if you smack your wife around a couple of times so long as you’re doing it out of love. As a matter of fact, I’ll have you know that some women actually enjoy being beaten by their husbands, and I don’t mean that in everyday life. I’m talking about when they’re performing their marital duties,” he argued.\n\n“So, that’s why I find these charges preposterous, they’re so idiotic that I’m not even sure how they’re still interesting,” Bannon added. “Because, God made it very clear: when you get married, you have certain duties and obligations to your spouse. And one of those obligations is to love and respect your partner no matter what. And I loved my ex wife, I loved her dearly. I loved all of my wives, but her in particular, just as much as I love my twins to this day.”\n\n“And when you’re in love, everything’s allowed, I don’t care what anyone says, when you say the words ‘I do,’ and you let your partner put a wedding ring on your finger, you belong to them in every way possible. At no point did I exceed my marital liberties, so why should I, or worse, why should Donald Trump be punished for it?” he concluded.\n\nsource:politicops.com\n\nComments\n\ncomments", "authors": [], "keywords": [], "meta_data": {"generator": "WordPress 4.8.1", "og": {"site_name": "USPOLN", "description": "The recently installed CEO of Donald Trump was accused of domestic violence against his second wife, who later said he threatened to leave her penniless unless she failed to testify against him. According to Politico, Breitbart News chairman Stephen Bannon was charged with battery, dissuading a witness, and misdemeanor domestic violence in connection with a …", "title": "Stephen Bannon: “Nobody Can Blame You For Beating Your Wife If It’s Out Of Love”", "locale": "en_US", "image": {"width": 645, "identifier": "http://uspoln.com/wp-content/uploads/2016/11/Stephen-Bannon-645x325.jpg", "height": 325}, "updated_time": "2017-02-25T01:48:32+00:00", "url": "http://uspoln.com/2016/11/14/stephen-bannon-nobody-can-blame-beating-wife-love/", "type": "article"}, "twitter": {"image": "http://uspoln.com/wp-content/uploads/2016/11/Stephen-Bannon-645x325.jpg", "description": "The recently installed CEO of Donald Trump was accused of domestic violence against his second wife, who later said he threatened to leave her penniless unless she failed to testify against him. According to Politico, Breitbart News chairman Stephen Bannon was charged with battery, dissuading a witness, and misdemeanor domestic violence in connection with a […]", "card": "summary", "title": "Stephen Bannon: “Nobody Can Blame You For Beating Your Wife If It’s Out Of Love”"}, "fb": {"app_id": 1112629802167457}, "article": {"publisher": "https://facebook.com/uspoln/", "section": "OPINION", "published_time": "2016-11-14T01:34:20+00:00", "modified_time": "2017-02-25T01:48:32+00:00"}, "viewport": "user-scalable=yes, width=device-width, initial-scale=1.0, maximum-scale=1"}, "canonical_link": "http://uspoln.com/2016/11/14/stephen-bannon-nobody-can-blame-beating-wife-love/", "images": ["http://uspoln.com/wp-content/uploads/2017/07/Buzz-Aldrin-645x325-380x260.jpg", "http://uspoln.com/wp-content/uploads/2016/11/BN-KF933_USREFU_GR_20150910140957-375x195.jpg", "http://uspoln.com/wp-content/uploads/2017/07/IMG_6827-145x100.jpg", "http://uspoln.com/wp-content/uploads/2017/07/michelle-bachmann-645x325-145x100.jpg", "http://uspoln.com/wp-content/uploads/2016/11/Stephen-Bannon-645x325.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Screen-Shot-2017-07-07-at-6.53.36-PM-730x480-145x100.png", "http://uspoln.com/wp-content/uploads/2016/11/hqdefault-1-7-645x325-375x195.jpg", "http://uspoln.com/wp-content/uploads/2016/10/paul-ryan-645x325-145x100.png", "http://uspoln.com/wp-content/uploads/2017/02/sarah-palin-645x325-380x260.png", "http://uspoln.com/wp-content/uploads/2017/07/Brennan-640x360-380x260.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Brennan-640x360-145x100.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Donald_Trump_Jr-696x464-1-145x100.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Trey-Gowdy-645x325-380x260.jpg", "http://uspoln.com/wp-content/uploads/2017/07/Cop-1-380x260.jpg"], "title": "“Nobody Can Blame You For Beating Your Wife If It’s Out Of Love”", "url": "http://uspoln.com/2016/11/14/stephen-bannon-nobody-can-blame-beating-wife-love/", "summary": "", "movies": [], "publish_date": {"$date": 1479081600000}, "source": "http://uspoln.com"}
