{"title": "Japanese whaling crew eaten alive by killer whales 16 dead", "text": "A Japanese whaling crew has fallen victim to a dramatic full on assault by a school of killer whales, killing no less than 16 crew members and injuring 12, has reported the Japanese Government this morning.\r\nThe crew of the MV Nisshin Maru (日新丸), Japan’s primary whaling vessel and the world’s only whaler factory ship, was forced to leave the deck temporarily as a gas leak was detected within the ship’s processing factory that resulted in the ship being temporarily disabled all while continuing to carry approximately 1,000 tons of oil.\r\n\r\nThe resulting panic lead members of the ship to jump off the boat before proper emergency procedures were taken and lifeboats had been set to sea.  The swimming crew members were then ferociously attacked by a school of killer whales, that decimated a large number of the crew within moments. “It was horrific” claims Asuka Kumara, a mechanical engineer who witnessed the gruesome  scene. “The water was red with blood, there were bodies everywhere” he recalls in tears.\r\n\r\nWithin 30 minutes of the incident, 16 crew members had disappeared into the ocean.\r\nThe incident occurred in the Southern Ocean Whale Sanctuary, near the South Eastern Coast of South Africa, a controversial area to be whaling as a recent international court ruling has ordered the country to ends its whale hunt in the Antarctic. The East Asian nation halted its annual Antarctic whaling mission after the U.N.’s International Court of Justice (ICJ) ruled last march the hunt violated an international moratorium on commercial whaling.\r\n\r\n“It seems Japan just doesn’t give a damn about international law” explains environmental activist and spokesman for Greenpeace Canada, James Ben Shahali, based in Vancouver. “The waste of life is always a shame, but the whales are not to blame here, they were only doing what they are born to do: kill for food” he adds.\r\n\r\nSome Greenpeace supporters have even celebrated the incident as a victory for the cause \r\nSome Greenpeace supporters have even celebrated the incident as a victory for the fight against whale hunting worldwide\r\n\r\nJapan has slaughtered over 6,000 whales since commercial whaling was made illegal by the International Whaling Commission (IWC) moratorium passed in 1986."}