{"top_img": "http://static.politico.com/dc/32/37522582478b8a5b352c169af96b/gettyimages-501527038.jpg", "text": "Getty Images Fourth Estate In Defense of ‘He Said/She Said’ Journalism Why we must give the devil his due.\n\nThe “he said/she said” method of reporting—in which journalists observe the profession’s convention and get at least two sides of every story—has been taking it on the chin ever since New York University journalism professor Jay Rosen placed it in his gunsights in 2009 and started ack-acking it with regularity.\n\nBut the \"he said/she said\" debate didn’t move from the margins to the mainstream until last week when the New York Times abandoned mechanical balance and published a Page One, above-the-fold piece by Michael Barbaro, shredding Donald Trump as a pitiful serial liar and obfuscator for his latest “birther” declaration. The Times piece elated critics of the \"he said/she\" said construct. In an Atlantic piece titled “The Death of ‘He Said, She Said’ Journalism,” Peter Beinart pronounced Barbaro’s work a journalistic sea change. Trump had broken all the rules of political conduct, Beinart stated, and the Times had rightly ditched a few of its own. Abandoning the usual journalistic etiquette, which calls for mendacious politicians to be described as committing a falsehood when what they’re actually doing is lying, the Times piece dealt with Trump with “astonishing bluntness,” Beinart wrote, repeatedly calling Trump’s birther nonsense a “lie.” Trump was given no opportunity in the piece to deny the charges, which sits just fine with the \"he said/she said\" critics.\n\nStory Continued Below\n\nWhile I consider Trump to be a first-rate liar and don’t mind saying so, I’m not convinced that jettisoning the \"he said/she said\" blueprint is such a good idea. Every politician lies. If we were to police all politicians in the news pages the way Barbaro did Trump, it would be entertaining. But political journalism as we know it could expire as profiles and news stories collapsed into spreadsheets grading the truth value of political utterances. Isn’t that what the fact-checker columns are for?\n\nIn his widely applauded critiques of \"he said/she said\" journalism, Rosen holds that by reflexively seeking the “other side” of every public dispute and shying away from expressing the truth, the media creates a bogus symmetry between the “he said” voices in a story and the prevaricators serving up the “she said” dissent. “Do users really want to be left helpless in sorting out who’s faking it more?” Rosen asked, proposing that journalists put a higher premium on seeking truth and avoiding distortion. The \"he said/she said\" structure constitutes “one of the lowest forms of journalism in existence,” he would later remark.\n\nDonald Trump, the thinking goes, has gamed the \"he said/she said\" convention to contaminate the political debate with his lies, obfuscations and double-talk whenever the press seeks comment on an issue, a clarification of something he’s said, or a response to a point raised by his opponent, Hillary Clinton. This is true. In speeches and interviews, he’s expressed a broadband stream of lies, such as denying that he’s used terms like “fat pig” to describe women, insisting that he never called George W. Bush a liar, claiming that he opposed the Iraq War, making fallacious boasts about his acts of philanthropy, asserting that the NFL had contacted him about the debate schedule, and more, much more. But they are lies, all lies. And every time the media quotes one of Trump’s “she said” lies without a correcting fact-check, it undermines the truth of the “he said” side of the debate. At least, so the thinking goes.\n\nBut has journalists' practice of giving Trump the right of reply, allowing him to pearl his lies with another coating of deceit really been such a disaster? One result of the straight, \"he said/she said\" coverage of the Trump style has been his record lows in the Washington Post/ABC News favorability poll. Thanks to this coverage, many voters are able to see through Trump’s “post-truth” style of politics and don’t need the news pages directly calling him a lying liar who lies every time he speaks. Among his supporters, many don’t care that he mangles the facts and others take secret glee in the trickster’s campaign he’s waging for the presidency: He’s serving baloney and his supporters can’t get enough of it.\n\nAs bracing and as full of truth-telling as the Barbaro piece was, I hope it doesn’t embolden other news pages to abandon convention. The formula, when properly executed, forces reporters to perform due diligence in their articles. The form is even more useful for skeptical “show me” readers, who want those extra bits of evidence to help them make up their mind about a candidate or an issue. This, I realize, can be especially challenging with Trump because the Mouth of Manhattan has made a career of taking both sides on nearly everything. He is the hermaphrodite of opinion makers—both \"he said and she said\"—and, like any good circus freak, that makes him too exceptional to build rules from.\n\nOne reason I admire \"he said/she said\" journalism is that I often find myself sympathizing with the \"she-said\" side of the equation, and its presence assures me that the reporter is conducting something approximating an open inquiry. Whenever the \"she-said\" component of a story goes missing, leaving only the dominant position expressed, I get the feeling I’m being fed bunk. Even the Holy Bible gives Satan a forum for his dastardly views. So why not news stories?\n\nI don’t believe a story must balance out like a chemistry equation until both sides (or multiple sides) hover in the ether in perfect equilibrium. But intellectual history informs us that the dominant positions in any field—ruling paradigms, if you don’t mind the language—have a tendency to erode over time when exposed to minority critiques. In order for thought to progress, the minority report—however seemingly misguided—must be heard.\n\nThe history of science is pockmarked with paradigms that were blown away by she-saiders. Early in the last century, for example, the scientific and cultural elites espoused the misguided philosophy of eugenics, which held that feeblemindedness was directly inheritable and that forced sterilization, institutionalization or lobotomization for these lessers was right and just. To oppose eugenics was to place yourself outside the established consensus, to define yourself as a crackpot, to be reduced to a \"she-said\" if you were lucky enough to get quoted in a news story. Today, we think of the eugenicists as troglodytes.\n\nOr consider the story of Alfred Wegener. He 1912, he proposed his plate tectonic theory much to the derision of the scientific establishment who laughed at the idea of continental drift. Not until the 1960s did his ideas gain proper respect, and his critics take his place as geology’s crackpots. Or take the example of Australian doctor Barry Marshall, who conjectured in the early 1980s that bacteria and not stress was the cause of ulcers, a condition that afflicted up to 10 percent of all adults. Even after Marshall induced an ulcer in his own stomach by drinking a potion containing Helicobacter pylori he was still derided and marginalized by the establishment. “You think, ‘It’s science; it’s got to be accepted,’” Marshall told Discover magazine. “But it’s not an absolute given.” By the mid-1990s, the idea finally took root, undermining the business model of thousands of gastroenterologists who treated and retreated the affliction with ineffective drugs and surgery. In 2005, Marshall and a colleague were awarded the Nobel Prize in medicine for their Helicobacter pylori work. Science abounds with equally dramatic stories.\n\nObviously, the critiques of every she-saider don’t automatically end in the triumphs Wegener and Marshall enjoyed. But when you catalog the ruling paradigms in science and technology that have been toppled in recent years, the toppler was almost always marginalized in the early going. Fracking has all but destroyed the peak oil hypothesis. The “one-size, fits all” advice on mammograms has been abandoned. Our views on saturated fat, once almost holy writ, have been chucked. Until 1973, the American Psychiatric Association classified homosexuality as a mental disorder. (All is not progress: Some now argue that “homophobia” is an indicator of a disorder.) Marijuana makes you mad. (Today, the equally suspicious paradigm is that marijuana is good for whatever ails you.) Coffee, once thought to be bad for you, turns out to be good for you, at least for now. Moving over to the policy realm, the once dominant “super-predator” thesis was once supported across partisan lines. It is now discredited. Remember how Japan’s economy was supposed to overtake the United States’? Remember how Federal Reserve Board Chairman Alan Greenspan said the U.S. economic system was stable? Experts predicted wild inflation after quantitative easing. Others posited that housing prices would never decline nationwide. And so on.\n\nThe dissents of the she-saiders are generally beneficial. Whether right or wrong, the dissenters have a way of increasing everybody’s knowledge. If they are wrong, as Michael Shermer has written, their untruths force the dominant paradigm to self-examine, and if warranted, use new evidence to improve its position. If the she-saiders are right, they advance human thought. That’s how science works, and I believe journalism should work that way, too. Vaccine pioneer Jonas Salk summarized the predictable moves of the knee-jerk paradigm-defenders with this progression. “First,” Salk writes, they say “that it can’t be true.” Second phase: “Well, if it’s true, it’s not very important.” Third phase: “Well, we’ve known it all along.”\n\nBefore anybody puts words in my mouth, this is not my long-winded way of saying I don’t subscribe to the global warming hypothesis. I do—but at the same time, I keep my options open. The protectors of the ruling paradigm have an intellectual responsibility to mount disciplined defense against all comers. Even against crackpots.\n\nThe last and best reason for supporting “he said/she said” journalism: So many readers and viewers have self-segregated by limiting their news consumption to outlets that reflect their personal views. These days, many readers get only the \"he said\" side of the story or just the \"she said\" side, remaining deliberately oblivious to the vibrant debate that might actually be going on. While I value partisan media, I also value nonpartisan news operations—like POLITICO—that make ideas duel in their news pages. NPR News Director Michael Oreskes puts this practical spin on why his organization shies away from calling liars liars: “[I]f you present the facts calmly and without a tone of editorializing, you substantially increase the chance that people will hear you out and weigh the facts. That is why the tone of journalism matters so much. We need potential listeners and readers to believe we are presenting the facts honestly, and not to confirm our opinions.”\n\nIf you’re not getting a steady diet of \"she said\" quotations in your news consumption, you’re at risk of starving to death. \"He said/she said\" keeps journalists honest, even if, on occasion, it looks like it’s only accruing to the benefit of a beast like Donald Trump.\n\n******\n\nA sumptuous meal of news, news, news. Make mine extra rare, garcon. Send news recipes via email to Shafer.Politico@gmail.com. My email alerts are breakfast. My Twitter feed is lunch. And my RSS feed is a stingy snack.\n\nJack Shafer is Politico’s senior media writer.", "authors": ["Jack Shafer"], "keywords": [], "meta_data": {"description": "Why we must give the devil his due.", "og": {"site_name": "POLITICO Magazine", "description": "Why we must give the devil his due.", "title": "In Defense of ‘He Said/She Said’ Journalism", "url": "http://politi.co/2cqBGl6", "image": "http://static.politico.com/dc/32/37522582478b8a5b352c169af96b/gettyimages-501527038.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/shafer-he-said-journalism-false-equivalency-214276", "images": ["https://static.politico.com/dims4/default/c75e5f8/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fdc%2F32%2F37522582478b8a5b352c169af96b%2Fgettyimages-501527038.jpg", "http://static.politico.com/dc/32/37522582478b8a5b352c169af96b/gettyimages-501527038.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "In Defense of ‘He Said/She Said’ Journalism", "url": "http://politi.co/2daL69Q", "summary": "", "movies": [], "publish_date": {"$date": 1474607580000}, "source": "http://politi.co"}
