{"top_img": "http://v.politico.com/images/1155968404/201609/2122/1155968404_5141376081001_5133513424001-vs.jpg?pubId=1155968404", "text": "2016 Obama’s team isn’t laughing at Trump anymore The president’s aides worry the Republican represents more of America than a fringe.\n\nObamaworld laughed as it watched Donald Trump’s hostile takeover of the GOP. After eight years of Republican opposition, inconsistent policy demands and racialized hate against the first black president, President Barack Obama’s aides, past and present, thought Republicans had gotten what they deserved--and more, all but forfeiting the 2016 race to the woman they defeated eight years ago.\n\nThey’re not laughing anymore.\n\nStory Continued Below\n\nGoing into Monday night’s debate, Obama’s team is feeling that same anxiety expressed by some top Hillary Clinton aides: maybe the country isn’t what they thought, maybe the resistance to Obamacare and gay marriage and the progress they’re so proud of is broader than the vocal fringe they’ve always dismissed. Maybe, the president’s aides – current and former – now concede, they’re going to have to live with the fact that Trump could end up in the Oval Office in part due to a backlash against Obama.\n\n“I’m trying to think of a series to compare it to, which was a series that started as a comedy and became a high stakes drama,” said Ben LaBolt, a former White House aide and press secretary for Obama’s 2012 reelection campaign. “I feel like we’re maybe in the fifth season of ‘Breaking Bad’ here. We’re way beyond the laughs, and just sitting on the edge of our seats in terror.”\n\n“There's not a lot of mirth in the circles I run in about him,” said another former senior Obama campaign staffer.\n\nPrivately, Obama has expressed mixed feelings, according to people close to the president. He’s still nursing amusement at Republicans for being hapless enough to get railroaded by Trump, but it’s mixed with frustration that there are so many Americans he failed to reach. People who've spoken to him say the president wonders what he might have done differently to break through in a way that would make people who’ve benefited from his policies—like those enjoying added health benefits courtesy of Obamacare—support Democrats.\n\nFor Obamaworld staffers who had just been starting to settle into a new buoyancy about the president's climbing approval numbers, Trump’s growing strength is an agonizing reminder of how far short they have fallen in delivering on ‘hope.' Even if Clinton wins, the Republican has shown not only that America is divided between red and blue but that there’s an America that Obama never connected with at all, and where all his data and rational arguments and appeals to sensibilities are as useless as Monopoly money.\n\n“We are still the country that elected Barack Obama in 2008, and we are capable of that and more,” said Jim Papa, a former special assistant for legislative affairs in the White House. “But we’re also capable of making bad choices and being seduced by someone who plays to fears and anxieties and racial differences.”\n\nTrump’s already done things they never thought he could, like mainstreaming racist rhetoric and racking up so many small donors that they worry about the extent of his support. And that was even before he riled up Obama doubters again with his birther pirouette.\n\nAnd the result: Trump’s doing better in the polls at this late stage than Obama’s team imagined. With 43 days to go, Trump and Clinton are essentially tied, polls sitting within the margin of error, even in battleground states.\n\nThough only a few weeks ago, current and former Obama aides would joke about how the president’s great political legacy might be the Republican Party destroying itself in front of him. Now, on the record, they push back on the very suggestion that Obama’s legacy should be viewed in any frame that Trump also occupies.\n\n“I don’t think he thinks it’s his legacy, I don’t think any of us think it’s his legacy,” said Dan Pfeiffer, a former senior adviser to the president. “Trumpism is a lot of things in this country. President Obama is the face of that for some Republicans, but the Republican Party got themselves into this mess.”\n\nBut they worry about what even a Trump loss says about Obama’s America.\n\n“I think he will lose badly in this election, but I think the impact he’s had on our political process is incredibly damaging, and will be lasting,” said Tommy Vietor, a former national security spokesman who noted that his own amusement at Trump ended a year ago. “He’s made us look stupid. I think he is stupid.”\n\nFor any efforts Obama made in urging people to disagree without being disagreeable, as the president likes to say, “Trump has shattered that,” Vietor said. “He has brought back a brand of politics that is you punch your opponent as hard as you can, it doesn’t matter if it’s a low blow, it doesn’t matter if it’s not of substance. That’s a bad lesson for people to learn.”\n\nAccording to Earnest, Obama is serious about wanting a functional opposition and wishes that he’d had one to negotiate with on immigration reform, trade, infrastructure and other priorities. The sense of lost opportunity eats at them, as does the sense that it’s not going away, despite their confidence in Clinton’s chances.\n\n“I’m not saying we’d all be playing acoustic guitar in a circle on the National Mall, but I am saying we would have progress to show for our efforts,” said White House press secretary Josh Earnest, who's been with the president since the first campaign.\n\nNot everyone’s inside Obamaworld is down. Some schadenfreude remains.\n\n“He's still exposed and ripped apart factions of the GOP, enhanced their brand as hostile to a rising electorates, and will leave them with no infrastructure,” said a more upbeat former Obama 2008 campaign spokesman Hari Sevugan.\n\nAnd Democrats’ sense of the vacuous GOP that Trump represents continues to resonate, particularly as they see the Republican nominee attack an economy that’s gone wrong with the support of many of the same people who opposed the policies that the president credits for the economic rebound that includes the longest period of sustained growth and taxpayers repaid with interest from the bailouts that caused so much trouble.\n\n“The eight-year legacy of the recovery from the Great Recession is clear evidence that the Tea Party movement,” said Earnest, “is intellectually bankrupt—or about something other than the economy.”\n\nBut that doesn't take care of their grief about the state of American politics.\n\n“I’d rather live in a world where the two parties really compete,” Papa said, “than have a political edge on the Republican Party but have to live in a world where white supremacists have a channel and are legitimized.”\n\nAuthors:", "authors": ["Edward-isaac Dovere", "Eli Stokols", "Politico Staff", "Jack Shafer"], "keywords": [], "meta_data": {"description": "The president’s aides worry the Republican represents more of America than a fringe.", "og": {"site_name": "POLITICO", "description": "The president’s aides worry the Republican represents more of America than a fringe.", "title": "Obama’s team isn’t laughing at Trump anymore", "url": "http://politi.co/2cW1RDp", "image": "http://v.politico.com/images/1155968404/201609/2122/1155968404_5141376081001_5133513424001-vs.jpg?pubId=1155968404", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/barack-obama-donald-trump-228649", "images": ["http://v.politico.com/images/1155968404/201609/2122/1155968404_5141376081001_5133513424001-vs.jpg?pubId=1155968404", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Obama’s team isn’t laughing at Trump anymore", "url": "http://politi.co/2cW2vAD", "summary": "", "movies": [], "publish_date": {"$date": 1474866060000}, "source": "http://politi.co"}
