{"top_img": "http://a.abcnews.com/images/US/AP_Explosion3_ml_160919_1_16x9_992.jpg", "text": "The recent connected bombings in New York and New Jersey and the stabbing attack at a mall in Minnesota have increased interest in how the presidential candidates would handle national security.\n\nHillary Clinton and Donald Trump have spoken out since the attacks, which left dozens of people injured.\n\nJohn Cohen, a former counterterrorism coordinator for the Department of Homeland Security, said he believes that the terrorist attacks that have occurred during the campaign \"have a significant impact\" on voters.\n\n\"When events occur like this ... you tend to have people become more fearful, and when people are more fearful, they tend to gravitate towards a candidate who appears to be more strong,\" said Cohen, who currently works as an ABC News consultant.\n\nThree of the latest national polls — all conducted before the attacks this weekend — had Clinton leading when respondents were asked whom they trust to handle the issue of terrorism.\n\nIn an ABC News/Washington Post poll released Sept. 11, Clinton led, 50 percent to Trump's 41 percent among all adults and 48 percent to Trump's 45 percent among likely voters when asked about who was more trusted to handle terrorism.\n\nA CBS/New York Times poll released Sept. 14 had Clinton doing \"a better job handling terrorism and national security\" according to 49 percent of respondents, compared with Trump's 45 percent.\n\nThe split was closest in a Quinnipiac poll released Sept. 15, in which respondents were asked who they thought would do a better job keeping the country safe from terrorism, \"regardless of how you intend to vote.\" In that poll, Clinton got 49 percent to Trump's 47 percent.\n\n\"Traditionally, it's been the Republican Party who has projected strength and awareness in the area of law enforcement and homeland security, but today that's kind of flipped because, despite his rhetoric, there are a number of national security experts who have raised concerns about the level of understanding that Donald Trump has as it relates to terrorism and national security threats,\" Cohen said.\n\nAndres Kudacki/AP Photo\n\nCurrent events are factoring into the political campaigns, with the candidates scheduling speeches about national security in the wake of attacks. But Cohen said political rhetoric could also be affecting and even motivating the attacks themselves.\n\nHe said Trump's rhetoric and calls to bar foreign Muslims from entering the United States \"may even serve to further along those who are becoming inspired to act on [ISIS'] behalf.\"\n\nJames Campbell, a professor of political science at the University at Buffalo in New York who has written a book about political polarization, told ABC News that he believes the attacks translate to a potential advantage for Trump.\n\n\"I have to think that terrorist events in this country help Trump and hurt Clinton. For these events to be occurring with the frequency they do may be read by many as a failure of the current administration and particularly its foreign policy team to effectively deal with the problem,\" he said.\n\n\"It may also suggest that we need a tougher approach to dealing with terrorism, an approach associated with Trump. When suspects are identified who have Muslim-sounding names, then that may further fuel support for tougher immigration standards and scrutiny,\" Campbell added.", "authors": ["More Meghan", "Abc News"], "keywords": [], "meta_data": {"fb_title": "Terrorist Attacks Likely to Affect 2016 Race, Experts Say", "description": "Reaction to attacks may not be the same as normal, however.", "copyright": "Copyright (c) 2017 ABC News Internet Ventures", "author": "ABC News", "og": {"site_name": "ABC News", "description": "Reaction to attacks may not be the same as normal, however.", "title": "Terrorist Attacks Likely to Affect 2016 Race, Experts Say", "url": "http://abcnews.go.com/Politics/terrorist-attacks-impact-2016-presidential-race-experts/story?id=42192997", "image": "http://a.abcnews.com/images/US/AP_Explosion3_ml_160919_1_16x9_992.jpg", "type": "article"}, "twitter": {"description": "Reaction to attacks may not be the same as normal, however.", "title": "Terrorist Attacks Likely to Affect 2016 Race, Experts Say", "url": "http://abcnews.go.com/Politics/terrorist-attacks-impact-2016-presidential-race-experts/story?id=42192997", "image": "http://a.abcnews.com/images/US/AP_Explosion3_ml_160919_1_16x9_992.jpg", "creator": "@mkeneally", "site": "@ABC", "app": {"url": {"ipad": "abcnewsipad://link/story,42192997", "iphone": "abcnewsiphone://link/story,42192997", "googleplay": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/terrorist-attacks-impact-2016-presidential-race-experts/story?id=42192997"}, "name": {"ipad": "ABC News", "iphone": "ABC News", "googleplay": "ABC News"}, "id": {"ipad": 306934135, "iphone": 300255638, "googleplay": "com.abc.abcnews"}}, "card": "summary_large_image"}, "robots": "index, follow", "DC.date.issued": "2016-09-19", "al": {"ipad": {"url": "abcnewsipad://link/story,42192997", "app_store_id": 380520716, "app_name": "ABC News for iPad"}, "web": {"url": "http://abcnews.go.com/Politics/terrorist-attacks-impact-2016-presidential-race-experts/story?id=42192997"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/terrorist-attacks-impact-2016-presidential-race-experts/story?id=42192997", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "iphone": {"url": "abcnewsiphone://link/story,42192997", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}}, "Date": "2016-09-19", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "Last-Modified": "2016-09-19 18:04:32", "keywords": "Donald Trump, Hillary Clinton, 2016, presidential race, politics news, election news, political news, political news articles", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "news_keywords": "Donald Trump, Hillary Clinton, 2016, presidential race"}, "canonical_link": "http://abcnews.go.com/Politics/terrorist-attacks-impact-2016-presidential-race-experts/story?id=42192997", "images": ["http://a.abcnews.com/images/US/AP_Manhattan_Explosion7_ml_160919_1_4x3_992.jpg", "http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "http://a.abcnews.com/images/US/AP_Explosion3_ml_160919_1_12x5_992.jpg", "http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "http://a.abcnews.com/images/US/AP_Explosion3_ml_160919_1_16x9_992.jpg"], "title": "Terrorist Attacks Will Likely Affect 2016 Presidential Race, Experts Say", "url": "http://abcn.ws/2cDjJ92", "summary": "", "movies": [], "publish_date": null, "source": "http://abcn.ws"}
