{"top_img": "http://static.politico.com/c9/c0/fae428464ce8b51f984194f193fd/160926-greenfield-hillary-ap.jpg", "text": "I’ve watched every presidential debate ever broadcast, including the little-remembered John F. Kennedy-Hubert Humphrey contest just before the 1960 West Virginia primary, and for nearly 40 years I've analyzed how candidates win and lose them. But when I ask myself what kind of strategy I would devise for Hillary Clinton tonight against Donald Trump, I’m pretty much baffled.\n\nThe problem is not just the unpredictable (to put it mildly) nature of her opponent. (Will Trump be low-key and calm? Will he attack her honesty? Will he turn on Lester Holt after the first tough question and walk off the stage?) The problem is that almost all of Hillary Clinton’s strengths, in this strange election year, can so easily be turned into her weaknesses—especially her vast experience in government. The more she emphasizes her qualifications, the more Trump is likely to respond with some version of: “You’ve been at the center of power for 25 years? Then you’re one of those who’s created the mess we’re in.” So reciting her work with foreign leaders, for example, and contrasting it with Trump's utter lack of grounding in the world, doesn't seem to be promising.\n\nStory Continued Below\n\nIndeed, this debate offers Trump the chance to perform what I’ve called “political judo”—turning an opponent’s strength against her. (“Yes, Mrs. Clinton, your experience helped drag us into Iraq, and turned Syria, Libya, the whole Middle East into a staging ground for ISIS. Maybe that’s why your husband's CIA director, and Bobby Kennedy’s chief speechwriter, are backing me.”)\n\nFurther, there's a sense—a highly limited sense—in which Trump is in something like the position Ronald Reagan was in back in 1980. Among college-educated whites, who have resisted him so far, his task is to use the debates to say, “I'm a reasonable person who knows what's gone wrong and who has the instincts to fix it.” It's a second cousin of the 1980 situation where many voters did not want Carter, but needed reassurance about Reagan, which they got. (There is a limit to this analogy, because for all of her difficulties, Clinton is in a much stronger position than President Carter was).\n\nBy contrast, how does she try to gain strength on the issue of “honest and trustworthy”? If Trump can be convinced by his handlers—assuming they exist—to avoid overkill here, all he has to do is to note what the FBI director or the New York Times editorial page has said. She can of course cite chapter and verse on Trump—bankruptcies, Trump University, David Farenthold's expose of his charities in the Washington Post—but those issues are ill-suited, I think, to a face-to-face debate. One of her problems, longstanding, is that the stuff of which campaign collapses are made have been leveled at Trump—and he's still standing.\n\nDoes any of this mean that Clinton is facing doom Monday night? No. It does suggest that her campaign should remember what debates do and don’t do, based on a half-century or so of history.\n\nThe Focus Is on “Moments”—But They’re Not Always The Key\n\nAsk any political journalist to recite the history of debates, and it would go something like this:\n\n“Nixon looked pale and drawn; Ford prematurely liberated Poland from Soviet Control; Reagan said to Carter ‘there you go again,’ then asked Americans ‘are you better off?’ Four years later, he was incoherent, but then recovered by joking about Mondale’s ‘youth and inexperience.’ Dukakis was insufficiently emotional at the prospect of his wife’s rape and murder. Lloyd Bentsen told Dan Quayle was no Jack Kennedy. George H.W. Bush looked at his watch. Al Gore stalked George W. Bush, who froze him with a nod.”\n\nThese are the moments that are played over and over again in the run-up to debates. They illustrate the fact that these events are watched intensely for the quip, the gaffe, the thrust, the parry that can sum up 90 minutes. It’s why debate prep spends an inordinate amount of time trying to come up with punchy, memorable lines—“zingers”—to win the attention and admiration of the audience. (It’s also why the late political journalist Lars Erik-Nelson scornfully said of his colleagues, “You’ve all become theater critics.”)\n\nBut in fact, this view of debates is not the whole story. Sometimes, it’s the cumulative effect of the exchanges that can determine who prevails. Look back at the first Romney-Obama debate in 2012. There was no one exchange, no one Obama stumble or Romney answer, that provided the ”aha!” moment that journalists wait for the way hounds wait for the first call of the fox. It was, rather, Obama’s petulant, defensive, sometimes indifferent answers that made even the president’s most ardent supporters believe he had been badly beaten.\n\nThe presence of Trump clearly raises the odds that we may see a “moment” unlike any in debate history; that’s clearly what an army of reporters and tens of millions of viewers will be waiting for. But it may just be that it will be the totality of the hour and a half that will persuade a viewer to say: “he seemed pretty reasonable” or “she knows what she’s talking about and he doesn’t.” This has special relevance for Clinton, who, as her longtime friend and one-time aide Patti Solis-Doyle observed, always seems as if she is testing every word before it leaves her mouth. A sustained, relaxed presentation over the course of the debate could be her best weapon against a Trump, whose ability to stay within himself when untethered to a Teleprompter is questionable.\n\nThere Are Three Debates, Not One—And That Can Matter A Whole Lot\n\nOne key reason why the 1980 Reagan-Carter debate was so important is that it was the only debate between the two. Carter had refused to debate with third-party candidate John Anderson, so Reagan faced off against Anderson on September 21st. When the independent fell below the polling threshold, Carter and Reagan met for the first and last time on October 28th—barely a week before the election.\n\nEvery other time, there have been three debates; which has meant there is a chance to make up for a less than successful debut. That’s what happened with Reagan in 1984, and with George W. Bush in 2004; it’s also what happened last time out, when Obama emerged from his daze and outperformed Romney in their two other meetings.\n\nHere, I think, is an opening for Clinton—especially in the town hall meetings, where she should be able to turn a question—and they are usually very lame \"what can you do for my daughter?\" questions—into answers that fuse personal concern with a command both of her proposals, and of Trump’s astonishing inability to remember what he has proposed from one day to the next. The danger for her is channeling her inner Al Gore, who challenged Bush’s commitment to health care by repeatedly demanding: \"What about Dingell-Norwood?\" The opportunity for her is to argue—from experience—that what she has worked for in public life has made the lives of real people better. (Further, the Town Meeting format—with dozens of “real” people as participants—makes the resort to personal insults highly risky).\n\nTrump Is Not the Only One Who Can Deploy Political Judo\n\nThe potential for Trump to turn strength into weakness has its roots in the most singularly successful use of political judo. It came in 1992, when independent Ross Perot was asked if voters should be bothered by his lack of experience.\n\n“Well,” he said, “they've got a point. I don't have any experience in running up a $4 trillion debt. I don't have any experience in gridlocked government where nobody takes responsibility for anything and everybody blames everybody else. I don't have any experience in creating the worst public school system in the industrialized world, the most violent, crime-ridden society in the industrialized world.”\n\nJudo, however, can cut both ways. There’s a clear opening for Clinton if Trump were to boast of his leadership skills, and his business success.\n\n“Well, you might be successful, Donald, but we really don’t know because you’re the first presidential candidate ever who won’t show us his taxes. But you know, you should look at the business leaders who support me: Mike Bloomberg, who’s worth four times what you claim to be worth, and who didn’t start with millions from his father, says you’re a con, a fake. So does Marc Cuban, who built his success from the ground up. But I do have to admit—you’re way, way ahead of them in, unpaid workers, fleeced contractors and lawsuits.”\n\nDebates Are NOT Decisive\n\nOne last note. It’s easy to assume that the fate of the world is at stake Monday night. A lot of post-election narratives over the years have located debates as the center of the story (“Reagan recovered from his first debate-gaffe and went onto win a landslide.” “Obama was far more effective in the later debates and was re-elected…”). But is correlation really causation? Maybe the economic boom of 1984 has a lot more to do with Reagan winning 49 states; maybe the clear if modest economic recovery played the key role in Obama’s clear if modest popular vote victory.\n\nIn their influential 2013 book, The Gamble, political scientists John H. Sides and Lynn Vavreck tried to measure the impact of debates, gaffes, and other “game-changers” with real-time public opinion measurements. What they found was that even a dramatic event like Romney’s first debate performance had a relative small, and relatively short-lived, impact. Compared to the “fundamentals”—economic performance and the ever-growing impact of a polarized electorate—the stuff of which a hundred overwrought post-debate analyses are made may be of only marginal significance.\n\nOf course, this cycle the “fundamentals” point to a very close race. So you’ll probably want to tune in anyway\n\nJeff Greenfield is a five-time Emmy-winning network television analyst and author.", "authors": ["Jack Shafer", "Jeff Greenfield"], "keywords": [], "meta_data": {"description": "Her greatest strength—experience—is also her greatest vulnerability in the first debate.", "og": {"site_name": "POLITICO Magazine", "description": "Her greatest strength—experience—is also her greatest vulnerability in the first debate.", "title": "Is Hillary in a No-Win Situation?", "url": "http://politi.co/2dldAht", "image": "http://static.politico.com/c9/c0/fae428464ce8b51f984194f193fd/160926-greenfield-hillary-ap.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/hillary-clinton-2016-debate-214291", "images": ["http://static.politico.com/c9/c0/fae428464ce8b51f984194f193fd/160926-greenfield-hillary-ap.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://static.politico.com/dims4/default/fc1ca12/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fc9%2Fc0%2Ffae428464ce8b51f984194f193fd%2F160926-greenfield-hillary-ap.jpg"], "title": "Is Hillary in a No-Win Situation?", "url": "http://politi.co/2d0FTlN", "summary": "", "movies": [], "publish_date": {"$date": 1474906020000}, "source": "http://politi.co"}
