{"top_img": "http://eaglerising.com/wp-content/uploads/2016/09/donald-trump-1.jpg", "text": "Last week I wrote an article titled “Donald Trump’s Amazing Week” which must have been incredibly annoying to liberals and “Never Trumpers” everywhere. Guess what? This past week has been even better for the 2016 Republican nominee for president, the man whose candidacy was considered a vanity exercise a year and a half ago. Well no one is laughing anymore.\n\nThe latest round of polls shows that the support for the Trump presidency is growing rapidly. The latest Fox News Poll, which was taken from September 11-14, shows Donald Trump polling at 46%, a one-point lead over Democratic nominee Hillary Clinton at 45%. The LA Times/USC poll taken from September 9-15 shows Trump at 47% with a six-point lead over Clinton at 41%. The gap between the two candidates is also narrowing in the key battleground states. The Suffolk University Poll which was taken from September 12-14 shows Trump at 42%, leading by 3 points with Clinton at 39%. The CNN/ORC poll, which was taken September 7-12 shows Trump with a 4-point lead over Clinton in Florida. Clinton still has about a 3-5 point lead over Trump in other key battleground states, including Pennsylvania and Michigan, but those gaps are getting narrower every day. Other states such as Nevada and New Hampshire which were initially perceived to be likely wins for Clinton have moved to the “toss up state” category.\n\nDonald Trump also continued his efforts to layout his policy framework with the introduction of another signature platform, his childcare plan at a speech in Aston PA, just outside of Philadelphia. Spearheaded by his daughter Ivanka Trump, Trump’s childcare policy offers something for everyone across the economic spectrum. The plan offers six weeks paid maternity leave to all mothers who do not receive this benefit through their employers. This benefit will be funded by closing gaps in our existing unemployment insurance program. Lower income families will also benefit from the plan’s offering of childcare rebates through the Earned Income Tax Credit (EITC) program up to $1,200 per year. Middle class families will benefit from being able to fully deduct all childcare expense on their tax returns. Families will also have the ability to establish Dependent Care Savings Accounts (DCSAs) to put money aside tax free for childcare. Low income families will receive a 50% match of the first $1000 deposited per year, generating up to an additional $500 per eligible family per year. DCSAs can be applied to pay for childcare, after school enrichment programs and school choice. Families can also use the funds in a DCSA to care for an elderly parent’s expenses including in home nursing and long-term care. Finally, Trump’s childcare plan provides a tax deduction for stay-at-home parents, effectively eliminating the tax punishment for a parent’s decision to leave the workforce to be a full time caregiver for child or an elderly parent.\n\nDonald Trump followed his childcare policy speech with another economics speech to the Economic Club of New York which includes some of New York’s most powerful movers and shakers in the world of business and finance. Trump’s excellent week continued with his visit to the Dr. Oz Show where he released a letter from his long term doctor revealing the results of his most recent medical visit and other relevant pieces of his medical history. Other than carrying an extra 15-20 pounds, Trump appears to be in excellent health. Of course, Trump’s unveiling his medical records on a television show comes on the heels of the recent concerns about Hillary Clinton’s health following her fainting at last week’s September 11 memorial event and the subsequent revelation that she was suffering from pneumonia. Again, only Donald Trump can turn the literal opening of an envelope into an event. Well, it is an event alright particularly if that envelope is opened on The Dr. Oz Show, a program which is reportedly watched by four million viewers daily with a large percentage of female viewers. During the one hour program, the discussion of Trump’s health was followed by the appearance of Ivanka Trump who was able to deliver yet another pitch about the newly announced childcare proposal to the aforementioned audience of women. So yes, somehow all this concern about Hillary Clinton’s health and capacity to serve as president has created multiple free publicity events for Donald Trump.\n\nTrump followed up the Dr. Oz interview with a visit to the Tonight Show with Jimmy Fallon. During the visit, Trump permitted the late night comedian to do something “unpresidential”. That is to say, he told Fallon that he could “mess up his hair”. While most pundits would speculate that the moment was completely pre-planned, the fact that Trump said “yes” to the display speaks volumes. He demonstrated that he has the ability to laugh at himself and that he is not afraid to have a bad picture taken. Furthermore, The Tonight Show is popular with Democrats and millennials of all political persuasions. Once again, Trump had an opportunity to make a connection with millions of people who more than likely were not on the “Trump Train”. Oh and one more thing, by letting Jimmy Fallon touch his hair on national television, Trump has finally set to rest all rumors that his hair is not his. However small, it’s another check mark in the honesty and transparency box.\n\nNow if all of this was not enough, Donald Trump capped his week off with an opening event ceremony at his new hotel in the former post office site in Washington DC where he received endorsements from military flag officers and fourteen Medal of Honor recipients. Trump used the event to not only promote his hotel project as being completed “two years early and under budget”, a metaphor for how he would manage the US economy, he also seized the moment to put an end to the “birther issue”. Trump took the microphone and said “Not to mention her in the same breath,” (as the Medal of Honor recipients who had just endorsed him) “Hillary Clinton and her campaign of 2008 started the birther controversy. I finished it. I finished it,” he said. “President Barack Obama was born in the United States, period. Now we all want to get back to making America strong and great again.” Trump said.\n\nOnce again, political correctness be damned, Donald Trump has had another “amazing week.”\n\nThe views expressed in this opinion article are solely those of their author and are not necessarily either shared or endorsed by EagleRising.com", "authors": ["View All Posts", "Leonora Cravotta"], "keywords": [], "meta_data": {"description": "Once again, political correctness be damned, Donald Trump has had another “amazing week.\"", "og": {"site_name": "Eagle Rising", "description": "Once again, political correctness be damned, Donald Trump has had another “amazing week.\"", "title": "More Milestone Moments for Donald Trump!", "locale": "en_US", "image": "http://eaglerising.com/wp-content/uploads/2016/09/donald-trump-1.jpg", "updated_time": "2016-09-19T03:47:05+00:00", "url": "http://eaglerising.com/36829/more-milestone-moments-for-donald-trump/", "type": "article"}, "robots": "noimageindex", "fb": {"app_id": 256195528075351, "pages": 135665053303678}, "article": {"section": "2016 Election", "tag": "Hillary Clinton", "published_time": "2016-09-19T00:05:51+00:00", "modified_time": "2016-09-19T03:47:05+00:00"}, "viewport": "initial-scale=1,maximum-scale=1,user-scalable=no", "googlebot": "noimageindex"}, "canonical_link": "http://eaglerising.com/36829/more-milestone-moments-for-donald-trump/", "images": ["http://constitution.com/wp-content/uploads/2017/08/confederatemonument_poll_pop.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46772-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/03/eagle-rising-logo3-1.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46729-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46764-featured-300x130.jpg", "http://0.gravatar.com/avatar/9b4601287436c60e1c7c5b65d725151f?s=112&d=mm&r=g", "http://pixel.quantserve.com/pixel/p-52ePUfP6_NxQ_.gif", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/birther-375x195.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2017/04/crtv_300x250_1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=22315475&cv=2.0&cj=1", "http://eaglerising.com/wp-content/uploads/2016/09/donald-trump-1.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46784-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46774-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46750-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46763-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46612-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46761-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/homosexuals-375x195.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46642-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46735-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46755-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46752-featured-300x130.png", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/2016/09/donald-trump-1-800x300.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46731-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46743-featured-300x130.jpg", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46712-featured-300x130.jpg", "http://0.gravatar.com/avatar/9b4601287436c60e1c7c5b65d725151f?s=100&d=mm&r=g", "http://2lv0hm3wvpix464wwy2zh7d1.wpengine.netdna-cdn.com/wp-content/uploads/wordpress-popular-posts/46757-featured-300x130.png"], "title": "More Milestone Moments for Donald Trump! – Eagle Rising", "url": "http://eaglerising.com/36829/more-milestone-moments-for-donald-trump/", "summary": "", "movies": [], "publish_date": {"$date": 1474243551000}, "source": "http://eaglerising.com"}
