{"top_img": "http://v.politico.com/images/1155968404/201609/1397/1155968404_5141384022001_5139891128001-vs.jpg?pubId=1155968404", "text": "Off Message Is Donald Trump qualified to be president? In the most pivotal moment of 2016, these are the questions he must answer.\n\nH.L. Mencken declared there was only one way to look at a politician — “down.”\n\nLikewise, there’s really only one way to look at the first presidential debate on Monday: as the first serious job interview for potential President Donald John Trump — an opaque candidate who has hidden behind a steel curtain of one-liners, faux familiarity and universal celebrity.\n\nStory Continued Below\n\nYeah, yeah, yeah, it’s a big night for Hillary Clinton too. She’s got a lot to prove, for real, namely that she’s not the lying, self-dealing crook many Americans think she is — or at least convince the 55 percent of voters who don’t like her that her virtues (temperament and experience) compensate for decades of assorted ick. She needs to prove she can stand up to Trump, answer the usual email/foundation questions, convince whoever’s still sellable on the idea (stop Instagramming a picture of your lunch, millennials, and listen up) that she’s not some scheming granny who will just sell everybody out the second John Roberts drops the swearing-in Bible.\n\nBut the spotlight belongs on Trump, who is in need of a rigorous job interview. Clinton deserves the same, but she is already the single most scrutinized, parsed, vetted, investigated, attacked and plaudited non-incumbent to ever seek the presidency. She’s been around forever, making enemies since the internet was dial-up, cell phones were the size of skateboards and Trump was engaged to Marla Maples.\n\nEveryone makes the orange jokes, but Trump is something of a black box — running on a few big and broad ideas (curbing illegal immigration, ditching bad trade deals, restoring American prosperity to the working class and obliterating political correctness). He’s bad with facts and the truth, and perhaps worse, takes perverse pride in being a D student who doesn’t read books, has the sketchiest sense of history, doesn’t read briefing materials, and, according to aides and ghostwriters, can’t even sit still long enough to be given a thorough verbal briefing.\n\nThese are not nasty, biased, liberal opinions. They are facts based on reporting and Trump’s own public performances. Here are five questions Trump needs to address on Monday — but taken together, they add up to one big one: Is Donald Trump qualified to be President of the United States?\n\n1. Does he actually know — or care to know — the basic information needed to competently run the country?\n\nOnly one verdict of presidential fitness counts, of course, and that’s a candidate’s capacity to get to 270 electoral votes. In recent days, Trump — who swooned after Clinton’s superb convention in Philly — has closed to within the margin of error in many (though not all) national polls, and jumped to serious leads in battlegrounds like Ohio and Iowa since Aug. 1. He’s still the most unpopular candidate in recent history (although Clinton is number two with a bullet) and seems to have a ceiling of between 40 and 44 percent nationally. But he can win. Fivethirtyeight.com, the arch-aggregator, gives Trump nearly a 50 percent chance of prevailing.\n\nHis resurgence proves three political points — two of them we knew, the third is a surprise to everyone except Trump and his team: The country (especially the white working-class parts) is pissed, Clinton is a perennially lousy candidate and — lastly, but not leastly — Trump has proven to be a resilient and flexible candidate with the capacity (developed late in the game) to shift shape and shut up when he needs to.\n\nThe first debate should be a pivot — from politicking to president-ing. Being a cunning candidate isn’t remotely the same thing as being ready to rule — and we should be moving to the Doris Kearns Goodwin phase of the campaign, where the top priority is fitness to govern in a time of trial. It probably won’t happen, but a boy can dream.\n\nThis is not to suggest that Trump can’t do the job (Ronald Reagan, another entertainer who forayed into politics, was mostly a success), but he’s been judged as a performer up to this point, and not subjected to the cold fluorescent scrutiny of managerial competence.\n\nTrump has repeatedly flubbed tests of his basic understanding of domestic and foreign affairs — apparently he wasn’t aware Russia had annexed Crimea until George Stephanopoulos informed him recently. He obliterated Jeb Bush, that humbled patsy of the GOP establishment, in the debates — but Bush (if anyone had cared to listen) punctured Trump’s bully-boy promise to impose tariffs on Chinese products, correctly pointing out that such a move would certainly spark countermeasures by Beijing that could lead to a global depression. Trump wasn’t aware of that fact, or just didn’t care.\n\nThe caring part is kind of important, if history is any guide. In April, I sat down with one of his longtime advisers, Roger Stone, who described what it was like to brief an executive whose prime attributes were supreme self-confidence and supreme impatience. “All you can do is present information and let him either assimilate it or not,” said Stone, who has known the GOP nominee for decades. “When you write something for him, keep it short and staccato. He's not going to read a 40-page white paper on the economy; zero chance of that. It's just too boring. Don't blame him; I don't like it either. So keep it simple and direct because that's the way he communicates.”\n\nStone argued that Trump isn’t an ignoramus — just a cut-to-the-chase decision-maker who is a lightning-quick study. But George W. Bush’s advisers, speaking to biographer Peter Baker, said that Bush’s unwillingness to ask probing, informed questions led to some of his disastrous decisions in Iraq. And during the nadir of the 2009 global economic meltdown, President Obama added a daily economic briefing to his daily national security rundown to keep tabs on the rapidly shifting metrics of crisis.\n\nTrump’s capacity to intuitively assimilate information might render such processes useless — but there’s not a single presidential historian drawing oxygen who believes a lack of intellectual curiosity is an asset for the job.\n\nMany Americans might not give a damn that he knows what HUD’s Section 8 program is — and his failure to answer informational questions that Clinton would parry with ease will endear him to his screw-the-media base. But don’t people have the right to know what he actually knows? Trump has gleefully trashed the rules of presidential campaigns, so why should a moderator treat him with the deference of someone who abides by the norms — by assuming he possesses the basic knowledge traditionally required of a presidential candidate?\n\n2. Does Trump understand and respect the basic principles and traditions of American Constitutional government?\n\nAgain, this is not a given. Hillary Clinton despises the press, and dodges them as if they were a pack of feral rats, but she has never suggested they be stopped from doing their jobs through the courts. Trump (who banned news outlets, including this one, from his events for most of the campaign) routinely threatens litigation against publications that publish unflattering articles and, in February, went so far as to say: “We're going to open up those libel laws. So when The New York Times writes a hit piece which is a total disgrace … we can sue them and win money instead of having no chance of winning because they're totally protected.”\n\nThat’s a new one for a presidential nominee. As Corey Brettschneider wrote in POLITICO Magazine last month: “For more than 50 years, the Supreme Court has held that for a public figure to prove libel against a news outlet, they must show that the outlet acted with ‘actual malice’ — that is, with knowledge that it was false or with reckless disregard of whether it was false or not.”\n\nDuring a private meeting with Hill Republicans earlier this year, the populist real estate developer expressed his fondness for “Article 12 of the Constitution.” The framers stopped at seven. “He was just listing out numbers,” said Congressman Blake Farenthold (R-Texas), a Trump backer at the time. “I think he was confusing Articles and Amendments.”\n\nOK, let’s write that one off as a gotcha — you can understand Constitutional principles without citing literal chapter and verse. But consider his reaction to the Paris bombings last November when Trump told FOX News he thought the government should shutter some mosques where “some bad things are happening.” The comment was decried by Constitutional scholars of all stripes as a radical measure that would violate the “Free Exercise” clause of the First Amendment, a pillar of protection for faiths of all kinds.\n\n3. Why won’t Trump forthrightly answer the most basic questions about his businesses and debts?\n\nHillary Clinton has, appropriately, has come under intense scrutiny for her six-figure speeches to big Wall Street firms like Goldman Sachs — and has refused to release the transcripts of her prattles to the plutocrats. And serious questions remain about the lack of boundaries between the Clinton Foundation, the State Department, and big-money foreign donors who blurred the line between influence peddling and altruism.\n\nBut the Clintons have released all of their tax returns (in part because, for many years, they were required to do so as government employees) and Trump is the first major presidential candidate in the modern era to thumb his nose at handing over a single one.\n\nWhy does it matter? Because a guy whose purchase on the presidency is rooted in his private-sector acumen needs to back up his claims with proof, in the same way that Clinton needs to be held accountable for her purported record of accomplishment in the White House, Senate and State Department. At issue is Trump’s fundamental personal narrative, and his claim that he’s “very, very rich.” He is, but maybe not quite as much as he claims (he says he’s good for $11 billion; Forbes and other outlets say he’s worth less than half that much).\n\nMore serious is the issue of Trump’s debts: The Clinton campaign, citing press reports that he owes large sums to overseas creditors in China and elsewhere, has attacked him for being in the pocket of foreign financial overlords. If that’s a lie, there’s an easy way to prove it — by releasing the returns.\n\nThis isn’t a liberal media witch-hunt: Many Republicans, including supporters like House Speaker Paul Ryan, say he needs to cough them up, and fast.\n\n4. What’s the deal with his charitable foundation? Then there’s the matter of Trump’s sloppily run, and less-than-magnanimous foundation. In exposé after exposé, Washington Post reporter David Fahrenthold has reported on a pattern of over-promising donations and the misuse of funds (including a quarter-million payment to cover legal fees for Trump’s businesses and sports memorabilia) that Trump himself has conceded might be illegal.\n\nThe problem, yet again, is that Trump has refused to release a comprehensive accounting of his giving, and his surrogates have routinely misstated the magnitude of his generosity, according to the reporting of Fahrenthold and others.\n\n5. Why lie? These days, the polygraph is used sparingly as part of the vetting process for employment, mostly for sensitive national security or law enforcement jobs. If presidential candidates were subjected to that level of scrutiny, the only person allowed on the debate stage at Hofstra would be the technician testing the sound system.\n\nBut if Trump is to be vetted for the presidency, he needs to be asked not only about individual statements he’s made in the past, but his pattern of lying, stretching the truth and bungling facts.\n\nHillary Clinton (“Crooked Hillary” in Trump’s parlance) it bears repeating, is no saint — far from it — and her early answers on the email scandal were misleading, bordering on the untruthful, and flat-out lies in the view of GOP congressional investigators.\n\nBut it’s a crowning irony of 2016 that the Republican Party, whose base revolted against its leadership for untruthfulness — especially George W. Bush’s claims about Iraq — would nominate the most brazenly truth-challenged candidate in recent history. (A recitation of Trump’s whoppers would take up too much space – read POLITICO’s comprehensive “Donald Trump’s Week of Misrepresentations, Exaggerations and Half-Truths” for a taste.)\n\nIn an attempt to defend Trump, buddy Newt Gingrich, who lobbied to be Trump’s running mate, tweeted what amounted to an indirect admission that his man has a trouble with all those pesky facts. “Clinton,” the former speaker wrote, “is a fox who knows many things you can fact check. Trump is a hedgehog who knows one big thing…”\n\nBut getting the facts right — and telling the truth — is a big thing. It’s the only way citizens will ever look up to, and not down on, their leaders.\n\nAuthors:", "authors": ["Jack Shafer", "Kyle Cheney", "Daniel Strauss", "Daniel Lippman", "Eli Stokols", "Glenn Thrush", "Brent Griffiths"], "keywords": [], "meta_data": {"description": "In the most pivotal moment of 2016, these are the questions he must answer.", "og": {"site_name": "POLITICO", "description": "In the most pivotal moment of 2016, these are the questions he must answer.", "title": "Is Donald Trump qualified to be president?", "url": "http://politi.co/2diUcS5", "image": "http://v.politico.com/images/1155968404/201609/1397/1155968404_5141384022001_5139891128001-vs.jpg?pubId=1155968404", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/is-donald-trump-qualified-to-be-president-228657", "images": ["http://v.politico.com/images/1155968404/201609/1397/1155968404_5141384022001_5139891128001-vs.jpg?pubId=1155968404", "http://static.politico.com/4f/ce/b732203d484d8c198b543f9b1313/offmessage-banner-takeaways.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Is Donald Trump qualified to be president?", "url": "http://politi.co/2dkiM5e", "summary": "", "movies": [], "publish_date": {"$date": 1474866599000}, "source": "http://politi.co"}
