{"top_img": "http://static.politico.com/47/07/5255ce914040a7a0ca8aea7482f0/carter-page-ap-1160.jpg", "text": "In March, in a bold “Oh yeah?” moment during an interview with the Washington Post’s editorial board, Donald Trump took the paper’s dare and revealed, then and there, his very short list of foreign policy advisers. There were just five, though he said, “I have quite a few more.” The list was a head-scratcher, a random assortment of obscure and questionable pundits. One of the names, offered without elaboration, was, “Carter Page, PhD.”\n\nWho?\n\nStory Continued Below\n\nReporters quickly Googling found that Page is the founder and managing partner of an investment fund called Global Energy Capital, and that he claims to have years of experience investing in Russia and the energy sector. As for his connection to Trump, when Page was reached for comment by the New York Times the day after Trump’s big reveal, he said he had been sending policy memos to the campaign and the paper said he “will be advising Mr. Trump on energy policy and Russia.”\n\nThis piqued my interest: I have been a Russia wonk for most of my adult life, I spent years living and reporting from Moscow, still go there regularly for reporting trips, and am in touch with lots of friends there. And yet, despite the tightly knit nature of the expat business community in Russia, no one I spoke to had ever heard of Carter Page.\n\n“What’s this guy’s name?” says one former Western energy CEO who spent years in Russia, and would have overlapped there with Page.\n\n“I had not heard of Carter Page before it came out in the media,” says another prominent Western businessman who has worked in the former Soviet Union for over two decades. “But I am getting a lot of emails from friends asking, ‘Have you heard of this guy?’”\n\n“Strangely, I've never heard of Carter Page until this Trump connection,” Bill Browder responded to me in an email. He was one of the biggest Western players in the Russian market until President Vladimir Putin turned on him and Browder became his fierce critic. “It's odd, because I've heard of every other financier who was a player on Moscow at the time.”\n\nSomeone, apparently, has heard of him: On Friday, Yahoo News reported that Page was being probed by U.S. intelligence for purported back-channel ties to Russian leaders. The story resurfaced the name of a character who’d all but vanished from the campaign, and reawakened questions about who, exactly, Trump was surrounding himself with.\n\nThis has been a concern swirling around the outsider candidate since he began, a real-estate developer with almost no serious Washington connections to tap for advice. “I’m going to surround myself only with the best and most serious people,\" Trump famously told a Post reporter last summer about how he would staff his campaign. \"We want top-of-the-line professionals.” As the primaries unfolded, it became increasingly obvious that Trump would need all the top-of-the-line help he could get when it came to foreign policy. In an interview with conservative radio host Hugh Hewitt, Trump confused the Kurds with the Iranian Al-Quds Force, couldn’t tell the difference between Hezbollah and Hamas, and couldn’t recognize the name of the leader of ISIS. (In his defense, Trump said that “Hugh was giving me name after name, Arab name, Arab name, and there are few people anywhere, anywhere, that would have known those names.”) The Republican foreign policy specialists who would normally be a brain trust began slamming him in the press or publicly signing on to anti-Trump manifestos. And since they increasingly were fleeing the candidate, who were the people who would line up to advise him instead? What would they be like?\n\nEnter Carter Page, a 44-year-old Ph.D., and business school graduate who claims an expertise in Russia and energy, yet who, I quickly discovered, was known by neither Russia experts nor energy experts nor Russian energy experts. (“I can poll any number of people involved in energy in Russia about Carter Page and they’ll say, ‘Carter who? You mean Jimmy Carter?’” says one veteran Western investor in Russian energy.) Page also, as I would be surprised to discover, appears largely unknown to Trump’s own campaign.\n\nWhat I did find, however, is that while Page might not be helping Trump, Trump has been a significant help to Page. Since being named by Trump as an adviser, Page, who has spent his career trying to put together energy deals in Russia and the former Soviet Union, has finally begun to be noticed in the region. He is being treated in Russia as a person with potentially important ties in America. “He’s an extremely well-informed, authoritative expert on Russia,” says Mikhail Leontiev, a pro-Kremlin talking head and spokesman for Rosneft, Russia’s state oil giant. “People really respect him in this industry. He’s a very serious guy, and he has a good reputation.” According to the Yahoo report, U.S. intelligence believes Page had an audience with top Russian officials—including Rosneft head Igor Sechin—during a summer trip to Moscow. From what I could find about him, it’s hard to imagine he could have secured those meetings without that mention by Trump.\n\nPage has also been the subject of some breathless coverage in the American press. A March Bloomberg profile touted his “deep ties” with “executives at Gazprom,” the state-owned Russian gas giant, whom he says he advised on some of its biggest deals of the past decade. Last month, the Post ran a piece that was breathless in a different way, casting him as a shadowy broker with potentially important ties in Russia, some of them unsavory. The Yahoo story also portrays Page as a well-connected, high-rolling businessman with “extensive business interests in Russia” and an office “around the corner from Trump Tower.”\n\nPage has fueled all this by making some remarkable statements, including saying Putin is a better leader than President Barack Obama to a June closed-door meeting of foreign policy Brahmins in Washington. In July, in Moscow, he spoke at the New Economic School’s commencement ceremony, a university that had hosted Obama just seven years ago. Page used the speech to slam the “hypocrisy” of American foreign policy in front of a Russian audience, saying, “Washington and other Western powers have impeded potential progress through their often hypocritical focus on ideas such as democratization, inequality, corruption and regime change.” He is now frequently quoted on Russian television, which hails him as a “famous American economist” and “adviser to Donald Trump on questions of foreign policy.”\n\nAll of which reveals something deeply strange about Trump: when he shoots from the hip, his remarks do more than just whip up Twitter controversies. They also occasionally and unintentionally mint a new species of “insiders,” people who seem to be in Trump’s orbit but who may not have—and may never have had—any access to the gilded inner sanctum at all.\n\nBut someone is paying attention. As I started looking into Page, I began getting calls from two separate “corporate investigators” digging into what they claim are all kinds of shady connections Page has to all kinds of shady Russians. One is working on behalf of various unnamed Democratic donors; the other won’t say who turned him on to Page’s scent. Both claimed to me that the FBI was investigating Page for allegedly meeting with Igor Sechin and Sergei Ivanov, who was until recently Putin’s chief of staff—both of whom are on the sanctions list—when Page was in Moscow in July for that speech.\n\nSo the question continued to linger: Who is Carter Page?\n\n***\n\nI should tell you before we get any further that Page wouldn’t talk to me for this story. I called his fund and left messages, both on the general line and his personal voice mail. I emailed him repeatedly. I asked the Trump campaign to put me in touch. I emailed the Bloomberg journalist who interviewed him, who passed the request on. I even called Carter Page’s father in Poughkeepsie, New York, who told me he would ask his son to talk to me. But alas, no dice.\n\nThis was disappointing: No one who worked in Moscow when Page was there seemed to know who he was, and I just wanted to talk to someone who did. At a certain point, I just needed confirmation that he even existed.\n\nOK, I thought. Try a different route. Maybe all these prominent Western businessmen who worked in Russia for decades didn’t know Page, but maybe it was because some of them worked in different spheres of the Russian economy. He did, after all, have such an impressive résumé.\n\nPage’s biography on the website of his energy fund, Global Energy Capital, hits all the right notes. It was, at first glance, the résumé of an up-and-coming player in the opaque but lucrative Russian energy market. “He spent 7 years as an investment banker at Merrill Lynch in London, Moscow and New York where he most recently served as Chief Operating Officer of the Energy and Power Group,” his bio reads. “He was involved in over $25 billion of transactions in the energy and power sector. He spent 3 years in Moscow where he was responsible for the opening of the Merrill office and was an advisor on key transactions for Gazprom, RAO UES and others.”\n\nThose were some of the biggest energy deals of the 2000s, and Page’s tenure in Merrill Lynch’s Moscow office, from 2004 to 2007, would have put him in the right place at the right time. He says he was part of the carving up of RAO UES, a massive Russian electric power holding company. He told Bloomberg that he advised Gazprom when it bought a stake in the Sakhalin II oil and gas project. Those were huge, huge things. If he were deeply involved, he would definitely count as a player. And surely he left at least a trace in the records of those deals.\n\nSo I called Ian Craig, the CEO of Sakhalin Energy from 2004 to 2009, who was doing the negotiations with Gazprom and stayed on as CEO after the deal went through. (It wasn’t really a deal, to be clear: Sakhalin II was a large project in the Far East, and Gazprom essentially elbowed its way into the project when the government forced the consortium to sell the gas giant a controlling stake.) But Craig said he didn’t know anyone named Carter Page. He was also surprised to hear about Merrill Lynch’s purported involvement in the deal. “I don’t think Merrill Lynch or anyone else was front-lining the negotiations, because it was all done at the highest level, because it was very political,” says Craig . “It closed at CEO level, and eventually Putin himself signed off on it.”\n\nWhen I asked a prominent Western businessman, who has worked in the former Soviet Union for over two decades and who is said to socialize with Sechin and other members of the Russian elite, about Page’s claim to Bloomberg that he advised Gazprom on Sakhalin II, he said, “I rolled my eyes at that one.” (He, too, said he hadn’t heard of Page until Trump’s announcement.)\n\nFine. OK. Maybe Page exaggerated a bit on that one. But what about the reorganization and privatization of RAO UES, the Russian electricity giant? Maybe some of the Russians he worked with remembered a Carter Page?\n\nTurns out, they did.\n\n“His nickname was stranichkin,” from the Russian word stranichka, or “little page,” says Artem Torchinsky, who met Page during the breakup of RAO UES. Torchinsky, who was part of the company’s financial department, worked alongside Page, who, at the time worked in Merrill Lynch’s Moscow office. It was 2007, and Merrill Lynch was underwriting the sale of one part of RAO UES, and Torchinsky was resentful of Page and the other Merrill Lynchers: Torchinsky and the in-house team did all the work, and Page and his team would swoop in to give the presentation. They were the fancy Western window dressing. “It really irritated our team,” Torchinsky told me over Skype. “We worked around the clock, and then they would come in and say something incomprehensible and we’d have to correct them. These guys didn’t know what they were talking about.” As for Page, “He made no impression whatsoever. Whether he was there or not, it made no difference,” Torchinsky says. “When you’re dealing with a pro, you see it. Page, unfortunately, did not leave that impression.”\n\nOK, harsh. But then I talked to Page’s former boss, former Russian Central Bank Chairman Sergei Aleksashenko, who ran the Moscow office of Merrill Lynch for part of the time Page worked there. “He wasn’t great and he wasn’t terrible,” Aleksashenko says, exasperated and confused by the interest of all these journalists pestering him for information about someone “without any special talents or accomplishments,” someone who was “a gray spot.” “What can you say about a person who in no way [is] exceptional?” he asked me.\n\nPage was a vice president at Merrill Lynch in Moscow, which sounds senior but is a common title in the finance world; a big firm like Merrill Lynch might have thousands of VPs. In the Moscow office, there were five ranks, and VP was right in the middle. In effect, it was “just the oldest of the youngest, three from the bottom,” says Aleksashenko.\n\nWhen it came to finance, Aleksashenko says, Page “was not a specialist in any branches of finance or in any instruments.” When it came to energy, Page and his team were, according to Torchinsky, “mildly speaking, not competent in the field of energy.” And, says Aleksashenko, “judging by the drivel he spews on Russia, you can tell he doesn’t really understand the topic.”\n\nTrump’s putative adviser on Russia and energy and foreign policy, in other words, “did not create the impression of someone who was intellectual or well-educated, or someone who was in any way interested or knowledgeable in foreign policy,” says Aleksashenko.\n\n***\n\nFor the past few years, Page has styled himself a foreign policy expert. He has written columns in Global Policy Journal, a new peer-reviewed journal run out of Durham University. They are confoundingly written and make logically curious leaps. “In recent months, renewed calls for equal justice have brought social tension across the United States after the killing of Michael Brown and Eric Garner by police officers in Missouri and New York respectively,” he wrote. “Although commonly overlooked, the impact of other fatal mistakes by government officials in the foreign policy arena might vastly outweigh these tragic deaths in potentially catastrophic proportions.” He is the kind of thinker who writes that Kanye West’s “New Slaves” and the “artist’s creative work offers valuable ideas that could fundamentally improve the direction of U.S. foreign policy and world affairs” but does it by opening with a citation from the Oxford English Dictionary (“Slave; Pronunciation: /slāv/…”), roping in Adam Sandler, William F. Buckley and Dick Cheney.\n\nHis speech in Moscow’s New Economic School was a similar construction of empty spaces held together with repetition, tautologies, and abuses of the word “ironically.” “For the last 15 years, I’ve been researching, teaching, and writing about fundamental trends in the world economy, which have really continued to evolve in this period and in the years immediately preceding it,” he began. The video of the speech also suggests that after three years living there and a lifetime studying the place, he couldn’t really speak Russian—he had to have his questions translated for him into English. Except to quote, haltingly, brokenly, Vladimir Putin: “We never meddle in the internal political affairs of other countries. Unlike the USA.” Which is troubling for two reasons: that the adviser of a presidential candidate of a major party is criticizing America abroad by citing Putin, and that the comment implied that he seemed to not know anything about anything going on in, say, Syria or Ukraine.\n\nPage also managed to find his way into a fellowship at the Council on Foreign Relations, where he cut a strange figure. Like other Westerners doing business in Russia, Page took the view that Putin was not the blood-stained and corrupt tyrant some in the West imagine him to be, defending him as a strong leader who brought order and prosperity to Russia. But unlike other entrepreneurial defenders of Putin, people at the Council recall that Page was not particularly good at it. “He had a guilty-seeming style in making these arguments, making it seem like he didn’t really want to engage,” one person from the Council says. His columns made the rounds and raised eyebrows. “That blog post about the slaves. That’s just … strange,” says the Council member.\n\n“He’s a nice guy, but of the people that I know that have Russian foreign policy experience or access and contacts, he wouldn’t be in the last decile, but he’d be in the second-to-last decile,” says one American executive with experience in Russia and its energy sector. “You’d have to dip really far and wide to find a guy like Carter Page. I mean, wow.”\n\n***\n\nI should’ve just dropped the Carter Page story, but in the months since Trump named him an adviser, the campaign’s Russia connections have become a bigger and bigger issue. Fancy Bear, who was probably a Russian hacker, broke into the Democratic National Committee emails, seemingly handed them over to Julian Assange, who continues to leak the information in a way that is clearly designed to help one campaign and hurt the other. Trump’s second campaign manager, Paul Manafort, flamed out in August because of his shady business dealings with the pro-Kremlin side of Ukraine, and Trump himself continues to say absurd things about Russia and Putin, like publicly inviting the Russian government to continue hacking American servers. Washington was in full Hunt for Red October mode, and it was all I could do to stay on Page’s trail, which began to look more and more like an infinity sign.\n\nI was not the only one. Seemingly everyone I talked to had also talked to the Washington Post, and then there were these corporate investigators who drew a dark and complex web of Page’s connections. Then there was Page, praising Putin. I found myself juggling two mutually contradictory Page narratives: Was Page, like Manafort, followed by a long train of sordid dealings with dark and powerful players with deep pockets and deep resentments toward the West? This was the person described by the corporate investigators trying to whisper into my ear. Was Page a man wheeling and dealing in energy contracts with China and Turkmenistan, who was a vehicle for the Kremlin to influence the American election? Was he a man who, during a three-day trip to Moscow, met with two of Russia’s most powerful men and was now being investigated for it?\n\nBut it was hard to see that man when I actually talked to people who knew him. Page made his way into the financial sector as it ballooned in the early part of the past decade, securing a spot at Merrill Lynch’s London and Moscow offices. Today, he claims he was cozy with Gazprom executives; his former colleagues laugh at the suggestion. “No one let him into Gazprom,” Aleksashenko says. “He didn’t go shake [Gazprom chief Alexey] Miller’s hand. He made sure there were cars, hotels and meetings for investors in London.” Another of Page’s colleagues from Merrill Lynch confirmed that Page’s role was simply arranging meetings between Gazprom and Western investors, something normally done by analysts, the lowest rank on the totem pole. “People organize meetings with Gazprom all the time,” the former colleague said. “He hosted these guys in New York City but they would have done this 10 times a year… I used to do this; it doesn’t require all that much skill. You just send out an email to 20 people saying Gazprom agreed to dinner at this place at 8 p.m., do you want to come? The main thing is just getting those two [Gazprom] guys to agree. But because they agreed doesn’t mean they’re close to him.”\n\nBut the meetings did provide him with something else. “Gazprom didn’t need money at the time,” says the former colleague. “They were the most profitable company at the time. Their net profit was something like $36 billion a year. Their problem was not getting investors, but figuring out how to spend money in a non-efficient way if you read between the lines. He was probably aware of that. He would have known how inefficient and wasteful the company is.” Page became an investor in the company, and has, according to filings, advised other companies he’s worked for to invest in them.\n\nAfter Merrill Lynch, Page tried to set up his own fund to invest in energy projects and called it Global Energy Capital. But he tried to do this in 2008, and we know what happened to the markets in 2008. The fund is registered to his father’s address in Poughkeepsie; Page listed himself as “founder and managing partner,” even though the only other partner seemed to be Sergei Yatsenko, who was once a mid-level executive at Gazprom. He also maintained a website and handed out business cards that listed a fancy Madison Avenue address—that’s the one “around the corner from Trump Tower”— which was actually the address of a co-working space.\n\n“That’s Carter Page,” says an American businessman who has spent nearly a decade working in Russia. “That’s what he’s been doing, without any actual funding, without any actual experience, without any actual connections or core capabilities, he’s been trying to throw together these deals. He’s always been operating at a level far beneath that at which business in Russia is done. I admire that, it takes a lot of gumption.”\n\nIn the interest of due diligence, I also tried to run down the rumors being handed me by the corporate investigators: that Russia’s Alfa Bank paid for the trip as a favor to the Kremlin; that Page met with Sechin and Ivanov in Moscow; that he is now being investigated by the FBI for those meetings because Sechin and Ivanov were both sanctioned for Russia’s invasion of Ukraine.\n\n“I don’t know this person,” said Pyotr Aven, one of the two founders of Alfa Bank, which is considered the Western Russian bank. Aven and his partner, Mikhail Fridman, have transferred much of their assets out of Russia and have been quite critical of Putin. As for who paid for Page’s trip, Aven was no less irritated by the question. “I give them money, I don’t know how they spend it, who they invite, when they invite them, I have no idea,” he said of the New Economic School, which hosted Page and of which Aven is the main benefactor. Exasperated by my questions, he snapped, “Don’t bring these Russian-style conspiracy theories to me.”\n\n“You are engaged in onanism,” said Leontiev, the spokesman for Rosneft and Sechin when I asked him if Page had met with Sechin. “It’s bullshit. Just bullshit. You need to understand who Sechin is to even ask this question. It’s hard to have a meeting with him at all. It’s absurd.”\n\nAs for the FBI investigation, well, it’s unclear. A State Department official who works on Russia sanctions but was not authorized to speak on the record told me that, for one thing, there is “no prohibition meeting with a designated [sanctioned] individual. Moreover, sanctions violations are not criminal in nature and not enforced by the FBI. OFAC runs them.” He added, “the story doesn't add up.” What does seem to have happened is that various U.S. intelligence agencies were looking into Page’s time in Moscow, then briefed Senate minority leader, Democrat Harry Reid, who wrote a letter to FBI Director James Comey asking him to investigate, among other things, “whether a Trump advisor who has been highly critical of U.S. and European economic sanctions on Russia, and who has conflicts of interest due to investments in Russian energy conglomerate Gazprom, met with high-ranking sanctioned individuals while in Moscow in July of 2016, well after Trump became the presumptive Republican nominee.”\n\n***\n\nI got my next surprise when I called Stephen Miller, Trump’s senior adviser. I caught him just as the Trump plane was about to take off, and asked him the tired, old question: Who is Carter Page?\n\n“Who?” says Miller, and then went off the record to expound on his lack of involvement in the campaign.\n\n“He has no formal role in the campaign,” Hope Hicks texted responding to my question.\n\nNow my interest was piqued. There were whispers all over Washington that, despite Hicks’s denial, Page was not only still part of the Trump campaign, but its conduit for Russian influence. Was he?\n\nOne way to answer the question was to figure out how he even got on that list to begin with.\n\nOne source suggested to me that Richard Burt, former U.S. ambassador to Germany, START treaty negotiator, and longtime lobbyist for Alfa Bank, was the nexus. It was Burt who helped draft Trump’s foreign policy speech in April, and had been advising the Trump campaign, via Senator Jeff Sessions, on foreign policy. But when I met Burt at his office at the McLarty Associates lobbying shop, he looked at me and said he had never even met him. “The only person I talked to about Carter Page is this guy at the Washington Post,” Burt told me. “And I told him I’d never met the guy. Let me put it this way: if I have met him, I’ve forgotten. He’s the former Merrill Lynch guy, right?”\n\nSomeone else told me that the Page connection was Rick Dearborn, Sessions’ chief of staff, who hired Page because Dearborn knew nothing about foreign policy but needed to put together a foreign policy staff for Trump’s Alexandria, Virginia, policy shop and he happened to know Page. But Dearborn wouldn’t return my calls, and someone who once worked for that policy shop told me it was neither Dearborn nor Burt, but campaign co-chair Sam Clovis who recruited Page. “If he was part of that original group of people, I can say with 70 percent confidence it was Sam Clovis,” this person told me.\n\n“I’m not answering your questions,” Clovis told me. He refused to tell me if he was the one who found Page, but Jason Miller, the campaign’s other spokesperson, says, “Carter Page isn’t someone I’ve interacted with.” Which confirmed what a policy staffer on the Trump campaign told me: “Carter is a red herring, not a Rasputin. He’s never met Trump, never briefed him. He has zero influence, none.”\n\n***\n\nWas Page the shadowy messenger between the Kremlin and Trump Tower, or was he the nebbishy, not-very-successful man trying to profit from the arbitrage between what Trump said—he’s my adviser—and what his associates said—“Who?” Maybe I wasn’t doing this right, and maybe everyone was lying to me, but it was hard not to come to the conclusion that, regardless of whatever game the Russians were running, Page was firmly in the latter camp.\n\n“I don’t know about his Russia fund, other than it’s never really materialized,” says the prominent player in the energy space whom Page has pitched on various energy projects. “Every conversation I’ve had with Carter has not been terribly serious. They’ve all been pie-in-the-sky ideas. There are usually issues with traction and execution capabilities.” He went on. “I couldn’t name a project that I could connect Carter’s name to, any project that actually happened.”\n\n“I don’t know how he’s earned a living off this,” the energy player says, “but I think he’s been trying to be an intermediary. If you hang around Russia long enough, it’s sort of like a pinball machine, something will hit you.”\n\nStrangely, it was not a Russian pinball that hit him; it was Trump. According to the Trump policy adviser, this winter, Clovis began to draw up a list of people who could serve as policy advisers to the campaign and give it some intellectual and policy heft. At a time when established Republican foreign policy specialists were tripping over each other to get away from Trump, “a lot of people came to Sam Clovis in February, March, and said, ‘I want to be part of the team,’” says the Trump adviser. And that’s how it happened. “He’s just a guy on a list. Trump looked at the list and said, ‘He’s an adviser.’ And now he’s milking it for all it’s worth.”\n\nNow, someone whom no one in the field had ever heard of was suddenly a Very Important Person in Washington—or at least could plausibly market himself as one. “I was not aware of him at all until he was named to the campaign, and even after that, I had never heard of him,” one Russia specialist in Washington told me. He saw Page at a Washington roundtable in June for Indian Prime Minister Narendra Modi, and what he saw was a strange kind of person: one who was very differential to everyone there “in a way that someone who is junior would use it to network,” but who was dropping hints full of meaning to anyone who would listen—and be impressed. “He was saying he was planning to go to Moscow,” the Russia specialist recalls. “He didn’t say what he was going to do there, but he created the impression that there could be some meaning to the trip.”\n\nAccording to a congressional leadership staffer familiar with the intelligence briefings on Page’s trip to Russia, “the meetings did happen and that’s been established as a fact. I think the investigation is more what happened in them.” But it remained unclear, the staffer told me unprompted, what this even meant. “It’s not just did he met with them or not, but now looking into the bigger question of what the hell is going on?” said the staffer. “Is he acting as a conduit in ways that are against America’s national security interests? Wittingly or un-, I should add. It’s what’s hard to parse about this. Is he doing this with nefarious intent or is this just about guys who are thrilled to be living in a John le Carré novel? Or are they being played by much smarter people in the Kremlin?”\n\nThis seems to be vintage Carter Page, a man whose story never quite adds up, as much as he tries to make the numbers work. But he’s also mastered the art of manipulating the distance between his story as it is and his story as he wants it to be, playing on the uncertainty in between to make himself seem more successful, more connected, even more evil than he really is—and to try to turn a profit off of that. “If Page using his status as ‘Trump advisor’ for personal gain, that’s another matter: Time for Page to join Twitter!” Michael McFaul, former U.S. ambassador to Russia, tweeted after news of the investigation broke. The Russians may be feeling out the Trump campaign via Page, but Page must be loving every minute of it. After all, meeting Russia’s energy czar is an impossible dream for a would-be investor struggling to make it in the world of Russian energy—but the dream entered the realm of the possible when Trump said three words in March: “Carter Page, Ph.D.” Now Carter Page, Ph.D., has found a perfect candidate to latch on to, like a pilot fish feeding off the carnage wrought by the oblivious Trump shark.\n\nFor months now, the American press has been twisting itself in knots trying to explain men like Page and Manafort, and, through them, to answer the questions of whether Putin is trying to destroy America by their hands, and is Trump a Kremlin stooge or a just a useful idiot, and is there even a difference?\n\nThere doesn’t seem to be one in the world of Trump, which in some ways resembles Putin’s: the waters of truth are muddy and deeply suggestive. And that is all that matters. Is Putin actually meddling in our election and undermining the foundations of Western democracy in a massive way, or doing just enough to make us think he is, and thereby acquiring powers he holds only because we believe him to have them? “I want to hope that this is connected with the growing influence and significance of Russia,” Putin says of the rumors of Russian meddling in the American election—as we in the media continue to squeegee them around, rarely really getting closer to the truth, and watching it disintegrate in our hands when we think we’ve finally grasped it.\n\nJulia Ioffe is contributing writer at Politico Magazine.", "authors": ["Jack Shafer", "Julia Ioffe"], "keywords": [], "meta_data": {"description": "Reports of deep Russian ties swirl around Trump adviser Carter Page. Oddly, nobody in Russia seems to have heard of him.", "og": {"site_name": "POLITICO Magazine", "description": "Reports of deep Russian ties swirl around Trump adviser Carter Page. Oddly, nobody in Russia seems to have heard of him.", "title": "The Mystery of Trump’s Man in Moscow", "url": "http://politi.co/2crBNwG", "image": "http://static.politico.com/47/07/5255ce914040a7a0ca8aea7482f0/carter-page-ap-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/the-mystery-of-trumps-man-in-moscow-214283", "images": ["https://static.politico.com/dims4/default/8af8fe3/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F47%2F07%2F5255ce914040a7a0ca8aea7482f0%2Fcarter-page-ap-1160.jpg", "http://static.politico.com/47/07/5255ce914040a7a0ca8aea7482f0/carter-page-ap-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "The Mystery of Trump’s Man in Moscow: Carter Page", "url": "http://politi.co/2cYpJ8p", "summary": "", "movies": [], "publish_date": {"$date": 1474634160000}, "source": "http://politi.co"}
