{"top_img": "http://static.politico.com/4e/48/1335ebb54f2bbbda572f510110ac/160920-playbook-ap-700.jpg", "text": "Under the Radar Blog Archives Select Date… July, 2017 June, 2017 May, 2017 April, 2017 March, 2017 February, 2017 January, 2017 December, 2016 November, 2016 October, 2016 September, 2016 August, 2016\n\nAhmad Khan Rahami is taken into custody after a shootout with police Monday in Linden, N.J. | Nicolaus Czarnecki/Boston Herald via AP U.S. attorney sees no rush to arraign Rahami in federal court\n\nFederal prosecutors are pushing back against a demand by defense lawyers that New York and New Jersey bombing suspect Ahmad Rahami be arraigned immediately on federal charges he is facing.\n\nLate Tuesday, defense attorneys wrote to federal magistrate judge Gabriel Gorenstein asking that Rahami be promptly informed of the charges against him at a court proceeding that would also formally advise him of his right to counsel and his right to remain silent.\n\nHowever, prosecutors from the office of U.S. Attorney for the Southern District of New York Preet Bharara said in a letter to the magistrate Wednesday that Rahami isn't in federal custody so there is no legal obligation for the federal courts to get involved.\n\n\"The defendant in this case, Ahmad Khan Rahami, a/k/a 'Ahmad Rahimi,' has not been arrested on any federal charge. He is not in federal custody. He is in the custody of the State of New Jersey, on state charges, and is subject to a bail package issued by the New Jersey state court,\" federal prosecutors wrote. \"While a writ of habeas corpus ad prosequendum has been lodged with the United States Marshals Service, it has not been executed, and there has been no such federal arrest.\"\n\nThe writ referred to in the federal prosecutors' letter would require state or local officials to hand over Rahami to federal authorities for prosecution. Rahami is facing five attempted murder charges in a New Jersey court in connection with a shootout Monday morning in which the suspect and two police officers were wounded. Rahami is currently in a Newark hospital. A judge has set $5.2 million bail and an initial county court appearance for Sept. 28.\n\nDefense lawyers contend that Rahami has been \"without the benefit of counsel\" since his arrest, but it's unclear whether he's been advised of his Miranda rights or whether he's made some decision not to meet with an attorney. Lawmakers briefed on the investigation say he has not been cooperating.\n\nWhile Attorney General Loretta Lynch said Wednesday that Rahami would be taken to Manhattan in the \"near future,\" the letter from prosecutors evinces no urgency to such a move. Prosecutors say Rahami has no rights in the federal system at the moment, including a right to counsel.\n\nThe letter indicates that lawyers from the Federal Defenders office in New York have sought appointment in Rahami's case, but prosecutors say that's \"plainly premature\" until he is brought to court. Prosecutors cited a series of terrorism cases where judges ruled defendants were not entitled to court-appointed counsel until they appear in court.\n\nCourt records show no immediate action from Gorenstein on the request for Rahami's arraignment or the defense lawyers' request to be appointed as his counsel in the case.\n\nJosh Gerstein is a senior reporter for POLITICO.\n\nAuthors:", "authors": ["Josh Gerstein"], "keywords": [], "meta_data": {"description": "Prosecutors said that Rahami isn't in federal custody so there is no legal obligation for the federal courts to get involved.", "og": {"site_name": "POLITICO", "description": "Prosecutors said that Rahami isn't in federal custody so there is no legal obligation for the federal courts to get involved.", "title": "U.S. attorney sees no rush to arraign Rahami in federal court", "url": "http://politi.co/2dbzF2m", "image": "http://static.politico.com/4e/48/1335ebb54f2bbbda572f510110ac/160920-playbook-ap-700.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/blogs/under-the-radar/2016/09/ahmad-rahami-federal-court-charges-228482", "images": ["https://static.politico.com/dims4/default/cdfa4b0/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F4e%2F48%2F1335ebb54f2bbbda572f510110ac%2F160920-playbook-ap-700.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "http://static.politico.com/4e/48/1335ebb54f2bbbda572f510110ac/160920-playbook-ap-700.jpg"], "title": "U.S. attorney sees no rush to arraign Rahami in federal court", "url": "http://politi.co/2cS8sh4", "summary": "", "movies": [], "publish_date": {"$date": 1474471057000}, "source": "http://politi.co"}
