{"top_img": "http://a.abcnews.com/images/Politics/GTY_Debate01-hb_160926_16x9_992.jpg", "text": "Hillary Clinton and Donald Trump ushered the 2016 presidential campaign into a new phase tonight, and they did it with plenty of barbs.\n\nThe two candidates faced off in their first general election debate at Hofstra University in Long Island, New York, in front of what was expected to be a historic number of television viewers.\n\nHere are 10 moments that mattered at the first general election presidential debate:\n\n1. Nominees Started Off on a Friendly Note but No Escaping the Sarcasm\n\nHillary Clinton and Donald Trump have lobbed insults at each other from far away for months, but tonight they tried to start their highly anticipated face off on a genteel note, although the mutual contempt was just below the surface.\n\nWhen Clinton walked out in a red pantsuit and Trump in a blue tie -- the opponents’ trading traditional party colors -- the two shook hands and Clinton said, “How are you, Donald?” Perhaps trying to throw him off at the top with a warm greeting.\n\nShortly after the debate began, Trump talked about overseas trade deals, saying, “But in all fairness to Secretary Clinton,” before stopping himself and turning to his opponent and saying, “Yes, is that OK? Good. I want you to be very happy. It's very important to me.”\n\nHe seemed to be referring to his addressing her as “Secretary Clinton,” although it wasn’t completely clear during the moment.\n\n2. Personal Attacks Came Early\n\nClinton was first to go on the attack during tonight’s debate, taking aim at Trump’s business roots by claiming he borrowed $14 million from his father to start his real estate business.\n\n“Donald was very fortunate in his life and that's all to his benefit. He started his business with $14 million, borrowed from his father, and he really believes that the more you help wealthy people, the better off we'll be and that everything will work out from there. I don't buy that. I have a different experience,” Clinton said, before expanding on her father’s work as a drapery maker.\n\nTrump responded to that personal claim rather than addressing her subsequent remarks that he believes in “trumped up, trickle-down” economics.\n\n“For one thing, and before we start on that, my father gave me a very small loan in 1975 and I built it into a company that's worth many, many billions of dollars,” Trump said.\n\n3. Trading Barbs Over Trade\n\nVoters saw the first fiery moment of the debate when the two candidates sparred over the Trans-Pacific Partnership trade deal.\n\nTrump accused Clinton of supporting TPP, the proposed trade agreement between the United States and 11 other countries along the Pacific Rim.\n\n“And now you want to approve Trans-Pacific Partnership. You were totally in favor of it,” Trump said.\n\nClinton fired back, “Well, that is just not accurate. I was against it once it was finally negotiated and the terms were laid out.”\n\nTrump then pointed to Clinton’s once referring to TPP as the “gold standard of trade deals.”\n\n“Well, Donald, I know you live in your own reality, but that is not the facts,” Clinton said.\n\nClinton promoted TPP as secretary of state under President Obama, who is pushing the trade deal. While speaking in Australia in November 15, 2012, Clinton said, \"TPP sets the gold standard in trade agreements to open free, transparent, fair trade, the kind of environment that has the rule of law and a level playing field.” Clinton came out against the trade deal October of last year, saying that “what I know about it as of today I am not in favor of what I have learned about it.”\n\n4. Trump Asks ‘Why Not’ Blame All the World’s Problems on Clinton\n\nLess than 30 minutes into the debate, Trump went after Clinton, attacking her on trade, ISIS, taxes, the economy and more. Clinton quipped: \"I have a feeling by the end of this evening I'm going to be blamed for everything that's ever happened.”\n\nTrump didn’t miss a beat, saying to his opponent: “Why not?”\n\nClinton responded: \"Why not? Yeah. Why not? Just join the debate by saying more crazy things. Now, let me say this—“\n\nTrump interjected: \"There's nothing crazy about not letting our companies bring their money back into the country,” before the moderator reminded Trump, \"This is secretary Clinton's two minutes, please.\"\n\nDrew Angerer/Getty Images\n\n5. Trump Hit Over Not Releasing Tax Returns\n\nTrump clashed with his Democratic rival over his decision not to release his tax returns.\n\n“I don't mind releasing. I'm under a routine audit and it will be released,” he said. Trump went on to tout his disclosure of a different federally mandated form required by the U.S. Office of Government Ethics of everyone from presidential candidates to the postmaster general.\n\nTrump then pivoted to attack Clinton over her private email server. “I will release my tax returns against my lawyer's wishes when she releases her 33,000 e-mails that have been deleted,” he said.\n\n“I think you've just seen another example of bait and switch here. For 40 years, everyone running for president has release their tax returns,” she said. “You got to ask yourself: Why won't he release his tax returns?\n\n“Maybe he doesn't want the American people, all of you watching tonight, to know that he's paid nothing in federal taxes,” she said.\n\n6. The Birther Issue Gets on the Main Stage\n\nModerator Lester Holt asked Trump “what took you so long” to acknowledge that President Obama was born in the United States, bringing the Republican nominee’s recent turnaround on an issue that was central to his public positions for years.\n\nAt first, Trump claimed that two Clinton aides were the ones who initially looked into Barack Obama’s birth certificate during the 2008 campaign -- a claim that he has made before -- and then said that he was “satisfied” with when Obama released his birth certificate.\n\nHolt noted that Obama released his longform birth certificate in 2011, but Trump continued to raise questions about it’s authenticity until 2015.\n\n“Nobody was pressing it, nobody was caring much about it,” Trump said, referencing the years between the release and Trump’s decision this month to acknowledge Obama was born in America. “I figured you'd ask the question tonight, of course. But nobody was caring much about it. But I was the one that got him to produce the birth certificate, and I think I did a good job.”\n\nPaul J. Richards/AFP/Getty Images\n\n7. Clinton Defends Being ‘Prepared’ When Trump Questions Her Time Off the Trail\n\nTrump was talking about crime in the inner cities when he said, “I’ve been all over the place. You decided to stay home and that's OK,” seeming to jab Clinton for leaving the campaign trail in recent days to prepare for tonight’s faceoff.\n\n\"I think Donald just criticized me for preparing for this debate,” Clinton said. \"And, yes, I did. And you know what else I prepared for? I prepared to be president. And I think that's a good thing.”\n\nThroughout the debate, Clinton tried to portray Trump as unprepared and unwilling to do the hard work to prepare for the presidency. She also hit back against an attack he regularly makes on the campaign trail: That she doesn't stump as much as he does because she doesn't have his endurance.\n\n8. Stop and Frisk Becomes a Big Point of Discussion\n\nTrump’s support of stop and frisk, a controversial tactic once heavily used by the New York Police Department, was discussed at length during the debate.\n\n“Stop and frisk had a tremendous impact on the safety of New York City. Tremendous beyond belief. So when you say it has no impact, it really did, it had a very very big impact,” Trump said.\n\nTrump said that the tactic was not deemed unconstitutional -- which it was -- and added instead that “it went before a judge who was a very against-police judge.”\n\n“They would have won an appeal,” he said, noting that there was no appeal.\n\nTrump and Clinton went on to debate various crime rates in cities like Chicago and New York for nearly 10 minutes of the debate.\n\n9. Trump and the Iraq War Under the Microscope\n\nToward the end of the debate, Holt corrected Trump on whether he supported the war in Iraq before it started.\n\n“I did not support the war in Iraq,” Trump said. \"That is a mainstream media nonsense put out by her because she frankly I think the best person in her campaign is mainstream media.”\n\nHolt corrected him, saying, “The record shows otherwise.”\n\nThe only time Trump seems to have spoken about the war publicly before it started was to Howard Stern in 2002 and seemed to support the invasion. Stern asked Trump, “Are you for invading Iraq?\"\n\nTrump appeared to hesitate, responding, “Yeah, I guess so. I wish the first time it was done correctly.”\n\nDespite the attempt to correct him, Trump continued to stress he was against the war, saying, “The record shows that I am right.”\n\n10. Sparring Over Stamina\n\nHolt asked Trump about when he once said that Clinton does not have a “presidential look,” asking Trump what he meant by that. Trump pivoted to attack her “stamina.”\n\n\"She doesn't have the look, she doesn’t have the stamina,” Trump said. \"I said she doesn't have the stamina. And I don't believe she does have the stamina. To be president of this country, you need tremendous stamina.”\n\nTrump has been hitting Clinton on her stamina and strength on the campaign trail for months, but tonight Clinton tried to shut that line of attack down.\n\n\"Well, as soon as he travels to 112 countries and negotiates a peace deal, a cease-fire, a release of dissidents, an opening of new opportunities and nations around the world, or even spends 11 hours testifying in front of a congressional committee, he can talk to me about stamina,” Clinton said.\n\nShe also attempted to remind voters of some of the more controversial things he has said about women:\n\n\"One thing Lester, he tried to switch from looks to stamina,” Clinton said. \"But this is a man who has called women pigs, slobs and dogs. And someone who has said pregnancy is an inconvenience to employers. Who has said women don't deserve equal pay unless they do as good a job as men.”", "authors": ["More Veronica", "Ryan Struyk", "More Ryan", "Meghan Keneally", "More Shushannah", "Abc News", "More Meghan", "Veronica Stracqualursi"], "keywords": [], "meta_data": {"fb_title": "10 Moments That Mattered in 1st Clinton-Trump Debate", "description": "10 Moments That Mattered in 1st Clinton-Trump Debate", "copyright": "Copyright (c) 2017 ABC News Internet Ventures", "author": "ABC News", "og": {"site_name": "ABC News", "description": "Hillary Clinton and Donald Trump ushered the 2016 presidential campaign into a new phase tonight, and they did it with plenty of barbs.\nThe two candidates faced off in their first general election debate at Hofstra University in Long Island, New York, in front of what was expected to be a historic...", "title": "10 Moments That Mattered in 1st Clinton-Trump Debate", "url": "http://abcnews.go.com/Politics/presidential-debate-10-moments-mattered/story?id=42366107", "image": "http://a.abcnews.com/images/Politics/GTY_Debate01-hb_160926_16x9_992.jpg", "type": "article"}, "twitter": {"description": "Hillary Clinton and Donald Trump ushered the 2016 presidential campaign into a new phase tonight, and they did it with plenty of barbs.\nThe two candidates faced off in their first general election debate at Hofstra University in Long Island, New York, in front of what was expected to be a historic...", "title": "10 Moments That Mattered in 1st Clinton-Trump Debate", "url": "http://abcnews.go.com/Politics/presidential-debate-10-moments-mattered/story?id=42366107", "image": "http://a.abcnews.com/images/Politics/GTY_Debate01-hb_160926_16x9_992.jpg", "creator": "@ryanstruyk", "site": "@ABC", "app": {"url": {"ipad": "abcnewsipad://link/story,42366107", "iphone": "abcnewsiphone://link/story,42366107", "googleplay": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/presidential-debate-10-moments-mattered/story?id=42366107"}, "name": {"ipad": "ABC News", "iphone": "ABC News", "googleplay": "ABC News"}, "id": {"ipad": 306934135, "iphone": 300255638, "googleplay": "com.abc.abcnews"}}, "card": "summary_large_image"}, "robots": "index, follow", "DC.date.issued": "2016-09-28", "al": {"ipad": {"url": "abcnewsipad://link/story,42366107", "app_store_id": 380520716, "app_name": "ABC News for iPad"}, "web": {"url": "http://abcnews.go.com/Politics/presidential-debate-10-moments-mattered/story?id=42366107"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/presidential-debate-10-moments-mattered/story?id=42366107", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "iphone": {"url": "abcnewsiphone://link/story,42366107", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}}, "Date": "2016-09-28", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "Last-Modified": "2016-09-28 12:16:22", "keywords": "Hillary Clinton, Donald Trump, first presidential debate, debate, 2016 debate, politics news, election news, political news, political news articles", "article": {"author": "/author/meghan_keneally"}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "news_keywords": "Hillary Clinton, Donald Trump, first presidential debate, debate, 2016 debate"}, "canonical_link": "http://abcnews.go.com/Politics/presidential-debate-10-moments-mattered/story?id=42366107", "images": ["http://a.abcnews.com/images/Politics/gty_debate_trump_handsout_ps_160926_4x3_992.jpg", "http://a.abcnews.com/images/Politics/gty_debate_hillary_clinton_ps2_160926_4x3_992.jpg", "http://a.abcnews.com/images/Politics/GTY_Debate01-hb_160926_16x9_992.jpg", "http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "http://a.abcnews.com/images/Politics/GTY_Debate01-hb_160926_12x5_992.jpg"], "title": "10 Moments That Mattered From Hillary Clinton and Donald Trump's First Debate", "url": "http://abcn.ws/2d56mMD", "summary": "", "movies": [], "publish_date": null, "source": "http://abcn.ws"}
