{"top_img": "http://v.politico.com/images/1155968404/201609/3676/1155968404_5143747447001_5143712894001-vs.jpg?pubId=1155968404", "text": "Obama weighs in on the debate\n\nPresident Barack Obama hasn't changed his assessment of Donald Trump after Monday night's debate: The GOP nominee, he said on Tuesday, lacks the preparation and temperament for the presidency and can't be trusted to address serious threats like nuclear weapons and climate change.\n\nThe president unloaded on Trump during an interview with Ryan Seacrest in the wake of Trump's showdown with Hillary Clinton, which he watched from the Treaty Room of the White House.\n\nStory Continued Below\n\nObama touted Clinton’s performance and her qualifications for the presidency, saying “she’s serious and does her homework.”\n\nAnd he blasted Trump for not having the “preparations and the temperament or the core values of inclusion and making everybody, you know, have opportunities that would take our country forward.”\n\nThe president said his two biggest concerns for his daughters’ generation are the spread of nuclear weapons and the onset of climate change — adding that Trump falls short on both.\n\n\"I get worried when I hear somebody like Donald Trump start saying, 'Well, I don't necessarily know whether Japan or Korea should be protected by us. Maybe they should get their own nuclear weapons.' That shows somebody who doesn't pay attention to these issues, and you don't necessarily want close to the nuclear button,” Obama said. (Trump objected to a similar characterization of his views on East Asia during Monday's debate, saying it was \"wrong.\")\n\nObama also took a shot at Trump for suggesting, in a November 2012 tweet, that climate change is a hoax created by China.\n\nThe concept of global warming was created by and for the Chinese in order to make U.S. manufacturing non-competitive. — Donald J. Trump (@realDonaldTrump) November 6, 2012\n\n\"When you hear somebody like Trump say he thinks this is a plot by the Chinese, that this is a fraud and a hoax, when 99 percent of scientists are saying you've got to do something about it,\" Obama said, \"that worries me.\"\n\nKellyanne Conway, Trump's campaign manager, said in a TV interview on Tuesday that he believes climate change is \"naturally occurring.\"\n\nAuthors:", "authors": ["Brianna Ehley", "Jack Shafer"], "keywords": [], "meta_data": {"description": "Obama touted Clinton’s performance and her qualifications for the presidency, saying “she’s serious and does her homework.”", "og": {"site_name": "POLITICO", "description": "Obama touted Clinton’s performance and her qualifications for the presidency, saying “she’s serious and does her homework.”", "title": "Obama weighs in on the debate", "url": "http://politi.co/2d1aa0D", "image": "http://v.politico.com/images/1155968404/201609/3676/1155968404_5143747447001_5143712894001-vs.jpg?pubId=1155968404", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/brianna.ehley"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/trump-debate-performance-obama-228796", "images": ["http://v.politico.com/images/1155968404/201609/3676/1155968404_5143747447001_5143712894001-vs.jpg?pubId=1155968404", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Obama weighs in on the debate", "url": "http://politi.co/2dpdeXp", "summary": "", "movies": [], "publish_date": {"$date": 1474984149000}, "source": "http://politi.co"}
