{"top_img": "http://static.politico.com/e6/39/fd05beec4b3bbe9db806e2ff1141/20160926-debate-prep-ap.jpg", "text": "Hillary Clinton’s campaign is making one plea ahead of Monday night’s big debate: Don’t let Donald Trump get away with it.\n\nAnd Trump’s campaign is firing right back, arguing that the press is biased against the Republican nominee and, in any case, Clinton’s team is just trying to “game the refs.”\n\nStory Continued Below\n\nThe debate is playing out against a backdrop of polls that indicate a tightening White House race, with Trump drawing even or ahead in national and battleground-state surveys. Polling averages now show that Clinton’s post-convention lead has evaporated, and no less a guru than Nate Silver declared on Monday morning that the race is a “dead heat.”\n\n“The latest polling is consistent with a Clinton lead of only ~1% nationally. State firewall breaking up. Trend lines awful,” Silver tweeted.\n\nDuring the critical hours of expectation-setting ahead of the 9 p.m. showdown at Hofstra University, both camps claimed their candidate would be held to an unfair standard, with Clinton’s aides explicitly requesting that moderator Lester Holt fact-check Trump in real time.\n\n“We are concerned that Donald Trump may lie, he may throw misinformation out there, and that Hillary will have to spend all of her time trying to correct the record rather than talking about the things she wants to accomplish,” Clinton campaign manager Robby Mook told “CBS This Morning,” adding that all the campaign is asking of Holt is that if Trump lies, “that that simply be checked.”\n\n“The thing that concerns us is not the moderator themselves, who have been selected by the commission, because they will be seen as fair and even-handed. What bothers us, Mark, is the very public and very coordinated attempt to game the refs,\" Trump campaign manager Kellyanne Conway shot back in an interview on MSNBC.\n\nBut Conway was soon put in the awkward position of defending Trump’s claim that Holt may be unfair to him because he’s a Democrat and the system is “very unfair.” The “NBC Nightly News” anchor has been a registered Republican in New York since 2003.\n\n“I don’t know that he knew what Lester Holt’s voter registration was,” said Conway, who went on to dodge multiple queries of why Trump lied. “He didn’t lie,” Conway said at one point, explaining that “a lie would mean that he knew the man’s party registration.”\n\nIn a presidential cycle that’s seen endless debates about debates, Monday’s theme was conflicting interpretations of what it means to be a moderator. After suggesting a debate with no moderator, Trump has already signaled to Holt that he shouldn’t try to be Candy Crowley, who famously injected herself into the 2012 presidential debate between President Barack Obama and Mitt Romney with a fact-check of the GOP nominee.\n\nBut Clinton’s campaign has beat up on Holt’s NBC colleague Matt Lauer, who was widely panned in the media for allowing Trump’s false assertion that he didn’t support the Iraq war go unchecked during a national security forum earlier this month.\n\nView One week of Hillary Clinton fact-checks (September 24, 2016) One week of Hillary Clinton fact-checks (September 24, 2016)\n\nThe nonpartisan Commission on Presidential Debates, which selected the debate sites and moderators, weighed in Sunday. “In our history, the moderators have found it appropriate to let the candidates be the ones that talk about the accuracy or the fairness of what the other candidate or candidates might have said,” Janet Brown, the commission’s executive director, told CNN’s “Reliable Sources.”\n\nWhen it comes to fact-checking, Brown warned, “I don’t think it’s a good idea to get the moderator into essentially serving as the Encyclopedia Britannica.”\n\nFor her part, Clinton won’t let Trump’s lies “go by the wayside,” press secretary Brian Fallon told CNN on Monday, insisting that Holt shouldn’t, either.\n\n“There is enough lies that Donald Trump tells consistently that everyone, by now, should be able to call them out,” he said. “Lester Holt, Hillary Clinton will, too, but I think that even the observers and reporters tonight watching that are grading the two candidates’ performances should take it into account. By now, we all know he likes to lie about his record when it comes to the Iraq war, he lies about his support for the intervention in Libya, he lies about who started birtherism, he lies on any different number of issues and he tells them so frequently that we all know them now. If he says them again, that should be disqualifying. He can’t possibly be given a passing grade if he repeats those lies.”\n\nFormer Trump campaign manager Corey Lewandowski, a paid CNN contributor who is still receiving severance from the Trump campaign, dismissed the idea that a fact-checking moderator is of any concern.\n\n“I think what the concern is from both of the campaigns — and what it should be — is that the moderator is not the person who’s running for president of the United States. So I think you let the candidates debate, you let the candidates answer,” he said. “You can hold people accountable, there’s no question, but I don’t think it’s the role of the moderator to inject themselves in so they’re making themselves part of the debate structure and people are talking about the moderator after the debate.”\n\nTrump’s campaign, including his former aide Lewandowski, also pushed the narrative that Clinton is robotic. That charge was leveled in response to the Clinton camp’s preparation for two Trumps.\n\n“We don’t want Donald Trump’s lies and distortions to be a distraction. We’re hoping that can get checked so that Hillary can focus her time on what she wants to do,” Mook told NBC’s “Today.”\n\nAsked about Clinton’s rules of engagement versus Trump, Mook added that “it just depends on what Donald Trump shows up to the debate, and we just don’t know that.”\n\nView One week of Donald Trump fact-checks (September 24, 2016) One week of Donald Trump fact-checks (September 24, 2016)\n\nBut Conway shot down the notion that there’s any other Trump, while echoing the criticism that the former secretary of state lacks human compassion. Lewandowski cast Clinton as a policy wonk whose challenge is “to become human” during the debate, senior communications adviser Jason Miller tweeted that “Overprogramming leads to short circuits,” and Conway joined the pile-on.\n\n“He’s not going to be robotic and scripted. Hillary Clinton is,” Conway said. “And that’s a problem in debates likes this because people want to see a future commander in chief and president of the United States who is nimble and resilient and can answer questions that haven’t been pre-programmed in their head through all this secretive debate prep and mock debates.”\n\nAfter Mook warned against “a double standard where Donald Trump can get the Most Improved award but Hillary Clinton, you know, is getting judged on the fine points of policy,” Conway added that the two campaign managers “are living in parallel universes.”\n\n“I mean, Donald Trump has been criticized all weekend long. I think that the Clinton campaign has clearly been gaming the refs, has been talking to the media for a week now saying it’s your job to make sure that Donald Trump is fact-checked in real-time,” she said. “I'm just surprised a campaign manager would try to lower expectations that dramatically for his own candidate. But look, they know that campaign debates are not Hillary Clinton's sweet spot. Yes, she's experienced at doing them, but the experience hasn’t necessarily been beneficial.”\n\nAside from how Holt will moderate, Conway cited pre-written narratives and what she claimed was Clinton’s willingness to say anything to get elected as her top concerns.\n\n“I’m worried that some of the headlines are already written, that they’re conclusions in search of evidence,” Conway said, adding that newspapers and reporters have already begun trying to undercut Trump ahead of the debate.\n\n“What I would ask you all to do is start looking at the Twitter feeds of, quote, objective reporters, particularly our embeds. These are not profiles in courage, and this is not journalism. There are people who cover our campaign who actually just slander our candidate on Twitter,” Conway said. “Ninety-two percent of at least two of our embeds’ tweets are negative towards Donald Trump. Why are they on our campaign plane? Why are they covering our campaign? ... Excuse the Trump campaign if we feel like we can’t get a fair shake from certain people.”\n\nConway also indicated that Clinton may play the woman card, skewing headlines that take away from the real estate mogul’s performance.\n\n“So if she ends up saying to him, ‘That’s just not true, you’re distorting my record, you’re being mean to a woman,’ and then people will say, ‘He was mean to a woman,’ and the headlines will scream and Twitter will blow up — even if it’s not true,” she said. “So that would be my concern, that he’s not able to get out all of his responses because, as Joe [Scarborough] correctly points out, people are so worried that she’s not a great debater, that she’s not really ready for tonight the way he is, that she’s going to try to interrupt him and confuse the people watching in such a way that he was somehow rude to a woman and he somehow lied on the stage.”\n\nRudy Giuliani, the former New York mayor and a prominent Trump surrogate, said he had advised Trump to \"just let loose\" and be himself — and not try to compete with Clinton's detailed policy expertise.\n\n\"She's been in government since I was a child. I don't remember a time she hasn't been in government in one way or another,\" Giuliani said on \"Fox and Friends.\" \"So she's going to have obviously more specific knowledge than he has, but I think he's going to comport himself very, very well, and he's going to be — he's just going to be like you see him on — when he comes here [on Fox News] and when you talk to him on the phone. He's going to be Donald Trump.\"\n\nAuthors:", "authors": ["Jack Shafer", "Steven Shepard", "Glenn Thrush", "Nolan D", "Shane Goldmacher"], "keywords": [], "meta_data": {"description": "The Clinton and Trump camps are still sparring over the basic rules of the game.", "og": {"site_name": "POLITICO", "description": "The Clinton and Trump camps are still sparring over the basic rules of the game.", "title": "Clinton vs. Trump: The debate before the debate", "url": "http://politi.co/2dl3YmI", "image": "http://static.politico.com/e6/39/fd05beec4b3bbe9db806e2ff1141/20160926-debate-prep-ap.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/NolanDMcCaskill"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/clinton-trump-fight-2016-pre-debate-228669", "images": ["https://static.politico.com/dims4/default/a575319/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fe6%2F39%2Ffd05beec4b3bbe9db806e2ff1141%2F20160926-debate-prep-ap.jpg", "http://static.politico.com/e6/39/fd05beec4b3bbe9db806e2ff1141/20160926-debate-prep-ap.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Clinton vs. Trump: The debate before the debate", "url": "http://politi.co/2d0l760", "summary": "", "movies": [], "publish_date": {"$date": 1474885803000}, "source": "http://politi.co"}
