{"top_img": "http://static.politico.com/46/6c/60519398418ea873d177635e78bd/caucus-debate.jpg", "text": "The pressure is on Hillary Clinton.\n\nInsiders in both parties agree: Clinton, having lost most of her lead over the past few weeks and bringing more experience to the stage, faces higher expectations than Donald Trump when the two square off for the first debate on Long Island.\n\nStory Continued Below\n\nThat’s according to The POLITICO Caucus — a panel of activists, strategists and operatives in 11 key battleground states. Roughly equal percentages of Democrats (69 percent) and Republicans (74 percent) said Clinton is under more pressure to perform than Trump. But Democrats mostly lamented the low expectations for Trump, a relative political neophyte who has exhibited little command of the issues.\n\n“She shouldn't be [under more pressure], but so long as he avoids standing on stage and vomiting on himself, the press will give Trump a glowing review,” said a Nevada Democrat — who, like all respondents, completed the survey anonymously. “Hillary will need a strong performance to demonstrate that she passes and Trump fails the commander-in-chief test.”\n\n“The media and Trump himself have set the bar too low for Trump,” a New Hampshire Democrat added. “Presidents don't get graded on a curve, and candidates in debates shouldn't be either.”\n\nOne Ohio Democrat detected a double standard for the first female major-party nominee.\n\n“Hillary Clinton has spent a public lifetime of being held to a strikingly different standard, and this debate will be no exception,” said the Ohio Democrat. “She will have to answer every single question flawlessly, exude gravitas, look presidential, channel Bill's and Barack's oratorical mastery, not raise her voice, not cough, wear an acceptable pantsuit, smile enough, be likable, not laugh and have a good hair day. Donald Trump will just have to show up.”\n\nRepublicans also said Clinton was under greater scrutiny on Monday night, but for different reasons: tightening polls that show Trump eclipsing Clinton in some battleground states.\n\n“Somehow she needs to reverse the trend,” said an Ohio Republican. “Never seen anyone do it before. This will be her chance — and maybe her last chance.”\n\n“She has to stop [Trump’s] momentum with a strong debate performance, and she has to be able to stand on the stage for 90 minutes and look healthy for 90 minutes or the whole issue of her health comes back with a vengeance,” added a Virginia Republican. “All [Trump] has to do is not say anything racist or sexist and look like he could be president.”\n\nAmong those insiders who said Trump was under more pressure — 31 percent of Democrats and 26 percent of Republicans — most pointed to the GOP nominee’s volatile personality.\n\n“Hillary Clinton is expected to do well. She is a policy wonk,” said a Michigan Republican. “The pressure is on Donald Trump not to lose his cool. He has been doing very well in his public appearances, but that is with the assistance of a TelePrompTer. He will have no such help at the debate, and if I were coaching Hillary Clinton, I would be encouraging her to get him as riled up as possible. To win the debate, all Trump really needs to do is meet expectations, keep his cool, and look presidential.”\n\n“The question we are all waiting to have answered is: Can he be serious?” added a Michigan Democrat. “Can he answer questions directly? How will he react (or overreact) when he is directly challenged? Can he control his temper?”\n\nTwo other takeaways from the pre-debate survey:\n\nMost insiders expect Clinton to “win” the debate.\n\nMajorities in both parties peg Clinton as most likely to be the victor on Monday night: 76 percent of Democrats and 59 percent of Republicans.\n\n“Media look at who best answered questions, and that will likely be Hillary,” said an Iowa Republican.\n\n“[Clinton’s] mastery of issues and policies and no-nonsense delivery will prevail over bluster, name-calling and promises that can never be kept,” added a New Hampshire Democrat.\n\nBut not all Democrats were so optimistic about Clinton — or the media through which voters will interpret the debate.\n\n“The press wants Trump to win,” said a Florida Democrat. “Their disdain for her, plus desire to keep the race alive, means unless he really screws up, they'll give him the win on the most absurd grade curve ever.”\n\nSome Republicans also claimed media bias — in the other direction.\n\n“The media has never been more in the tank for a candidate in modern history: CNN, NBC, ABC and POLITICO will all say she won,” a Virginia Republican said. “But then again everyone also 'knew' that Carter beat Reagan in their debate as well.”\n\nInsiders think the debate will matter.\n\nAsked whether they expect the debate to have a significant impact on the race, most insiders in both parties think it will generate momentum for one of the candidates.\n\nAmong Democratic insiders, 66 percent believe Clinton will benefit from the debate, 11 percent think Trump will get a bounce and 23 percent don’t expect the debate to move the needle.\n\n“Trump will flounder, ramble and lie (because he always does),” a Michigan Democrat predicted. “The moderators will challenge him, and he'll get mad. He'll complain afterwards that they picked on him and favored Hillary. First impressions are hard to shake off, and this won't go well for him.”\n\nThe numbers were flipped for Republicans, with slightly less enthusiasm for the GOP standard-bearer: 52 percent think the debate will help Trump, 26 percent think it will help Clinton and 22 percent said it wouldn’t have a significant impact.\n\n“Trump has the most to gain by appearing presidential and even-tempered,” said a New Hampshire Republican. “He does that successfully, and he cuts into Hillary's greatest strength.”\n\nBut some Republicans said Clinton could stunt Trump’s momentum with a strong performance Monday night.\n\n“If she pins his ears back, [it helps her],” said an Iowa Republican. “If it's a draw, it's a net negative for her. She has to have something to stop his momentum. She's got to hit him with a brick.”\n\nOther insiders, however, doubted whether the debate would have a significant, permanent effect on the race.\n\n“We're past the era of the big debate swings: the bloodless Dukakis death penalty answer, the Reagan age quip, the Bentsen 'you're no John Kennedy' moments,” an Iowa Republican said. “Swing voters are like the California Condor, a critically endangered species disappearing at an alarming rate. Opinion media, partisan polarization, and two highly unpopular candidates make this a battle over a very small group of voters in about a dozen states, and whatever bounce comes out of this debate will dissipate as quickly as it appears.”\n\nAdded a Florida Democrat: “Does a damn thing matter this year? I think not.”\n\nThese are the members of The POLITICO Caucus, not all of whom participated in this special survey:\n\nColorado: Ryan Call, Laura Carno, Matt Chandler, Will Coyne, Adam Eichberg, Mark Ferrandino, Cole Finegan, Michael Fortney, Andrew Freedman, Ted Harvey, Craig Hughes, Owen Loftus, Pete Maysmith, Frank McNulty, Karen Middleton, Christopher Murray, BJ Nikkel, Josh Penry, Rick Ridder, Alan Salazar, Janice Sinden, Pat Steadman, Pat Waak, Steve Welchert, Taylor West, Roxane White, Rob Witwer\n\nFlorida: Fernand Amandi, Scott Arceneaux, JP Austin, Tim Baker, Dennis K. Baxley, Slater Bayliss, Dave Beattie, Wayne Bertsch, Ron Book, Pamela Burch Fort, Jose Calderon, Kevin Cate, Kelly Cohen, Gus Corbella, Brian Crowley, Elizabeth Cuevas-Neunder, Justin Day, Judith Diaz, Nelson Diaz, John Dowless, Ryan Duffy, Jessica Ehrlich, Joe Falk, Alia Faraj-Johnson, Mark Ferrulo, Damien Filer, Marty Fiorentino, Rich Heffley, Nick Iarossi, David Johnson, Eric Johnson, Marian Johnson, Eric Jotkoff, Chris Korge, Jackie Lee, Susan MacManus, Beth Matuga, Fred Menachem, Jon Mills, Joe Mobley, Ben Pollara, Andrea Reilly, Steve Schale, April Schiff, Max Steele, Roger Stone, Richard Swann, Kevin Sweeny, Christian Ulvert, Steve Vancore, Ashley Walker, Andrew Weinstein, Andrew Wiggins, Ryan Wiggins, Rick Wilson\n\nIowa: Tim Albrecht, Brad Anderson, Rob Barron, Jeff Boeyink, Bonnie Campbell, Dave Caris, Sam Clovis, Jerry Crawford, Sara Craig, John Davis, Steve Deace, John Deeth, Derek Eadon, Ed Failor Jr., Karen Fesler, David Fischer, Ben Foecke, Doug Gross, Steve Grubbs, Tim Hagle, Bob Haus, Joe Henry, Drew Ivers, Jill June, Lori Jungling, Jeff Kaufmann, Brian Kennedy, Jake Ketzner, David Kochel, Chris Larimer, Chuck Larson, Jill Latham, Jeff Link, Dave Loebsack, Mark Lucas, Liz Mathis, Jan Michelson, Chad Olsen, David Oman, Matt Paul, Marlys Popma, Troy Price, Christopher Rants, Kim Reem, Craig Robinson, Sam Roecker, David Roederer, Nick Ryan, Tamara Scott, Joni Scotter, Karen Slifka, John Smith, AJ Spiker, Norm Sterzenbach, John Stineman, Matt Strawn, Charlie Szold, Phil Valenziano, Jessica Vanden Berg, Nate Willems, Eric Woolson, Grant Young\n\nMichigan: Jill Alper, Saul Anuzis, Andrea Bitely, Lori Carpentier, Howard Edelson, Jordan Gehrke, Steve Hood, Darwin Jiles Jr., Joe Lehman, Dennis Lennox, Katie Packer, Ronna Romney McDaniel, John Truscott, Stephanie White, John Yob\n\nNevada: Mac Abrams, Greg Bailor, Barbara Buckley, Yvanna Cancela, Bob Cavazos, Linda Cavazos, Jim DeGraffenreid, Andrew Diss, Peter Ernaut, Ryan Erwin, Chip Evans, Jay Gerstema, Oscar Goodman, Ryan Hamilton, Dan Hart, Pat Hickey, Zach Hudson, Jeremy Hughes, Megan Jones, Lindsey Jydstrup, Adam Khan, Peter Koltak, Roberta Lange, Sam Liberman, Laura Martin, Michael McDonald, Chuck Muth, Erven Nelson, Kristen Orthman, Neal Patel, Nick Phillips, Jon Ralston, Andres Ramires, Emmy Ruiz, Scott Scheid, Mike Slanker, James Smack, Paul Smith, Jack St. Martin, Mari St. Martin, Daniel Stewart, Brendan Summers, Riley Sutton, Robert Uithoven, Michelle White, Ed Williams, Heidi Wixom\n\nNew Hampshire: Charlie Arlinghaus, Arnie Arnesen, Patrick Arnold, Rich Ashooh, Dean Barker, Juliana Bergeron, D.J. Bettencourt, Michael Biundo, Ray Buckley, Peter Burling, Jamie Burnett, Debby Butler, Dave Carney, Jackie Cilley, Catherine Corkery, Corriveau, Fergus Cullen, Lou D’Allesandro, James Demers, Mike Dennehy, Sean Downey, Steve Duprey, JoAnn Fenton, Jennifer Frizzell, Martha Fuller Clark, Amanda Grady Sexton, Jack Heath, Gary Hirshberg, Jennifer Horn, Peter Kavanaugh, Joe Keefe, Rich Killion, Harrell Kirstein, Sylvia Larsen, Joel Maiola, Kate Malloy Corriveau, Maureen Manning, Steve Marchand, Tory Mazzola, Jim Merrill, Jayne Millerick, Claira Monier, Greg Moore, Matt Mowers, Terie Norelli, Chris Pappas, Liz Purdy, Tom Rath, Colin Reed, Jim Rubens, Andy Sanborn, Dante Scala, William Shaheen, Stefany Shaheen, Carol Shea-Porter, Terry Shumaker, Andy Smith, Craig Stevens, Kathy Sullivan, Chris Sununu, James Sununu, Jay Surdukowski, Donna Sytek, Kari Thurman, Colin Van Ostern, Deb Vanderbeek, Mike Vlacich, Ryan Williams\n\nNorth Carolina: Don Davis, Francis X. De Luca, Anita Earls, Jonathan Felts, Tami L. Fitzgerald, Dylan Frick, Taylor Griffin, Robin Hayes, Morgan Jackson, Patsy Keever, Theresa Kostrzewa, Michael Luethy, Ray Martin, Thomas Mills, Melissa L. Reed, Chris Sgro, Paul Shumaker, Dee Stewart, Brad Thompson, Bruce Thompson, Charlie Wallin, Doug Wilson\n\nOhio: Jerry Austin, Greg Beswick, Matt Borges, Erica Bruton, Tim Burke, Janet Carson, Jai Chabria, Martha Clark, Bob Clegg, Damareo Cooper, Jo Ann Davidson, Michael Dawson, Bill DeMora, Cindy Demse, Kathy Dicristofaro, Katie Eagan, Michael Gonidakis, Wes Goodman, Joe Hallett, Ian James, Melissa Klide Hedden, David Leland, Nick Martin, Rhine McLin, David Pepper, Molly Shack, Mark R. Weaver\n\nPennsylvania: Chris Borick, Larry Ceisler, Valentino DiGiorgio, Jason Ercole, Dan Fee, Charlie Gerow, Marcel Groen, Leslie Gromis Baker, Mark Harris, Nan McLaughlin, Aubrey Montgomery, Christopher Nicholas, Nachama Soloveichik, David Sosar, Todd Stephens, Doc Sweitzer, David Thornburgh, Ray Zaborney\n\nVirginia: Ray Allen, Sandra Brandt, Marc K. Broklawski, Patsy Brown, Janet Carver, John Cosgrove, Brian Coy, Doris Crouse-Mays, Tom Davis, Julie Dime, Abbi Easter, Mike Farris, John Findlay, Joe Fitzgerald, Sean Harrison, Margo Horner, Robert Hurt, Gaylene Kanoyton, Chris LaCivita, Sue Langley, Frank Leone, Robert G. Marshall, Tucker Martin, Ed Matricardi, Susan J. Rowland, Peter Snyder, Susan Swecker, Jo Thoburn\n\nWisconsin: Meg Andrietsch, Mary Arnold, Kevin Barthel, Mike Basford, Rebecca Bonesteel, Barry Burden, Terri Burl, Jim Camery, Patrick Guarasci, Robert Hansen, Gary Hawley, Marian Krumberger, Emily Nehring, Jason Rae, Brandon Scholz, John Zapfel\n\nKristen Hayford contributed to this report.\n\nAuthors:", "authors": ["Steven Shepard"], "keywords": [], "meta_data": {"description": "'She will have to answer every single question flawlessly, exude gravitas...not cough, wear an acceptable pantsuit, smile enough, be likable, not laugh and have a good hair day. Donald Trump will just have to show up,' said an Ohio Democrat.", "og": {"site_name": "POLITICO", "description": "'She will have to answer every single question flawlessly, exude gravitas...not cough, wear an acceptable pantsuit, smile enough, be likable, not laugh and have a good hair day. Donald Trump will just have to show up,' said an Ohio Democrat.", "title": "Insiders: The heat is on Hillary", "url": "http://politi.co/2diUIQd", "image": "http://static.politico.com/46/6c/60519398418ea873d177635e78bd/caucus-debate.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/debate-trump-clinton-caucus-228654", "images": ["http://static.politico.com/46/6c/60519398418ea873d177635e78bd/caucus-debate.jpg", "https://static.politico.com/dims4/default/c6a86b2/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F46%2F6c%2F60519398418ea873d177635e78bd%2Fcaucus-debate.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Insiders: The heat is on Hillary", "url": "http://politi.co/2cP9WaV", "summary": "", "movies": [], "publish_date": {"$date": 1474866410000}, "source": "http://politi.co"}
