{"top_img": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/Wires/Images/2016-09-12/AP/France_Plastic_Ban-0fe15.jpg?t=20170517", "text": "\n\nPlastic glasses, knives, forks and food boxes are being been banned in France. (Bertrand Combaldieu/Associated Press)\n\nPARIS — France has apparently become the first country in the world to ban plastic plates, cups and utensils, passing a law that will go into effect in 2020. Exceptions will be allowed for items made of compostable, biosourced materials.\n\nThe new law is a part of the country’s Energy Transition for Green Growth Act, the same legislation that also outlawed plastic bags in grocery stores and markets beginning in July. Although plastic bags are forbidden in other countries — including in some U.S. states — no country seems to have embraced a plastic ban as sweeping as France’s will be.\n\nThe general idea behind the law — following the landmark conference held in Paris last fall on curbing global warming — is to promote a “circular economy” of waste disposal, “from product design to recycling,” French lawmakers say.\n\n[A Maryland county’s nickel tax for plastic bags is paying off, but not as planned]\n\nObjections to plastic as a material are well known. For one, it does not biodegrade and only breaks down into smaller and smaller particles, which pose a significant danger for wildlife that cannot always distinguish it from food sources, particularly in oceans. Aside from ecosystem disruptions, millions of barrels of oil are used every year in manufacturing plastic bags and utensils, playing what environmental activists call a significant role in climate change.\n\nIn the words of French President François Hollande, the ban is part of a larger push intended “to make France … an exemplary nation in terms of reducing greenhouse gas emissions, diversifying its energy model and increasing the deployment of renewable energy sources” -- starting, it would seem, with the forks and knives distributed at fast-food restaurants and the coffee cups in vending machines.\n\nNot all share the enthusiasm of France’s Socialist government, which has made environmental progress one of its main goals. In Brussels, some argue that the laws violate existing European Union legislation regarding the free movement of goods and the protection of manufacturers.\n\nEamonn Bates, the secretary general of Pack2Go Europe, a Brussels-based association that represents packaging manufacturers on the continent, told the Associated Press that his organization will challenge France’s ban.\n\n“We are urging the European Commission to do the right thing and to take legal action against France for infringing European law,” he said. “If they don’t, we will.”\n\nSupporters of the ban wanted it to be introduced earlier, possibly as soon as 2017. But Ségolène Royal, the French environment minister, had initially considered it an “anti-social” provision, on the grounds that low-income families relied on plastic utensils and plates.\n\nThe ban was then postponed until 2020.", "authors": [], "keywords": [], "meta_data": {"theme": "normal", "news_keywords": "Post Keywords", "og": {"site_name": "Washington Post", "description": "The ban, to take effect in 2020, is part of a program aimed at making France a model for reducing environmental waste.", "title": "France becomes the first country to ban plastic plates and cutlery", "url": "https://www.washingtonpost.com/news/worldviews/wp/2016/09/19/france-bans-plastic-plates-and-cutlery/", "image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/Wires/Images/2016-09-12/AP/France_Plastic_Ban-0fe15.jpg?t=20170517", "type": "article"}, "referrer": "unsafe-url", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "jameskmcauley"}, "object-hash": 1503984085, "robots": "index,follow", "apple-itunes-app": "app-id=938922398, app-argument=https://www.washingtonpost.com/news/worldviews/wp/2016/09/19/france-bans-plastic-plates-and-cutlery/", "fb": {"admins": 500835072, "app_id": 41245586762}, "keywords": "Post Keywords", "article": {"publisher": "https://www.facebook.com/washingtonpost"}, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "description": "The ban, to take effect in 2020, is part of a program aimed at making France a model for reducing environmental waste."}, "canonical_link": "https://www.washingtonpost.com/news/worldviews/wp/2016/09/19/france-bans-plastic-plates-and-cutlery/", "images": ["https://img.washingtonpost.com/wp-apps/imrs.php?src=https://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2016-09-12/AP/France_Plastic_Ban-0fe15.jpg&w=60", "https://me.effectivemeasure.net/em_image", "https://www.washingtonpost.com/pb/resources/img/washingtonpost_black_32.png", "https://img.washingtonpost.com/rf/image_1484w/2010-2019/Wires/Images/2016-09-12/AP/France_Plastic_Ban-0fe15.jpg?t=20170517", "https://sb.scorecardresearch.com/p?c1=2&c2=3005617&cv=2.0&cj=1", "https://www.washingtonpost.com/pb/resources/img/thewashingtonpost-white-2x.png"], "title": "France becomes the first country to ban plastic plates and cutlery", "url": "https://www.washingtonpost.com/news/worldviews/wp/2016/09/19/france-bans-plastic-plates-and-cutlery/", "summary": "", "movies": [], "publish_date": {"$date": 1474243200000}, "source": "https://www.washingtonpost.com"}
