{"top_img": "http://static.politico.com/e9/11/6144cdc24e319c921fea909525b3/manufacturing.jpg", "text": "Getty Images Wealth Of Nations Trump vs. Clinton: A Fundamental Clash over How the Economy Works He sees it as zero-sum. She believes all boats rise together. Hillary is right, but a lot of people are buying into Trump’s vision.\n\nAs he made clear once again in Monday night’s debate, Donald Trump sees the world in zero-sum terms—when one person or one country wins, another always loses. Asked by NBC’s Lester Holt how to help American workers, Trump responded in his usual way, saying America was getting beaten by everyone else around the world, and the NAFTA free-trade deal was “one of the worst things that ever happened to the manufacturing industry. ... We have to stop these countries from stealing our companies and our jobs.”\n\nHillary Clinton, by contrast, sees the world as a place where all boats can rise at once—as she also made plain Monday by harking back to Bill Clinton’s pro-globalization presidency, which included NAFTA. ‘I think my husband did a pretty good job in the 1990s. I think a lot about what worked and how we can make it work again,” she said. “Incomes went up for everybody.”\n\nStory Continued Below\n\nThat is the election of 2016 distilled down to its essence. “My whole life is about winning. … I always win,” Trump says in explaining why he’s running. The economic plan on his website begins with the rubric “Winning the Global Competition.” You don’t get more zero-sum than that.\n\nDespite the view of most economists that the economy overall is not a zero-sum game—but rather a complex mechanism that, if run right, can raise everyone’s welfare at once–Trump’s message has resonated in an era when it’s become common to speak of winners and losers in the global economy. The zero-sum message fits neatly with the widespread reality that many millions have been severely harmed by the transitions in our economy over the past decades. As Danny Vinik recently noted in Politico, the gap between those who are thriving in the new economies of today and those who are not continues to grow.\n\nThe recent Census Report that showed a 5.2 percent increase in real median income between 2014 and 2015 was taken by many as proof that the narrative of an America in decline and losing is fundamentally flawed. Statistically, if the United States is one unit, that is true. But 320 million people have a huge variety of experiences ill-suited to one size fit all numbers, and while the averages and medians may go up or down, that says nothing about the lived experience of tens of millions who diverge from that one number. And the experience of a goodly portion of what was the industrial heartland and what was the epicenter of the mid-2000s housing bubble is unequivocally negative, insecure and economically grim.\n\nHence, you have the sense that those who perceive themselves as winners in the global economy are trending towards the Democrats, while those who think they’ve lost are going toward Trump. There is some truth there, but that isn’t a sufficient explanation for why, for instance, massive percentages of African-Americans and Latinos, who have certainly struggled economically and socially, support Clinton.\n\nNo, what is most striking about this election is the degree to which the electorate is polarized not between winners and losers per se but between those who view the world in such zero-sum terms, like Trump, and those who sense that it is possible to multiply the numbers of “winners” without creating a commensurate number of losers. That has been the mantra of Clinton and her predecessors in the Democratic Party, and it was also the foundation of Ronald Reagan’s appeal. The belief that the economic pie can expand year after year and embrace ever more people has also backed up by a generation of economists who argue that open trade and globalization makes the whole world wealthier.\n\nHillary Clinton has continued to deliver that message. At the Democratic Convention in July she spoke of an America thriving with economic opportunity, with millions working hard and succeeding. President Obama has also been at pains to highlight the innovations of Silicon Valley, the revival of many cities in the past decade, and the substantial gains on the other side of 2008-2009 financial crisis. Judging from polls and surveys, those who fit that description – clustered and concentrated in large metro areas, and on the coasts especially – support Clinton and the Democrats by wide margins.\n\n***\n\nIs either side right? Most economists see the liberal internationalist order backed by the law establishing the rules of engagement in free markets as a key element to the emergence of a several billion-strong global middle class. In general, that view is correct. But it still tends to gloss over just how wrenching it is to be among the tens of millions in the United States caught in the vortex of rapid change. It does these global laggards no good to say that they have bigger homes and longer lives and more possessions than their grandparents. They legitimately fear that they will lose those homes, be unable to afford healthcare, that they will see their communities crumble and their children’s hopes extinguished. And they see a world of others who appear to be doing better, who seem to be winning, and a political establishment that has promised everything and delivered what feels like nothing.\n\nThe voice of the so-called losers in this global competition is as loud, politically speaking, as it’s been in a long time. Hence Trump (not to mention Bernie Sanders’ powerful insurgency in the Democratic primaries). The last time so many in the United States were so sour about the inequities between those winning (the few) and those losing was at the dawn of the Progressive Movement in the 1890s. Many early Progressives rebelled against an elite vision of Social Darwinism then prevalent which said that the strong and the best thrive while the rest manage to eke out what they can. In 1896, the scion of that view was William Jennings Bryan, who painted a picture of the United States every bit as bleak and dark as Trump with his thundering about elites on the coasts crucifying hard worker labor and farmers on a “cross of gold.” Bryan lost two elections, and his zero-sum view never came to dominate American politics. Much of his message about inequality and the need to reform the system, however, was taken up by Theodore Roosevelt and generations of both Republicans and Democrats. Some of it harsh and redistributive, focused on trust busting and exerting American influence and prestige abroad, and much of it was about expanding opportunities for all.\n\nTrump also enjoys a good deal of sub-rosa support among business leaders and Wall Street, who certainly haven’t lack for economic benefits in today’s world. They aren’t supporting him with their money, but many of them detest Clinton and see Trump as expressing their world view. For Wall Street, that makes some sense, in that in the wake of the financial crisis, key aspects of finance are becoming less popular and less profitable. In that sense, finance, which was the winning sector of the economy from the mid-1980s through the mid-2000s, has been losing ground. The idea of gain and loss, and that every trade represents a winner and a loser, is deeply embedded in aspects of Wall Street.\n\nWe have, of course, no idea which candidate and which worldview will prevail in six weeks. But if Trump wins, he should remember: it is impossible to find any society and any point in American history where a zero-sum formula has led to increased affluence for the many and increased security. Zero-sum most often begets zero-sum, whether in the form of trade wars or actual wars. By contrast, the profound strength of the United States has been a vision of an open economy that thrives on education and innovation and an open world where the strength invariably overcomes the zero-sum countries and alliances that pepper the planet and always have. A vision of winners and losers invariably begets more winners and losers, and little else.\n\nZachary Karabell is head of global strategy at Envestnet and author of The Leading Indicators: A Short History of the Numbers That Rule Our World. He is a contributing editor at Politico Magazine.", "authors": ["Jack Shafer", "Erick Trickey", "Zachary Karabell"], "keywords": [], "meta_data": {"description": "He sees it as zero-sum. She believes all boats rise together. Hillary is right, but a lot of people are buying into Trump’s vision.", "og": {"site_name": "POLITICO Magazine", "description": "He sees it as zero-sum. She believes all boats rise together. Hillary is right, but a lot of people are buying into Trump’s vision.", "title": "Trump vs. Clinton: A Fundamental Clash over How the Economy Works", "url": "http://politi.co/2dpbEor", "image": "http://static.politico.com/e9/11/6144cdc24e319c921fea909525b3/manufacturing.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/trump-clinton-economy-disagreement-2016-214296", "images": ["https://static.politico.com/dims4/default/8a1ce5d/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fe9%2F11%2F6144cdc24e319c921fea909525b3%2Fmanufacturing.jpg", "http://static.politico.com/e9/11/6144cdc24e319c921fea909525b3/manufacturing.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Trump vs. Clinton: A Fundamental Clash over How the Economy Works", "url": "http://politi.co/2de2qs0", "summary": "", "movies": [], "publish_date": {"$date": 1474974420000}, "source": "http://politi.co"}
