{"top_img": "http://oppositionreport.com/wp-content/uploads/2016/09/trump-jr.jpg", "text": "\n\nPosted by Frank Wilkenmeyer on 19 Sep 2016\n\nDonald Trump Jr. Is quite possibly the dumbest person ever to take to social media. In the very least, it’s a tossup between him and little brother Eric, who just yesterday made a fool of himself with his childish self-admiration for being the answer to a crossword puzzle question, along with free wifi, pushup bras and Bozo the Clown.\n\nTogether, the dimwitted duo provide enough social media fodder to make fun of them well into the next generation with posts to spare. When this election is finally over, it will be almost sad to see them fade back into oblivion. Maybe we’ll keep track of their Twitter accounts just for a giggle every now and then.\n\nToday’s silliness begins with Oompa Loompa Jr. pinning a tweet that is certainly relevant to a particularly volatile national discussion happening right now: Colin Kaepernick and the National Anthem. As more and more athletes decide to take a knee in protest to support Black Lives Matter, more and more conservatives trash them for it, calling them unpatriotic and demanding they stop getting media coverage. Lord Cheeto II has been one of the most vocal, accusing Kaepernick of disrespecting our troops and those who died for his freedom.\n\nFor the left, it’s a simple matter of the 1st Amendment. Regardless of how you feel about the issue, these athletes have the right to express themselves. Yes, that means from government oppression and prosecution and not public criticism, but let’s not forget that it’s people like Little Comb-Over who are calling for police to stop providing protection for these athletes, for their employers to terminate their contracts and some have even gone so far as to suggest they be jailed for treason.\n\nFor years, we’ve known that the only constitutional amendment conservatives care about is the second, so when this tweet appeared pinned to Mini Douche’s Twitter account this morning, I couldn’t help but bust out in hysterical laughter:\n\nClearly when you’re the son of pure evil you have a hard time understanding the words you use. When “liberals” — otherwise known as “sane people” — try to explain why people like Kaepernick and those who have followed his lead are expressing that very right, we’re attacked in a frenzy of hate by people who think placing your hand over your heart and singing a song is mandatory patriotism. It’s not. The first amendment is exactly today what it was when the founders added it to the framework of a growing nation in 1789; the right to be you.\n\nThe Supreme Court has sided with those “liberals” every time the issue of free speech is tied to something conservatives think should be compulsory, like the pledge of allegiance and school prayer. I’ve said it already once in this article and thousands of times in my everyday life and I’ll say it again: The 2nd Amendment is the only one they see as absolute. All others are open to the interpretation of some holier than thou asshole like Donald Trump Jr.\n\nFeatured image by Gage Skidmore", "authors": [], "keywords": [], "meta_data": {"generator": "WordPress 4.8.1", "og": {"site_name": "Democrats Winning the Hearts and Minds", "description": "This jackass really needs to change his name to 'Hypocrite' and be done with it.", "title": "Donald Trump Jr. Just Pinned A Tweet So Stupid It Will Make Your Eyes Bleed", "url": "http://oppositionreport.com/donald-trump-jr-just-pinned-a-tweet-so-stupid-it-will-make-your-eyes-bleed/", "image": {"width": 1200, "identifier": "http://oppositionreport.com/wp-content/uploads/2016/09/trump-jr.jpg", "height": 630}, "locale": "en_US", "type": "article"}, "twitter": {"image": "http://oppositionreport.com/wp-content/uploads/2016/09/trump-jr.jpg?w=640", "card": "summary_large_image"}, "fb": {"app_id": 1555147758043521}, "msapplication-TileImage": "http://oppositionreport.com/wp-content/uploads/2015/12/cropped-2015-12-18_18-30-53-270x270.jpg", "viewport": "width=device-width; initial-scale=1; maximum-scale=1; user-scalable=0;"}, "canonical_link": "http://oppositionreport.com/donald-trump-jr-just-pinned-a-tweet-so-stupid-it-will-make-your-eyes-bleed/", "images": ["http://oppositionreport.com/wp-content/uploads/2017/08/trump-3-4.jpg", "http://oppositionreport.com/wp-content/uploads/2017/08/2017-08-29_20-03-22.jpg", "http://oppositionreport.com/wp-content/uploads/2016/09/1st-a.jpg", "http://oppositionreport.com/wp-content/uploads/2017/08/trump-2-9.jpg", "http://oppositionreport.com/wp-content/themes/ares/data/1488260315_logo copy.jpg", "http://0.gravatar.com/avatar/01de25360ee280d1bd8f0b9a1f25034e?s=50&d=mm&r=g", "http://oppositionreport.com/wp-content/uploads/2017/08/alex-wong-trumps-texas-getty-OR.jpg", "http://pixel.quantserve.com/pixel/p-CR_FUckkEtQQm.gif", "http://oppositionreport.com/wp-content/uploads/2016/09/trump-jr.jpg", "http://oppositionreport.com/wp-content/uploads/2017/08/2017-08-29_16-05-42.jpg"], "title": "Donald Trump Jr. Just Pinned A Tweet So Stupid It Will Make Your Eyes Bleed ‹ Opposition Report", "url": "http://winningdemocrats.com/donald-trump-jr-just-pinned-a-tweet-so-stupid-it-will-make-your-eyes-bleed/", "summary": "", "movies": [], "publish_date": null, "source": "http://winningdemocrats.com"}
