{"top_img": "http://static.politico.com/f8/28/9a24e8694be08b785928004f7e11/160920-lester-holt-gty-1160.jpg", "text": "Lester Holt, who anchors \"NBC Nightly News,\" will be the moderatorfor the first debate. | Getty Everything you need to know about Trump and Clinton’s first 2016 presidential debate\n\nWhen is the first general election presidential debate?\n\nThe first general election presidential debate of 2016 will be held at Hofstra University in Hempstead, New York on Sept. 26.\n\nStory Continued Below\n\nWhat time is the debate and how long is it?\n\nThe debate will start at 9:00 p.m. Eastern Time and run for 90 minutes without commercial breaks.\n\nHow can I watch the debate?\n\nIt will be broadcast on all of the major television networks, as well as the websites for major cable news channels and C-SPAN.\n\nWho will participate in the debate?\n\nFormer Secretary of State Hillary Clinton and celebrity real estate mogul Donald Trump. No other candidates qualified.\n\nWho will moderate the debate?\n\nLester Holt, who anchors \"NBC Nightly News,\" will be the moderator. It’s his second time serving in that role in the 2016 presidential cycle. Holt was also a moderator for the Democratic primary debate on January 17. On February 15, 2015 Holt became the substitute anchor of NBC Nightly News after Brian Williams was suspended. Four months later he became the permanent anchor.\n\nWhat is the format of the debate?\n\nThe debate will be divided into six segments of 15 minutes each. Each segment will start with a question from Holt, after which each candidates will have two minutes for an initial response and then will be allowed to respond to each other. On Monday, the Commission on Presidential Debates announced the tentative topics for the debate: “America's direction,” “achieving prosperity,” and “securing America.” The topics are subject to change based on news developments, according to the commission.\n\nWhy aren't Jill Stein or Gary Johnson participating in the debate?\n\nLibertarian Party presidential nominee Gary Johnson and Green Party presidential nominee Jill Stein were not invited by the presidential debate commission. The commission said it would only invite candidates that averaged 15 percent in five national polls it selected. Neither Johnson nor Stein made that threshold.\n\nWhat's at stake for Hillary Clinton?\n\nThe debate is Clinton’s chance to turn the page on a few weeks during which Trump has eaten much of the polling lead she built following her convention. Clinton’s camp has also been counting on her policy knowledge and debate experience to help her expose Trump’s weaknesses, but the Democratic candidate also comes in facing higher expectations than Trump.\n\nWhat's at stake for Donald Trump?\n\nTrump has been accused lacking policy gravitas and self-restraint, and both of those perceived weaknesses could be exposed in a debate, where candidates will be grilled on their familiarity with issues foreign and domestic and be expected to keep composed under rhetorical assault from their opponents. Trump has the advantage, however, of low expectations: At several turns in the presidential campaign, even modest pivots away from his bombastic primary style were hailed as pivots to professionalism, and a similar self-restraint — provided he still hits the high notes his supporters are expected — could help him clear the low bar again.\n\nWhat is the most watched debate in presidential history?\n\nIn 1980 the debate between President Jimmy Carter and Republican presidential nominee Ronald Reagan garnered a viewership of 80.6 million people, the largest television audience for a debate since Nielsen Ratings began collecting viewership data in 1976. In 2012, the first general election presidential debate between President Barack Obama and Republican presidential nominee Mitt Romney attracted about 70 million viewers.\n\nWhat's the most-watched television moment of all time?\n\nSuper Bowl XLIX in 2015 on NBC is currently the most watched television program in U.S. history, attracting 114 million viewers, according to NBC News. The New England Patriots played against the Seattle Seahawks, winning the game 28-24.\n\nStill, that pales in comparison to the estimated 600 million people worldwide who watched Neil Armstrong and Buzz Aldrin make the first moon landing on July 20, 1969, or the estimated 750 million people worldwide that watched Prince Charles of Wales marry Lady Diana Spencer on July 29, 1981.\n\nAuthors:", "authors": ["Jack Shafer", "Daniel Strauss"], "keywords": [], "meta_data": {"description": "The first debate takes place Monday.", "og": {"site_name": "POLITICO", "description": "The first debate takes place Monday.", "title": "Everything you need to know about Trump and Clinton’s first 2016 presidential debate", "url": "http://politi.co/2cPgGXB", "image": "http://static.politico.com/f8/28/9a24e8694be08b785928004f7e11/160920-lester-holt-gty-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/daniel.strauss.758"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/everything-you-need-to-know-about-first-trump-clinton-debate-228417", "images": ["https://static.politico.com/dims4/default/1e668d0/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Ff8%2F28%2F9a24e8694be08b785928004f7e11%2F160920-lester-holt-gty-1160.jpg", "http://static.politico.com/f8/28/9a24e8694be08b785928004f7e11/160920-lester-holt-gty-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Everything you need to know about Trump and Clinton’s first 2016 presidential debate", "url": "http://politi.co/2d3mmAD", "summary": "", "movies": [], "publish_date": {"$date": 1474381829000}, "source": "http://politi.co"}
