{"top_img": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160719214618-chris-christie-rnc-super-tease.jpg", "text": "Newark (CNN) Former Port Authority executives and New Jersey Gov. Chris Christie staffers planned to make the traffic from the September 2013 lane closures at the George Washington Bridge \"as bad as possible,\" according to testimony heard in federal court Monday.\n\nDavid Wildstein, former Port Authority director of Interstate Capital Projects, testified that in June 2013, Bridget Kelly, Christie's former deputy chief of staff, was upset that their office had not secured the endorsement of the Democratic mayor of Fort Lee New Jersey, Mark Sokolich, for Christie's reelection campaign.\n\nWildstein, who has previously pleaded guilty to one charge of conspiracy to commit fraud on federally funded property and one civil rights violation, told Kelly that shutting down access lanes to the George Washington Bridge to put some political pressure on Sokolich was an option, according to his testimony.\n\nWildstein is testifying as part of his plea deal. Sokolich testified last week that being a \"Democrat in a Democratic town\" put him in an uncomfortable position vis-a-vis a Christie endorsement, and he eventually declined because he did not want to \"alienate anyone.\"\n\nOn August 13, 2013, and as CNN has previously reported, Wildstein received an email from Kelly saying: \"Time for some traffic problems in Fort Lee.\"\n\n\"Got it,\" Wildstein responded.\n\nA phone call with Kelly the same day established the lane closures would go forward, it was revealed in testimony Monday.\n\n\"I did not question senior officials in the office of the governor,\" Wildstein said in court when asked if he questioned the decision.\n\nWildstein became the de facto organizer of the eventual lane closures, and communicated every step of the way with Kelly and his then-boss, former Port Authority deputy executive director, Bill Baroni, according to his testimony.\n\nWildstein and Kelly discussed and agreed that there would be no advance notice of the closures to Fort Lee officials or the public. They discussed how the Port Authority would respond to any inquiries, and agreed that all calls would be directed to Baroni's office and Baroni would not return the calls, testimony revealed.\n\nThis \"radio silence\" policy was discussed with and approved by Baroni, Wildstein said.\n\nWildstein testified that that lack of advance notice was to \"maximize the impact on Fort Lee.\" Wildstein also recalled discussing the timing of the closures with Baroni and Kelly.\n\nBaroni asked when the first day of school in Fort Lee was, and when Wildstein told Baroni it was September 9, Baroni smiled and said, \"Fantastic,\" according to Wildstein's testimony. Kelly agreed on the September 9 date.\n\nWildstein testified that his initial plan was to shut down all three Fort Lee access lanes, but after discussing the matter with Port Authority engineers who feared this could cause \"sideswipe crashes,\" Wildstein recommended to Baroni and Kelly that they shut down two lanes.\n\nOn Friday, September 6, 2013, Wildstein informed several Port Authority staffers of the closures that were scheduled to begin on Monday, September 9.\n\nBob Durando, Port Authority general manager of the George Washington Bridge expressed concern, telling Wildstein that the closures would cause a \"mess.\"\n\nWildstein told Durando the closures would be going forward, and to prepare accordingly.\n\n\"I told him not to say anything to anybody,\" Wildstein testified. Wildstein told Durando to direct any inquiries he gets during the closures to Baroni's office.\n\nWildstein then informed former Port Authority chief engineer, Peter Zipf, of the closures, and asked Zipf to organize a way to get \"some numbers\" on the traffic patterns.\n\nWildstein also informed Cedrick Fulton, Port Authority director of Tunnels, Bridges and Terminals. Fulton asked if Port Authority executive director, Patrick Foye, was aware. Wildstein testified that he told Fulton \"yes,\" but that this was a lie.\n\nAll of these staffers were under the impression that the closures were part of a traffic study.\n\nOn the day the closures began, Wildstein watched the traffic build up on screens inside a Port Authority administration building on the Fort Lee side of the George Washington Bridge.\n\n\"I knew the plan that I had set into motion was working,\" Wildstein testified.\n\nA Port Authority lieutenant also drove Wildstein around Fort Lee so Wildstein could see the traffic on the ground.\n\nWildstein testified that he called Kelly that morning to tell her that traffic was building up, and \"she was pleased.\"\n\nSeveral calls and emails began coming in to Baroni and Wildstein from Fort Lee officials, including the mayor, Sokolich, but their plan of \"radio silence\" was put into effect and no messages were returned.\n\nLast week, Wildstein testified that Baroni's role at the bi-state agency was essentially to be a representative of Christie's administration and that their top priority was to represent Christie's office's interests.\n\nWildstein said he created a phrase that he and Baroni often used, \"the one constituent rule.\" This referred to the fact that Governor Christie's opinion or good favor was the only one that mattered when it came to Port Authority affairs. Wildstein and Baroni used the \"one constituent rule\" as a barometer by which decisions would be made.\n\nKelly and Baroni face conspiracy and fraud charges in connection with Bridgegate. Their attorneys have previously said they will both testify in their own defenses.", "authors": ["Dominique Debucquoy-dodley"], "keywords": [], "meta_data": {"description": "Former Port Authority executives and New Jersey Gov. Chris Christie staffers planned to make the traffic from the September 2013 lane closures at the George Washington Bridge \"as bad as possible,\" according to testimony heard in federal court Monday.", "pubdate": "2016-09-26T22:41:18Z", "author": "Dominique Debucquoy-Dodley, CNN", "og": {"site_name": "CNN", "description": "Former Port Authority executives and New Jersey Gov. Chris Christie staffers planned to make the traffic from the September 2013 lane closures at the George Washington Bridge \"as bad as possible,\" according to testimony heard in federal court Monday.", "pubdate": "2016-09-26T22:41:18Z", "title": "Bridgegate: Port Authority officials planned to make Fort Lee 'traffic jam as bad as possible'", "url": "http://www.cnn.com/2016/09/26/politics/bridgegate-chris-christie-port-authority-fort-lee/index.html", "image": {"width": 1100, "identifier": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160719214618-chris-christie-rnc-super-tease.jpg", "height": 619}, "type": "article"}, "section": "politics", "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "thumbnail": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160719214618-chris-christie-rnc-super-tease.jpg", "template-top": "politics,art-vid", "vr": {"canonical": "http://www.cnn.com/2016/09/26/politics/bridgegate-chris-christie-port-authority-fort-lee/index.html"}, "keywords": "politics, Bridgegate: Port Authority officials planned to make Fort Lee 'traffic jam as bad as possible' - CNNPolitics", "lastmod": "2016-09-26T22:41:18Z", "twitter": {"image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160719214618-chris-christie-rnc-super-tease.jpg", "description": "Former Port Authority executives and New Jersey Gov. Chris Christie staffers planned to make the traffic from the September 2013 lane closures at the George Washington Bridge \"as bad as possible,\" according to testimony heard in federal court Monday.", "card": "summary_large_image", "title": "Bridgegate: Port Authority officials planned to make Fort Lee 'traffic jam as bad as possible'"}, "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "canonical_link": "http://www.cnn.com/2016/09/26/politics/bridgegate-chris-christie-port-authority-fort-lee/index.html", "images": ["http://i2.cdn.cnn.com/cnnnext/dam/assets/160719214618-chris-christie-rnc-super-tease.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160802200536-chris-christie-august-2-2016-exlarge-169.jpg"], "title": "Bridgegate: Port Authority officials planned to make Fort Lee 'traffic jam as bad as possible'", "url": "http://cnn.it/2dn8vWp", "summary": "", "movies": [], "publish_date": null, "source": "http://cnn.it"}
