{"top_img": "http://static.politico.com/e5/97/d2ead6b84b78899644374ac6c1c6/20160919-dept-homeland-security-ap.jpg", "text": "The Department of Homeland Security's inspector general said that 858 people who were ordered to be deported or removed instead eventually received citizenship. | AP Photo U.S. mistakenly granted citizenship to hundreds of immigrants\n\nAt least 858 people who had previously been ordered to be deported or removed from the U.S. were instead granted citizenship, the Department of Homeland Security’s inspector general announced Monday.\n\nThe mistaken citizenships were granted, the Department of Homeland Security explained in a press release, because neither its digital fingerprint repository nor the FBI’s fingerprint repository contain exhaustive records of individuals who have previously been deported.\n\nStory Continued Below\n\nThe discovery was made by the Department of Homeland Security’s office of inspector general, which released a report Monday on the incomplete fingerprint records and the mistakenly granted citizenships. The Department of Homeland Security’s records are incomplete, the release said, because paper fingerprint cards used before 2008 were not consistently digitized. The FBI’s records are incomplete because fingerprints collected during immigration enforcement activities were not always shared with the bureau.\n\nThe inspector general's report specified that those granted citizenship were only \"potentially\" ineligible and were not necessarily granted citizenship incorrectly. A statement from the Department of Homeland Security said that the department is taking steps to correct the issues that led to the incomplete fingerprint records and that not all applicants whose records were incomplete wound up being granted citizenship.\n\n\"It is important to note that the fact that fingerprint records in these cases may have been incomplete at the time of the naturalization interview does not necessarily mean that the applicant was in fact granted naturalization, or that the applicant obtained naturalization fraudulently. Preliminary results from the file reviews show that in a significant number of these cases naturalization had been denied and that, in some, naturalization was not improperly granted,\" department spokesman Neema Hakim said in the statement. \"Other cases are subject to ongoing criminal investigation or to denaturalization proceedings that are pending or completed.\"\n\nIn at least three cases, the inspector general’s office discovered previously-deported individuals who were granted citizenship and then obtained clearance for “security-sensitive work at commercial airports or maritime facilities and vessels.” The release said all three have since had their security credentials revoked.\n\n“This situation created opportunities for individuals to gain the rights and privileges of U.S. citizenship through fraud,” Inspector General John Roth said. “To prevent fraud and ensure thorough review of naturalization applications, [U.S. Citizenship and Immigration Services] needs access to these fingerprint records.”\n\nRepublican presidential candidate Donald Trump has made the vetting of immigrants as they enter the U.S. a major part of his presidential platform, suggesting during the GOP primary that America temporarily ban all Muslims from entering the U.S. until a more stringent vetting process could be put in place. He has since backed away from that proposal, which drew widespread criticism from both parties, in favor of a ban on immigration from “any nation that has been compromised by terrorism.”\n\nAuthors:", "authors": ["Jack Shafer", "Louis Nelson"], "keywords": [], "meta_data": {"description": "The mistaken citizenships were granted, the Department of Homeland Security explained in a press release, because neither its digital fingerprint repository nor the FBI’s fingerprint repository contain exhaustive records of individuals who have previously been deported.", "og": {"site_name": "POLITICO", "description": "The mistaken citizenships were granted, the Department of Homeland Security explained in a press release, because neither its digital fingerprint repository nor the FBI’s fingerprint repository contain exhaustive records of individuals who have previously been deported.", "title": "U.S. mistakenly granted citizenship to hundreds of immigrants", "url": "http://politi.co/2cKWMg6", "image": "http://static.politico.com/e5/97/d2ead6b84b78899644374ac6c1c6/20160919-dept-homeland-security-ap.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/politico/"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/immigrants-mistakenly-granted-citizenship-228355", "images": ["http://static.politico.com/e5/97/d2ead6b84b78899644374ac6c1c6/20160919-dept-homeland-security-ap.jpg", "https://static.politico.com/dims4/default/7fb1924/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fe5%2F97%2Fd2ead6b84b78899644374ac6c1c6%2F20160919-dept-homeland-security-ap.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "U.S. mistakenly granted citizenship to hundreds of immigrants", "url": "http://politi.co/2cKqILg", "summary": "", "movies": [], "publish_date": {"$date": 1474283649000}, "source": "http://politi.co"}
