{"top_img": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160919171855-berm-camp-2-super-tease.jpg", "text": "United Nations (CNN) President Barack Obama made an impassioned plea Tuesday for countries to fulfill a moral obligation to alleviate a global refugee crisis \"of epic proportions,\" despite a political backlash in the US against absorbing those fleeing Middle East violence.\n\nThe President's interest in calling attention to the tens of millions of displaced people around the world, and pushing back against the anti-refugee tenor, was underscored by his decision to convene a Leaders' Summit on Refugees at the United Nations Tuesday.\n\nAt the summit, he also rejected another aspect of the American political debate swirling around accepting foreigners -- GOP presidential nominee Donald Trump's call to build a wall along the US-Mexico border.\n\n\"This crisis is a test of our common humanity. Whether we give into suspicion and fear and build walls, or whether we see ourselves in another,\" Obama said, though he didn't mention Trump by name.\n\nObama singled out the situation in Syria, which has displaced 4.8 million people so far, as particularly \"unacceptable.\"\n\nJUST WATCHED President Obama at the UN: Then and now Replay More Videos ... MUST WATCH President Obama at the UN: Then and now 01:45\n\n\"We are not as unified as we should be in pushing to make it stop,\" he said, describing the global refugee crisis as both a humanitarian and security challenge that tests countries' ability to take collective action.\n\n\"I called this summit because this crisis is one of the most urgent tests of our time,\" he said. \"Just as failure to act in the past -- for example, by turning away Jews fleeing Nazi Germany -- is a stain on our collective conscience, I believe history will judge us harshly if we do not rise to this moment.\"\n\nThe refugee issue is one that's captured the world's attention more in the past two years than at perhaps any time since World War II, seared into the public's consciousness by photos like that of a 3-year-old Syrian boy who drowned in the Mediterranean and the flood of migrants into Europe.\n\nA recent study by from the UN's refugee agency estimated 65.3 million people were displaced from their homes by conflict or persecution in 2015, up by over five million from the prior year. Many are internally displaced within the borders of their own countries, but about 21.3 million are classified as refugees.\n\nObama's summit follows a similar UN-led meeting on the issue Monday, which drew attention to the crisis but offered little in the way of binding commitments.\n\n\"Make no mistake,\" US Secretary of State John Kerry said at the UN meeting, \"additional efforts are urgently needed.\"\n\nLeaders also called for a more orderly and equitable system to manage refugee flows -- acknowledging the burden is shouldered disproportionally by certain regions.\n\n\"You have to know that today the European Union has a clear objective to restore order on its external borders,\" European Council President Donald Tusk said in his remarks, signaling a growing sense that patience in Europe with the migrant flow is wearing thin.\n\n\"There will be no repeat of the year 2015 with more than one and a half million irregular migrants,\" he added.\n\nThe Obama administration is hopeful the Leader's Summit on Tuesday afternoon can build momentum for more action.\n\nNational Security Advisor Susan Rice in June announced that the gathering -- co-hosted along with the US by Canada, Ethiopia, Germany, Jordan, Mexico, Sweden and the UN Secretary General -- would seek an increase in funding of at least 30%, a doubling of permanent resettlement, and expanded access to education and work rights for refugees.\n\n\"Reaching these ambitious objectives will be challenging, yet the level of need demands no less,\" Rice said in a statement.\n\nBut aid groups are skeptical the summit will prompt the kind of action they say is desperately needed.\n\n\"We have to be optimistic that we'll see some real concrete commitments,\" said Amnesty International's Interim Executive Director Margaret Huang. \"But the truth is, even if those numbers are hit, it's nowhere near what's actually needed.\"\n\nThe US is a major contributor of humanitarian aid for countries that host large numbers of refugees -- particularly Syria's neighbors -- and plans to increase the number of refugees it will take in to America from 85,000 in 2016 to 110,000 next year.\n\nThe President's chief spokesman last week conceded that even as the administration calls for greater global action, it is limited in what it can do.\n\n\"The President's commitment to ensuring that the United States plays a leading role on this issue is not shared by a lot of people in Congress, including by a lot of people in the Republican majority in Congress,\" Press Secretary Josh Earnest told reporters. \"And that has an impact in terms of the resources that are dedicated to this effort.\"\n\nVetting efforts to screen refugees, he noted, \"are not cheap.\"\n\nDavid Miliband, president of the International Rescue Committee and a former British Foreign Secretary, said he's hopeful but waiting to see whether any agreements are backed up with action.\n\n\"The scale of the global refugee problem demands an appropriate scale of response,\" Miliband told CNN. \"Governments around the world haven't, in the main, been responding with the right degree of compassion or competence up to now.\"\n\nBut the co-hosts of the Leaders' Summit said in a statement they were pleased with \"new and significant humanitarian contributions\" from world leaders.\n\n\"We sought a $3 billion increase in global humanitarian financing and commitments to maintain funding in future years,\" they said. \"Through our mutual efforts, over the course of 2016, the 32 donors participating today have contributed this year roughly 4.5 billion additional dollars to UN appeals and international humanitarian organizations than in 2015.\"\n\nAs they await action from world leaders in New York, a group of volunteers in London laid out a \"life jacket graveyard\" Monday to draw attention to the plight of thousands of migrants who've lost their lives attempting hazardous boat crossings in the Mediterranean.\n\nThe conflict in Syria and resulting migrant crisis in the Middle East and Europe have dominated headlines over the past 18 months, but refugees are a global problem.\n\nPerhaps nowhere are they more prevalent than in the so-called \"global south\" -- the developing countries of the southern hemisphere. Last week, South Sudan joined the ranks of Syria, Afghanistan, and Somalia -- countries with over 1 million of their citizens living as refugees abroad.\n\nAnd protracted conflict in places like Somalia have led to a generation of lifelong refugees -- men and women in their twenties who've never known life outside of a camp.\n\n\"These are not people who can envision what life would be like if they were returned to their home countries,\" Huang said.", "authors": ["Laura Koran"], "keywords": [], "meta_data": {"description": "President Barack Obama made an impassioned plea Tuesday for countries to fulfill a moral obligation to alleviate a global refugee crisis \"of epic proportions,\" despite a political backlash in the US against absorbing those fleeing Middle East violence.", "pubdate": "2016-09-20T16:16:28Z", "author": "Laura Koran", "og": {"site_name": "CNN", "description": "President Barack Obama made an impassioned plea Tuesday for countries to fulfill a moral obligation to alleviate a global refugee crisis \"of epic proportions,\" despite a political backlash in the US against absorbing those fleeing Middle East violence.", "pubdate": "2016-09-20T16:16:28Z", "title": "Obama: Refugee crisis is test of our humanity", "url": "http://www.cnn.com/2016/09/20/politics/obama-refugees-summit/index.html", "image": {"width": 1100, "identifier": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160919171855-berm-camp-2-super-tease.jpg", "height": 619}, "type": "article"}, "section": "politics", "fb": {"app_id": 80401312489, "pages": "5550296508,18793419640"}, "thumbnail": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160919171855-berm-camp-2-super-tease.jpg", "template-top": "politics,art-vid", "vr": {"canonical": "http://www.cnn.com/2016/09/20/politics/obama-refugees-summit/index.html"}, "keywords": "politics, Obama: Refugee crisis is test of our humanity - CNNPolitics", "lastmod": "2016-09-20T22:23:38Z", "twitter": {"image": "http://i2.cdn.cnn.com/cnnnext/dam/assets/160919171855-berm-camp-2-super-tease.jpg", "description": "President Barack Obama made an impassioned plea Tuesday for countries to fulfill a moral obligation to alleviate a global refugee crisis \"of epic proportions,\" despite a political backlash in the US against absorbing those fleeing Middle East violence.", "card": "summary_large_image", "title": "Obama: Refugee crisis is test of our humanity"}, "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "canonical_link": "http://www.cnn.com/2016/09/20/politics/obama-refugees-summit/index.html", "images": ["http://i2.cdn.cnn.com/cnnnext/dam/assets/160920104405-02-obama-un-0920-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160920152131-obama-united-nations-general-assembly-origwx-bw-00000210-exlarge-169.jpg", "data:image/gif;base64,R0lGODlhEAAJAJEAAAAAAP///////wAAACH5BAEAAAIALAAAAAAQAAkAAAIKlI+py+0Po5yUFQA7", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160920093742-obama-leaders-collage-edited-large-169.jpg", "http://i2.cdn.cnn.com/cnnnext/dam/assets/160919171855-berm-camp-2-super-tease.jpg"], "title": "Obama: Refugee crisis is test of our humanity", "url": "http://cnn.it/2deTou2", "summary": "", "movies": [], "publish_date": null, "source": "http://cnn.it"}
