{"top_img": "http://static.politico.com/b3/b4/aa7c3c41406e99c0682c5ad45c57/20160927-kellyanne-conway-ap.jpg", "text": "Kellyanne Conway praised Donald Trump for showing restraint at the debate. | AP Photo Trump camp: ‘Donald Trump is guilty of answering the question asked’\n\nDonald Trump’s campaign manager Kellyanne Conway praised her candidate for showing restraint at the tail end of Monday night’s debate when Hillary Clinton attacked his history of disrespectful and derogatory remarks about women.\n\n“I have to say, certainly as a woman, I appreciated the restraint at the end. I am not sure I would have been able to exercise it myself, but restraint is a virtue and it’s a presidential virtue,” Conway told MSNBC’s Morning Joe Tuesday. “To tell Hillary Clinton after she accused him of being terrible with women, to tell Hillary Clinton ‘I was prepared to go rough tonight and I am not going to do it because your husband and daughter are here.’ That is going to grow in importance in the next couple of days in a moment of great temperance and restraint.”\n\nStory Continued Below\n\nWith just minutes left in Monday night’s debate, Clinton managed to work in a line of attack against Trump that she has also used most-recently in a new campaign ad, hitting the Manhattan billionaire as “a man who has called women pigs, slobs and dogs.” After the debate, Trump told CNN that ““I was going to say something extremely rough to Hillary, to her family, and I said to myself, I can't do it,” indicating that he was uncomfortable leveling such an attack with Clinton’s husband and daughter in the audience.\n\nTuesday morning, Conway was happy to fill in the blanks for viewers wondering what exactly Trump’s attack might have been.\n\n“I think he could have said what was on millions of Americans’ minds, no doubt, that are we going to relitigate who’s been good to women and who hasn't?” Conway said. “They’re taking a couple comments he made over any number of years as a private citizen, versus where he could have gone, and I think we all can finish the sentence. People did last night, they finished the sentence, they said, you know, maybe he was going to talk about Bill Clinton's record with women, but he decided not to.”\n\nOverall, Conway said Clinton failed to deliver a “knockout punch” that would have forced Trump into a major error. Instead, Trump’s campaign manager said the former secretary of state came off as rehearsed and determined to squeeze her talking points into the conversation, regardless of how pertinent they were to the questions of moderator Lester Holt.\n\n“Donald Trump is guilty of answering the question asked, and I thought Hillary Clinton last night wanted to make sure that no matter what was asked and what was answered, she was going to repeat back to us everything that she had learned in the last week or two weeks, and that’s fine,” Conway said.\n\n“I don't think Hillary Clinton did a thing last night. If somebody can correct me, what was the big takeaway moment where she offers this huge vision for economic growth and an end to wage stagnation,” she added. “So I didn't hear any big moment for her where she convinced the 70 percent of Americans who want change, who want a different direction, that she's their gal.”\n\nAuthors:", "authors": ["Jack Shafer", "Louis Nelson"], "keywords": [], "meta_data": {"description": "&quot;Certainly as a woman, I appreciated the restraint at the end,&quot; she says.", "og": {"site_name": "POLITICO", "description": "&quot;Certainly as a woman, I appreciated the restraint at the end,&quot; she says.", "title": "Trump camp: ‘Donald Trump is guilty of answering the question asked’", "url": "http://politi.co/2cytmQm", "image": "http://static.politico.com/b3/b4/aa7c3c41406e99c0682c5ad45c57/20160927-kellyanne-conway-ap.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/politico/"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/trump-first-debate-performance-campaign-react-228764", "images": ["https://static.politico.com/dims4/default/11e595e/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fb3%2Fb4%2Faa7c3c41406e99c0682c5ad45c57%2F20160927-kellyanne-conway-ap.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "http://static.politico.com/b3/b4/aa7c3c41406e99c0682c5ad45c57/20160927-kellyanne-conway-ap.jpg"], "title": "Trump camp: ‘Donald Trump is guilty of answering the question asked’", "url": "http://politi.co/2doygoM", "summary": "", "movies": [], "publish_date": {"$date": 1474960666000}, "source": "http://politi.co"}
