{"top_img": "http://static.politico.com/f8/4f/00fe12244f809df3cf4b53864559/160921-donald-trump-gty-1160.jpg", "text": "CLEVELAND — Donald Trump campaigned Wednesday morning in a church in a historically African-American community and sold himself as the candidate who could fix the problems of urban America. Within hours, Trump was proposing a vast expansion of “stop-and-frisk” policing policies that have proved explosively controversial in black communities for encouraging racial profiling.\n\nIt was just another day in Trump’s up-and-down black outreach campaign undertaken to wash away the stain of racism charges lobbed at him by Hillary Clinton and the Democrats.\n\nStory Continued Below\n\nThe effort has taken Trump from a black church in inner-city Detroit earlier this month to addressing largely white audiences in rural North Carolina where, on Tuesday evening, he proclaimed in a small town named after a slaveholder that black communities \"are absolutely in the worst shape that they’ve ever been in before, ever, ever, ever.\"\n\nOn Wednesday, Trump hit the campaign trail with former boxing promoter Don King — who dropped the N-word before a group of pastors at a Cleveland church while extolling Trump as a “gladiator.” King hailed Trump as the rare candidate who would overthrow the existing political system under which minorities have suffered.\n\n“The system is the problem, and he’s the only gladiator that will take on the system,” King said.\n\nAfter the church event, Trump sat for a “town hall” with Fox News host and unabashed supporter Sean Hannity. Asked by an audience member what he would do to address “violence in the black community,” Trump embraced stop-and-frisk.\n\n“We did it in New York, it worked incredibly well,” Trump said.\n\nFierce opposition to that policy in minority communities was among the issues that Bill de Blasio rode to prominence and, ultimately, the mayor’s office.\n\nBut even before Trump’s stop-and-frisk comments, he was taking heat for his “ever, ever, ever” remark Tuesday night.\n\n“I don't know what Mr. Trump is talking about to say that the situation for African-Americans is worse than it's ever been,” Rep. John Lewis, the Democratic civil rights icon, said Wednesday on MSNBC. “Is he talking about worse than slavery? Worse than the system of segregation and racial discrimination — when we couldn't take a seat at the lunch counter and be served? Worse than being denied the right to register to vote, to participate in the democratic process and live in certain neighborhoods and communities?”\n\nTrump’s polling numbers among African-American voters have been dismal — in the low single digits — and some believe his outreach to black voters is as much about convincing moderate white voters, particularly women and those in the suburbs, that he is not racist. Trump regularly brings up his outreach to blacks — “What do you have to lose?” he says — to largely white audiences.\n\nAt the New Spirit Revival Center in Cleveland, Trump assembled an eclectic kitchen cabinet of some of his closest advisers to attest to his beliefs before a diverse crowd.\n\nSeated to Trump’s right was Mike Pence, his soft-spoken running mate. To his left, outspoken longtime attorney Michael Cohen. Behind him: King (“there’s only one,” Trump said), former presidential rival Ben Carson (“tough”), retired Lt. Gen. Michael Flynn (“a tough general”) and former \"Apprentice\" star Omarosa Manigault (“a wonderful woman”), who has helped with Trump’s black outreach.\n\n“I’m different from a lot of Republicans, frankly,” Trump said from the pulpit.\n\nTrump, who has called himself the “law and order” candidate, criticized the police officer who shot an unarmed black man in Oklahoma last week. Trump said he had watched the video and that the officer may have been “choking” in the fatal shooting. Trump has mostly defended the police in such incidents.\n\n\"Now, did she get scared? Was she choking? What happened? But maybe people like that, people that choke, people that do that, maybe they can't be doing what they're doing, OK?”\n\nKing, whom top GOP officials had pushed not to speak at the Republican National Convention due to a past manslaughter conviction, was given the prime slot of introducing Trump at a forum billed as a pastors leadership conference.\n\nKing, clothed in a sparkling jacket and clutching the flags of Israel and the United States, argued repeatedly that “the system” had oppressed minorities and women and only Trump can upend it entirely.\n\n“Every white woman should cast a vote for Donald Trump,” said King, who also went on an extended riff about the struggles of African-Americans.\n\n“I told Michael Jackson, I said if you're poor, you're a poor Negro — I would use the N-word — but if you rich, you are a rich Negro; if you are intelligent, intellectual, you're an intellectual Negro; if you're a dancing and sliding and gliding n-----, I mean, Negro,” King said.\n\nWhen Trump took his turn at the pulpit minutes later, he grinned, “Ah, there’s only one Don King.”\n\nBefore King, Cohen, Trump’s attorney, used his time at the church to slash at the “disgusting, liberal, mainstream media” and its casting of Trump as a “racist.”\n\n“The word of the 2016 election has somehow become ‘racist,’” Cohen complained. “I’ve lost count as to how many times the disgusting, liberal, mainstream media have attempted to label Mr. Donald Trump as racist, a xenophobe and a bigot. And let’s not forget, sexist, misogynist, narcissist, Islamophobe, anti-Hispanic, anti-Semite demagogue. And countless others. It’s disgraceful.”\n\nCohen said, “Not only is Donald Trump not a racist, he believes that all people are part of one race: the human race.”\n\nTrump insisted that Democrats had abandoned black voters, and that he wouldn’t.\n\n“They come and they take your vote,” Trump said, “and they say they’ll see you in four years.”\n\n\n\nAuthors:", "authors": ["Jack Shafer", "Louis Nelson", "Matthew Nussbaum", "Shane Goldmacher"], "keywords": [], "meta_data": {"description": "The Republican nominee brought together an eclectic group of surrogates to pitch him to women and minorities.", "og": {"site_name": "POLITICO", "description": "The Republican nominee brought together an eclectic group of surrogates to pitch him to women and minorities.", "title": "Trump’s puzzling pitch to black voters", "url": "http://politi.co/2dbc2GW", "image": "http://static.politico.com/f8/4f/00fe12244f809df3cf4b53864559/160921-donald-trump-gty-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/is-trump-racist-228472", "images": ["http://static.politico.com/f8/4f/00fe12244f809df3cf4b53864559/160921-donald-trump-gty-1160.jpg", "https://static.politico.com/dims4/default/2ec857c/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Ff8%2F4f%2F00fe12244f809df3cf4b53864559%2F160921-donald-trump-gty-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Trump’s puzzling pitch to black voters", "url": "http://politi.co/2cRQmvU", "summary": "", "movies": [], "publish_date": {"$date": 1474460641000}, "source": "http://politi.co"}
