{"top_img": "http://static.politico.com/8a/9d/adba7001480b9de50c6e605cc3b4/gettyimages-600031536.jpg", "text": "I was a Democrat all my life. I came to Washington to serve President John Kennedy and Attorney General Robert Kennedy. When the president was murdered and his brother struck off on his own, I joined his Senate campaign and staff as his legislative assistant and speechwriter, until his presidential campaign ended with his own assassination. I ran on a (losing) Democratic ticket in the New York state elections of 1970. When I was working to enact my own program of police reform in the 1980s and 1990s, then-Governor Bill Clinton was chairman of my National Committee for the Police Corps.\n\nThis year, I will vote to elect Donald Trump as president of the United States.\n\nStory Continued Below\n\nSo profound a change, and a decent respect for old friendships, requires me to deliver a public accounting for this decision.\n\nHere it is. John and Robert Kennedy devoted their greatest commitments and energies to the prevention of war and the preservation of peace. To them that was not an abstract formula but the necessary foundation of human life. But today’s Democrats have become the Party of War: a home for arms merchants, mercenaries, academic war planners, lobbyists for every foreign intervention, promoters of color revolutions, failed generals, exploiters of the natural resources of corrupt governments. We have American military bases in 80 countries, and there are now American military personnel on the ground in about 130 countries, a remarkable achievement since there are only 192 recognized countries. Generals and admirals announce our national policies. Theater commanders are our principal ambassadors. Our first answer to trouble or opposition of any kind seems always to be a military movement or action.\n\nNor has the Democratic Party candidate for president this year, Hillary Clinton, sought peace. Instead she has pushed America into successive invasions, successive efforts at “regime change.” She has sought to prevent Americans from seeking friendship or cooperation with President Vladimir Putin of Russia by characterizing him as “another Hitler.” She proclaims herself ready to invade Syria immediately after taking the oath of office. Her shadow War Cabinet brims with the architects of war and disaster for the past decades, the neocons who led us to our present pass, in Iraq, in Afghanistan, Syria, Libya, Yemen, in Ukraine, unrepentant of all past errors, ready to resume it all with fresh trillions and fresh blood. And the Democrats she leads seem intent on worsening relations with Russia, for example by sending American warships into the Black Sea, or by introducing nuclear weapons ever closer to Russia itself.\n\nIn fact, in all the years of the so-called War on Terror, only one potential American president has had the intelligence, the vision, the sheer sanity to see that America cannot fight the entire world at once; who sees that America’s natural and necessary allies in this fight must include the advanced and civilized nations that are most exposed and experienced in their own terror wars, and have the requisite military power and willingness to use it. Only one American candidate has pointed out how senseless it is to seek confrontation with Russia and China, at the same time that we are trying to suppress the very jihadist movements that they also are attacking.\n\nThat candidate is Donald Trump. Throughout this campaign, he has said that as president, he would quickly sit down with President Putin and seek relaxation of tensions between our nations, and possible collaboration in the fight against terrorists. On this ground alone, he marks himself as greatly superior to all his competitors, earlier in the primaries and now in the general election.\n\nIt must also be said: Mr. Trump is an imperfect candidate, and he would surely be an imperfect president. He is crude, often vulgar. He has areas of great ignorance. He insults people and inflicts unnecessary harm. He would be twice the candidate he is if he used half the words. He is often intemperate; though it is not Trump but his opponent who is so intemperate as to compare Putin’s moves in Ukraine to what Hitler did—an insult that throughout all the Cold War and to this day, no American president has ever offered to any Soviet or Russian leader, not even the enormous butcher Josef Stalin, with whom in fact we joined to win the Second World War. And it is not Mr. Trump but Michael Morell, a former CIA director now high in the councils of the Democratic candidate, who has publicly suggested, without rebuke from anyone, that we should begin “killing Russians,” a doubly illegal act of war.\n\nMoreover Trump marks himself as a man of singular political courage, willing to defy the hysteria of the Washington war hawks, the establishment and the mainstream media who daily describe him as virtually anti-American for daring to voice ideas and opinions at variance with their one-note devotion to war.\n\n***\n\nJohn Kennedy admired political courage. He began his first campaign for Congress at the height of the Cold War by saying, “Above all, day and night, with every ounce of ingenuity and industry we possess, we must work for peace. We must not have another war.” Years later, in the Cuban Missile Crisis of 1962, he and his brother had to overcome great opposition from their own military commanders, government officials and other public leaders, to prevent a war with the Soviet Union: there were 13 men in the ExComm room, and Robert Kennedy said that had any 1 of 8 of them been president, the crisis would have exploded in nuclear war.\n\nBut within a year thereafter, deeply affected by the barely-averted catastrophe, President Kennedy had forged a close working relationship with Soviet leader Nikita Khrushchev, spoke all over the country to promote peace policies, and delivered his historic American University speech of 1963. Our “strategy of peace,” he said, was “not a Pax Americana enforced on the world by American weapons of war.” Rather it must be founded on negotiation, cooperation in areas of mutual interest, and recognition that “our most basic common link is that we all inhabit this small planet. We all breathe the same air. We all cherish our children’s future. And we are all mortal.” As to our great adversary the Soviet Union, he said, “we must reexamine our own attitude—as individuals and as a nation—for our attitude is as essential as theirs.”\n\nSix months later he was dead; and it was Robert Kennedy who must resume the effort. Robert Kennedy made ratification of the Nuclear Test Ban Treaty the early centerpiece of his Senate career. But as President Lyndon Johnson escalated the war in Vietnam, it was that war which forced Robert Kennedy to make his doomed race for the presidency. Wherever he campaigned in 1968, to virtually every audience, he spoke of the loss, the horror, the infinite tragedy of that war, in words that could be and must be repeated today, after 15 consecutive years of wars all over the world.\n\n“Our brave young men,” he said, “are dying in the swamps of Southeast Asia. Which of them might have written a poem? Which of them might have cured cancer? Which of them might have played in a World Series or given us the gift of laughter from the stage or helped build a bridge or a university? Which of them would have taught a child to read? It is our responsibility to let these men live ... It is indecent if they die because of the empty vanity of their country.”\n\nHe also urged that we consider the Vietnamese mother, desperately trying to shield her baby from the fire from the sky, sent by machines from a country she could barely understand. He demanded of his colleagues, on the Senate floor, to answer what gave us the right to destroy remote villages on the other side of the world, to arrogate to ourselves the power of God, the rule of life and death over others. “All this is our responsibility,” he said, “not just a nation’s responsibility but yours and mine.”\n\nJohn and Robert Kennedy were no pacifists, nor ignorant of the realities of power. But they required that great power be used with great precision and restraint, and with humility. Both knew that their own lives were hostage to the possibility of assassination, yet they kept trying to guide us toward peace up to the moments of their death.\n\nThe legacy of JFK & RFK is “being abandoned by today’s Democratic Party.”\n\nTheirs is the legacy that is being abandoned by today’s Democratic Party. We have broken one Middle Eastern nation after another. Hundreds of cities and villages lie in ruins, hundreds of thousands are dead, millions are refugees; and, for all the press and political thundering against the menace of ISIS, Al Qaeda, or Islamic terrorism generally, our military leaders offer no prospects of victory. They cannot tell us what victory would require or mean; though they are quick to assure us, as in Libya today, that this conflict will go on indefinitely. They cannot even explain how some of our current allies (example Turkey) are bombing and shelling others of our purported allies (example the Kurds). So a Democratic administration, carrying on the work of the Bush presidency, without thought and without question, year after year, has kept sending more young men and women into the grinder.\n\nScores of Democratic elected officials once spoke and worked tirelessly to end our disastrous war in Vietnam. Today there is only the voice of the marvelous Democratic member of Congress Tulsi Gabbard, a reservist who has twice deployed to Iraq and knows of what she speaks. And it is a Democratic president who sends an endless parade of drones to nations all over the world, flaunting for all to see America’s unique military technology, coupled with our seeming complete carelessness in how that technological prowess destroys people and nations.\n\nMost amazing of all, however, is that as we proclaim that the terrorists threaten Europe, threaten the United States, threaten Western civilization itself—as we face all this, we do not concentrate our military might against this unique threat.\n\nWhere are we sending our warriors, our ships, our planes? Why to Russia, which the U.S. general who commands NATO has announced is the prime “existential” threat to America. As you read this, ground, air and naval forces of NATO, led and largely paid for by the United States, have been moving about the Western borders of Russia, carrying out the largest military maneuvers since World War II. At the same time, our most powerful carriers and naval air forces have been steaming about the South China Sea, there perhaps to find encounters of unknowable potential with the rising forces of China, our second said to be “existential” enemy.\n\nThere are no Russian terrorists ravaging France or Italy or America. ISIS is not to be found on Russian soil. The only Russian terrorists who have attacked the West are the Islamists whom President Putin first asked us to join in the fight against in 1999. The only Chinese terrorists are Uighurs who are attacking not us but China itself. It would seem elementary common sense that America would have long since sought, not to fight with Russia and China, but to cooperate with both to suppress the terrorists and the terrorism that have plagued us for over a generation, including the ISIS that is terrorizing Europe today.\n\nFormer Defense Secretary William Perry, a Democrat, warns that we are now, today, “on the threshold of a new Cold War. ... a new nuclear arms race. ... the likelihood of a nuclear catastrophe is actually greater than it was during the Cold War.”\n\nSurely the wars and threats of war already on our horizon would be more than enough for any empire; and our empire, as every thoughtful person knows, is already staggering under the immeasurable loads of debt piled up by America, by our governments, our corporations, our households, our students, and our promises of unlimited benefits in the future. The years of constant combat have exhausted our military. False hopes and vain promises of victory have burnt up the caches of idealism and patriotic commitment with which we began the wars a generation ago. Our forces are worn out, especially the elite warrior units that have been constantly deployed for more than a decade.\n\nBut, ominously, there is more to come, more that already stares us in the face. The dire events of this summer have shown us the true danger that lurks here at home. This is not a danger imported from Syria or Iraq or Russia. Our greatest menace is the danger of our own history, our inheritance to the latest day.\n\nFor the fact is that while we chased a chimera of peace and justice in lands far from our own, imposing ourselves and our concepts on strangers who rejected our teachings, we were neglecting our own country and our own people, our own neighbors, our own children and our own friends. And now we can see the result. The violence we took to other countries bounces back to our own. The money we squandered on bombs in Iraq was not available for our own schools. The brilliant young men and women, who gave up their bodies and their lives on distant battlefields, were not here to teach and mentor and guide the young people of the ghetto. They were not here to police the mean streets, to suppress and eliminate the crime that is the greatest cause of poverty. They were not here to bring the protection and the blessings of the American Constitution to the least among us. They were not here to protect American cities and enrich American lives.\n\nAnd they were not here to keep Americans and American children from murdering American police officers. This is our true present danger.\n\n***\n\nSo my hope for America is this. First, we must begin immediately to end our involvement in endless, unnecessary and therefore murderous wars. We need our best young people to help us here at home. We need to stop the reckless military spending on more destructive armaments. We need to breathe free again.\n\nWe must and will defend civilized order against its deadly enemies. ISIS and its brethren must be eliminated: no quarter, no hesitation. But we will need to engage all civilized peoples in our mutual defense. We must abandon foolish skirmishes and petty jealousies. We must end our reflexive efforts to dominate other developed nations, especially Russia and China.\n\nPresident Kennedy told us over and over that our own peace and security, in this dangerous world, would depend upon peaceful and cooperative relations with Russia and the Russian people; indeed, at the end of his presidency, Ronald Reagan said the same. Fools in Washington, intent on world domination, would have us ignore that wisdom now. But it is the wisdom that we need to preserve the world and our children’s future.\n\nSecond, we must at the same time begin to recover our domestic peace. There are many ills to be cured, many shortcomings to be righted.\n\nBut nothing can be accomplished in the midst of a war against police, an insurrection against the Constitution itself. Our clear priority is reinforcement of our police and police departments. We need many more and better police. We need them to be better trained, not as warriors but as shepherds, as leaders and teachers of the young, as peacemakers in communities that have not known real peace for many years. We need our very best young people, not getting their legs blown off by IEDs in Afghanistan, but saving all of our lives in St. Louis and Chicago and Detroit and Baton Rouge and all the other wasted places in our own land.\n\nDonald Trump has been mocked mercilessly for saying, “America first.” But to demand that all the actions of government, at home or abroad, be first directed at the interests and well-being of our own country is not old-fashioned or outmoded. Rather it represents the deepest wisdom and tradition of American statesmen from the founders on. Only with a clear vision of what is truly in the interests of our nation and our fellow citizens, and a full commitment to those interests, can we act wisely at home and in the world beyond.\n\nFinally, our president has told us we must lower our voices. Of course we do not hope for domestic discord. But the people of the United States have perhaps stood silent for too long. The elites of opinion and government have not hesitated to offer us instruction, from the heights of their power and eminence. These are the people who have led us into useless foreign war and limitless domestic disaster. This president tells us that we must now spend another trillion dollars on new nuclear weapons systems, and when we ask who will be the target for these world-destroying weapons, says only, “There can be no business as usual with Russia.”\n\nSurely he must have misspoken, for anyone can see we are on a course of madness. We simply cannot fight the entire world, Russia and China and all the nations of the Mideast, and fight a war at home all at the same time.\n\nAnd therefore we citizens must not be silent, we must speak as with one great overwhelming voice, a voice as powerful as Washington, as Jefferson, as Lincoln, as Martin Luther King:\n\nReturn to the wisdom of the founders, who fought necessary wars to defend the Union, but sought no foreign conquests.\n\nDo not step over the threshold of a new Cold War, a new nuclear arms race with Russia and China, but seek to enlist them in common ventures to resist the forces of terror and chaos that threaten all civilization.\n\nCommit to our own domestic peace and security, rather than persist in a vain effort to control the lives and affairs of 200 foreign nations.\n\nThis, as I understand it, is the platform of Donald Trump. It was not the Republican Party platform, and he had to overcome much opposition within his party to gain the nomination. But it is his platform. It is the platform he has restated again and again, with determination, and with the courage and persistence to outlast his critics. It is a platform that, even in these troubled days, could fulfill the hopes of the greatest Americans of all parties.\n\nWell may we seek reassurance whether Mr. Trump has the kind of cool judgment and self-possession that the presidency requires; the judgment that comes to the fore in crisis, that saves a nation or perhaps a world. No one can ever truly know how a future president will react to such enormous pressures. But Trump has given some evidence. He set himself a unique course toward the office, disdaining conventional wisdom, speaking more truth about politics and about America than any conventional consultant or adviser thought prudent or wise. And yet it is his independence, his willingness to name facts however unpleasant, together with his great political courage, that can give us hope and even some confidence that he may be up to the job. Perhaps most important, he has proven that he is not intimidated by the generals and admirals who have up to this day had their unimpeded way with our wars and our budgets, to the immense loss of both.\n\nFlawed as he may be, Trump is telling more of the truth than politicians of our day. Most important, he offers a path away from constant war, a path of businesslike accommodation with all reasonable people and nations, concentrating our forces and efforts against the true enemies of civilization. Thus, to dwell on his faults and errors is to evade the great questions of war and peace, life and death for our people and our country. You and I will have to compensate for his deficits of civility, in return for peace, we may hope as Lincoln hoped, among ourselves and with all nations.\n\nTruly, America first, last and always; for ourselves and for our posterity. These are the reasons why I will vote for Donald Trump for president.\n\nAdam Walinsky worked in the Department of Justice during the Kennedy administration and later served as legislative assistant and speechwriter to Sen. Robert F. Kennedy.", "authors": ["Jack Shafer", "Michael Hirsh", "Mikhail Zygar", "Bruce Blair", "Peter Edelman", "Adam Walinsky"], "keywords": [], "meta_data": {"description": "The Democratic Party has become something both JFK and RFK would deplore—the party of war.", "og": {"site_name": "POLITICO Magazine", "description": "The Democratic Party has become something both JFK and RFK would deplore—the party of war.", "title": "I Was RFK’s Speechwriter. Now I’m Voting for Trump. Here’s Why.", "url": "http://politi.co/2cm59wy", "image": "http://static.politico.com/8a/9d/adba7001480b9de50c6e605cc3b4/gettyimages-600031536.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politicomag", "card": "summary_large_image", "creator": "@politicomag"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/magazine/story/2016/09/rfk-trump-2016-democratic-party-speechwriter-214270", "images": ["https://static.politico.com/dims4/default/62b5482/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2F8a%2F9d%2Fadba7001480b9de50c6e605cc3b4%2Fgettyimages-600031536.jpg", "http://static.politico.com/8a/9d/adba7001480b9de50c6e605cc3b4/gettyimages-600031536.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "I Was RFK’s Speechwriter. Now I’m Voting for Trump. Here’s Why.", "url": "http://politi.co/2cQNTTT", "summary": "", "movies": [], "publish_date": {"$date": 1474472520000}, "source": "http://politi.co"}
