{"top_img": "http://static.politico.com/c0/fa/5f8c72c64089a064978442322665/trump-16-gty-1160.jpg", "text": "\"He didn't ask her about a lot of things she should have been asked about,\" Donald Trump said about Lester Holt. | Getty Post-debate, Trump team hits moderator Holt for 'some hostile questions'\n\nDonald Trump and his campaign complained Tuesday morning that debate moderator Lester Holt targeted him for unfair questioning while neglecting to ask Hillary Clinton about any of her various scandals.\n\n“They were leaving all of her little goodies out. They didn't ask her about, you know, much,” Trump said on Fox News’s “Fox and Friends.” “But I was asked about my tax returns, which I've told about 500 times. But, you know, I think I did — I think I really did well when we were asked normal questions. I think I did really well in answering those questions, but those questions are not answerable in a positive light.”\n\nStory Continued Below\n\nStill, Trump was upbeat overall about the debate, which he said “went really well” despite “some hostile questions.” The Manhattan billionaire gave Holt a C+ for his performance as moderator, praising him for his issue-based questions in the first 45 minutes of the debate but attacking him as biased for a series of more direct questions about a housing discrimination lawsuit filed against Trump’s real estate company in the 1970s, even though it was Clinton who brought up the Justice Department lawsuit.\n\n“I didn’t think he did a bad job. You know, when you look at it, you watch the last four questions, he hit me on birther, he hit he on a housing deal from many years ago that I settled with no recourse and no guilt. He asked me about that,” Trump said. “That's a beauty to be asked, you know, 40-year-old lawsuit, or older. I just hate to say it’s older because then you’ll know, then [Fox News anchor Ainsley Earhardt] will say “’Wow I didn’t know Trump was that old.’ Hey, she’ll be unimpressed.”\n\n“Well, he didn't ask her about the emails at all. He didn't ask her about her scandals. He didn't ask her about the Benghazi deal that she destroyed,” he said. “He didn't ask her about a lot of things she should have been asked about. I mean, you know, there's no question about it. He didn't ask about her foundation.”\n\nAttacking Holt became a running theme from Trump's campaign Tuesday morning, as both his running mate and campaign manager took to the morning shows to criticize the moderator.\n\n\"I was disappointed that Lester did not get into some of the issues that had been in so much of the forefront of Hillary Clinton’s candidacy – the FBI investigation, pay to play, the whole disastrous events that took place in Benghazi and Libya – that never came up,\" GOP vice presidential candidate Mike Pence said on Good Morning America.\n\nTrump's campaign manager Kellyanne Conway took a similar line, saying on CNN Tuesday that there were topics she wished Holt would have raised.\n\n“I just would have liked to have heard more about Benghazi or e-mails or the Clinton foundation since these are very clearly in the news,\" she said. \"You know, one of our guests last night was Mark Geist, not Mark Cuban, Mark Geist, who's a Benghazi hero and survivor. And You know, he was within several feet or yards of them and I think it's a good reminder to be Americans of what her record is on that particular issue.\"\n\nWhile the Republican nominee insisted that he had outperformed Clinton at the debate, he said that he struggled throughout the night with a defective microphone that made him difficult to hear for the audience in the debate hall. Trump suggested that perhaps his microphone, which he said worked perfectly earlier in the day, had been tampered with.\n\n“I had a problem with a microphone that didn't work. I don’t know if you saw that in the room, but my microphone was terrible. I wonder, was it set up that way on purpose,” he said. “My microphone, in the room they couldn't hear me, you know, it was going on and off. Which isn't exactly great. I wonder if it was set up that way, but it was terrible.”\n\nAsked if Clinton had successfully managed to get under his skin during their 90-minute back-and-forth, Trump said she had not until the end of the debate, when the former secretary of state brought up Miss Universe winner Alicia Machado, who Trump called “Miss Piggy” and “Miss Housekeeping” because of her Latin heritage. Addressing Trump directly about the name-calling, Clinton said, “Donald, she has a name. Her name is Alicia Machado. And she has become a US citizen and you can bet she is going to vote this November.\"\n\n“I know that person, that person was a Miss Universe person, and she was the worst we ever had. The worst, the absolute worst. She was impossible, and she was a Miss Universe contestant and ultimately a winner who they had a tremendously difficult time with as Miss Universe,” he said. “She was the winner, and, you know, she gained a massive amount of weight, and it was a real problem. We had a real problem. Not only that, her attitude, and we had a real problem with her, so Hillary went back into the years and she found this girl. This was many years ago, and found the girl and talked about her like she was mother Teresa and it wasn't quite that way, but that's okay. Hillary has to do what she has to do.”\n\nAuthors:", "authors": ["Jack Shafer", "Louis Nelson"], "keywords": [], "meta_data": {"description": "&quot;He didn't ask her about a lot of things she should have been asked about,&quot; Trump said about Holt.", "og": {"site_name": "POLITICO", "description": "&quot;He didn't ask her about a lot of things she should have been asked about,&quot; Trump said about Holt.", "title": "Post-debate, Trump team hits moderator Holt for 'some hostile questions'", "url": "http://politi.co/2doiqLm", "image": "http://static.politico.com/c0/fa/5f8c72c64089a064978442322665/trump-16-gty-1160.jpg", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "article": {"author": "https://www.facebook.com/politico/"}, "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/trump-reacts-to-first-debate-performance-228766", "images": ["http://static.politico.com/c0/fa/5f8c72c64089a064978442322665/trump-16-gty-1160.jpg", "https://static.politico.com/dims4/default/2970ef6/2147483647/resize/1160x%3E/quality/90/?url=http%3A%2F%2Fstatic.politico.com%2Fc0%2Ffa%2F5f8c72c64089a064978442322665%2Ftrump-16-gty-1160.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Post-debate, Trump team hits moderator Holt for 'some hostile questions'", "url": "http://politi.co/2dojlvi", "summary": "", "movies": [], "publish_date": {"$date": 1474963260000}, "source": "http://politi.co"}
