{"top_img": "http://v.politico.com/images/1155968404/201609/2114/1155968404_5135624082001_5135621845001-vs.jpg?pubId=1155968404", "text": "Bobby Knight: Nobody can 'correct mistakes' like Trump\n\nOver the course of his 75 years on and off the basketball court, Bobby Knight said Wednesday that he has never met anyone who can fix mistakes quite like Donald Trump.\n\n\"There’s nobody that I’ve met in my lifetime that has a better grasp of how to correct mistakes and how to look at what’s wrong and how to correct what’s wrong and how to get it going right,\" Knight told an audience in Toledo, Ohio, his home state. \"And I think that is the most important thing that can be brought to the next president of the United States. And there’s nobody who has a better background in correcting things that are going wrong and getting things going in the right direction and developing those things — the best person ever has been Donald Trump.\"\n\nStory Continued Below\n\nBack on the campaign trail with Trump after several months, Knight extolled the Republican nominee as \"not just an American; he’s a world figure.\"\n\n\"He’s known all over the world. Donald Trump put a lot of businesses together,\" the coach continued. \"United States around the world. A lot of businesses. Created a lot of jobs, thousands of jobs for people around the world.\"\n\nAnd Trump, Knight later indicated, is the person for the White House.\n\n\"Believe me when I tell you, I think you’re all gonna agree on this: Our next president is gonna inherit a hell of a lot of problems, and it’s gonna take a problem solver to get us back where we want to be and where we should be, and there is no one that even comes close to being smart, tough and dedicated completely to the United States of America,\" Knight said. He noted that the next president would have to deal with the national debt, \"immigration problems and on and on.\"\n\nRemarking on his study of history, Knight said that he had come to the conclusion that \"when I need somebody on my side to help us with problems, he's the first man I want to choose and the first man I want to see.\"\n\nKnight, clad in a red, white and blue gingham shirt, acknowledged to the crowd that he doesn't \"dress as well as politicians dress, but I want you to know, and it’s for all of you folks, I wore my red, white and blue shirt today.\"\n\n\"And I think that when you leave, I hope you all go out and buy a red, white and blue shirt, because it’s indicative of your love for the greatest country in the world, the United States,\" Knight said.\n\nAuthors:", "authors": ["Nick Gass", "Jack Shafer"], "keywords": [], "meta_data": {"description": "He extolled the Republican nominee as &quot;not just an American; He’s a world figure.&quot;", "og": {"site_name": "POLITICO", "description": "He extolled the Republican nominee as &quot;not just an American; He’s a world figure.&quot;", "title": "Bobby Knight: Nobody can 'correct mistakes' like Trump", "url": "http://politi.co/2cmHvQw", "image": "http://v.politico.com/images/1155968404/201609/2114/1155968404_5135624082001_5135621845001-vs.jpg?pubId=1155968404", "fb_appid": 114037015331397, "type": "article"}, "twitter": {"site": "@politico", "card": "summary_large_image", "creator": "@politico"}, "host": "www.politico.com", "fb": {"pages": 62317591679}, "build": "release/2017-maria 4b1f874 2017-08-24T15:20:21Z", "viewport": "width=device-width, initial-scale=1"}, "canonical_link": "http://www.politico.com/story/2016/09/bobby-knight-donald-trump-228483", "images": ["http://v.politico.com/images/1155968404/201609/2114/1155968404_5135624082001_5135621845001-vs.jpg?pubId=1155968404", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "title": "Bobby Knight: Nobody can 'correct mistakes' like Trump", "url": "http://politi.co/2cRiK2U", "summary": "", "movies": [], "publish_date": {"$date": 1474469645000}, "source": "http://politi.co"}
