{"top_img": "http://a.abcnews.com/images/Politics/AP_donald_trump_2_jt_160826_16x9_992.jpg", "text": "Less than a day after protests over the police killing of an African-American man turned violent in North Carolina, Republican presidential nominee Donald Trump placed some of the blame for the turmoil on the impact of drugs.\n\n\"If you're not aware, drugs are a very, very big factor in what you're watching on television at night,\" said Trump in a speech to the Shale Insight 2016 Conference in Pittsburgh today.\n\nOn Wednesday night, Charlotte experienced its second night of protests after the death of Keith Lamont Scott on Tuesday afternoon. Officers in riot gear confronted demonstrators in a downtown commercial area and employed tear gas to control crowds. One person is in critical condition after suffering an apparent gunshot wound.\n\nThe Republican nominee condemned the violence, calling for unity.\n\n\"Our country looks bad to the world, especially when we are supposed to be the world's leader. How can we lead when we can't even control our own cities? We honor and recognize the right of all Americans to peacefully assemble, protest and demonstrate, but there is no right to engage in violent disruption or to threaten the public safety and peace of others.\"\n\nHe continued to praise law enforcement officers, citing the challenges they face and calling for better training.\n\n\"It's tough being a police officer,\" Trump said. \"Police are entrusted with immense responsibility, and we must do everything we can to ensure that they are properly trained, that they respect all members of the public and that any wrongdoing is always — and it will be by them — vigorously addressed.\"\n\nBut aside from that one reference, amid his heavy-handed praise for law enforcement and condemnation of protesters, Trump never acknowledged any pattern of violence against African-Americans at the hands of police, which is precisely why so many protesters say they have taken to the streets. They cite the shooting deaths of dozens of other black Americans by police as cause to protest a system they say is dangerous and discriminatory and fails to prosecute far too many officers who kill African-Americans, in many instances unarmed.\n\nTrump in recent days has appealed to black Americans, asking them what they have to lose by voting for him, even as he paints an exceptionally grim portrait of black poverty and crime.\n\nDuring a rally earlier this week in North Carolina, Trump said, \"We're going to rebuild our inner cities because our African-American communities are absolutely in the worst shape they've ever been in before. Ever, ever, ever,\"\n\nMany African-Americans have bristled at that broad assertion. While many inner cities are plagued by crime and poverty, according to census data from 2015, 52.9 percent of black Americans age 25 or older hold some sort of college degree. A Pew report released in December shows that black adults experienced the largest income increase from 1971 to 2015 and were the only racial group to see a decrease in the percentage of low-income earners. And according to the Census Bureau, almost 73 percent of black Americans do not live in poverty.\n\nTrump, in an effort to reach out to the black community, visited Cleveland earlier this week, appearing at a black church. And during a town hall on the Fox News Channel Wednesday night, he was asked about the threat of violence.\n\n\"I would do stop and frisk. I think you have to,\" said Trump. \"We did it in New York. It worked incredibly well. And you have to be proactive and, you know, you really help people sort of change their mind automatically.\"\n\nBut this morning in an interview on \"Fox & Friends\" he stepped back from the statement, claiming he was referring to a strategy only for Chicago.\n\nIn Pittsburgh, Trump delineated a difference between what he called the \"violent disruptor\" and the rest of the black community. He said it was the country\"s job \"to make life more comfortable for the African-American parent trying to raise their kids in peace, to walk their children to school and to get their children great educations.\"", "authors": ["More Candace", "Adam Kelsey", "Abc News", "More Adam"], "keywords": [], "meta_data": {"fb_title": "Trump: Drugs a 'Very, Very Big Factor' in Charlotte Protests", "description": "The police-involved shooting of a black man has sparked protests in Charlotte.", "copyright": "Copyright (c) 2017 ABC News Internet Ventures", "author": "ABC News", "og": {"site_name": "ABC News", "description": "The police-involved shooting of a black man has sparked protests in Charlotte.", "title": "Trump: Drugs a 'Very, Very Big Factor' in Charlotte Protests", "url": "http://abcnews.go.com/Politics/donald-trump-drugs-big-factor-charlotte-protests/story?id=42282437", "image": "http://a.abcnews.com/images/Politics/AP_donald_trump_2_jt_160826_16x9_992.jpg", "type": "article"}, "twitter": {"description": "The police-involved shooting of a black man has sparked protests in Charlotte.", "title": "Trump: Drugs a 'Very, Very Big Factor' in Charlotte Protests", "url": "http://abcnews.go.com/Politics/donald-trump-drugs-big-factor-charlotte-protests/story?id=42282437", "image": "http://a.abcnews.com/images/Politics/AP_donald_trump_2_jt_160826_16x9_992.jpg", "creator": "@adam_kels", "site": "@ABC", "app": {"url": {"ipad": "abcnewsipad://link/story,42282437", "iphone": "abcnewsiphone://link/story,42282437", "googleplay": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/donald-trump-drugs-big-factor-charlotte-protests/story?id=42282437"}, "name": {"ipad": "ABC News", "iphone": "ABC News", "googleplay": "ABC News"}, "id": {"ipad": 306934135, "iphone": 300255638, "googleplay": "com.abc.abcnews"}}, "card": "summary_large_image"}, "robots": "index, follow", "DC.date.issued": "2016-09-22", "al": {"ipad": {"url": "abcnewsipad://link/story,42282437", "app_store_id": 380520716, "app_name": "ABC News for iPad"}, "web": {"url": "http://abcnews.go.com/Politics/donald-trump-drugs-big-factor-charlotte-protests/story?id=42282437"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/Politics/donald-trump-drugs-big-factor-charlotte-protests/story?id=42282437", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "iphone": {"url": "abcnewsiphone://link/story,42282437", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}}, "Date": "2016-09-22", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "Last-Modified": "2016-09-22 14:33:00", "keywords": "Donald Trump, Keith Lamont Scott, Protests, Election 2016, Charlotte, Pittsburgh, politics news, election news, political news, political news articles", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "news_keywords": "Donald Trump, Keith Lamont Scott, Protests, Election 2016, Charlotte, Pittsburgh"}, "canonical_link": "http://abcnews.go.com/Politics/donald-trump-drugs-big-factor-charlotte-protests/story?id=42282437", "images": ["http://www.googleadservices.com/pagead/conversion/1005826543/?value=0&label=1GPKCOHYjwMQ7-PO3wM&guid=ON&script=0", "http://a.abcnews.com/images/Politics/AP_donald_trump_2_jt_160826_12x5_992.jpg", "http://secure-us.imrworldwide.com/cgi-bin/m?ci=us-704476h&cg=0&cc=1&ts=noscript", "http://a.abcnews.com/images/Politics/AP_donald_trump_2_jt_160826_16x9_992.jpg"], "title": "Donald Trump: Drugs a 'Very, Very Big Factor' in Charlotte Protests", "url": "http://abcn.ws/2d4lNn9", "summary": "", "movies": [], "publish_date": null, "source": "http://abcn.ws"}
